Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <description>数模转换器（DAC）</description>
      <groupName>DAC</groupName>
      <baseAddress>0x40007400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>DAC 控制寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN1</name>
              <description>DAC 通道 1 使能位。此位由软件置位或清零，用于使能或禁用 DAC 通道 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEN1</name>
              <description>DAC 通道 1 触发使能位。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEL1</name>
              <description>DAC 通道 1 触发源选择位。这些位用于选择触发 DAC 通道 1 的外部事件。注意：仅当 TEN1 位 = 1（DAC 通道 1 触发使能）时有效。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WAVE1</name>
              <description>DAC 通道 1 噪声/三角波生成使能位。这些位由软件置位或清零。注意：仅当 TEN1 位 = 1（DAC 通道 1 触发使能）时有效。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MAMP1</name>
              <description>DAC 通道 1 屏蔽/幅值选择位。这些位由软件写入，用于在波形生成模式下选择 LFSR 屏蔽位，或在三角波生成模式下选择幅值。= 1011：不屏蔽 LFSR 的位[11:0] / 三角波幅值等于 4095。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DMAEN1</name>
              <description>DAC 通道 1 DMA 使能位。此位由软件置位或清零。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAUDRIE1</name>
              <description>DAC 通道 1 DMA 欠载中断使能位。此位由软件置位或清零。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEN1</name>
              <description>DAC 通道 1 校准使能位。此位由软件置位或清零，用于使能或禁用 DAC 通道 1 校准。仅当 DAC_CR 寄存器中 EN1 位 = 0 时才能写入（仅当 DAC 通道禁用时方可进入或退出校准模式）。否则，写操作将被忽略。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN2</name>
              <description>DAC 通道 2 使能位。此位由软件置位或清零，用于使能或禁用 DAC 通道 2。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEN2</name>
              <description>DAC 通道 2 触发使能位。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEL2</name>
              <description>DAC 通道 2 触发源选择位。这些位用于选择触发 DAC 通道 2 的外部事件。注意：仅当 TEN2 位 = 1（DAC 通道 2 触发使能）时有效。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WAVE2</name>
              <description>DAC 通道 2 噪声/三角波生成使能位。这些位由软件置位或复位。1x：使能三角波生成。注意：仅当 TEN2 位 = 1（DAC 通道 2 触发使能）时有效。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MAMP2</name>
              <description>DAC 通道 2 屏蔽/幅值选择位。这些位由软件写入，用于在波形生成模式下选择 LFSR 屏蔽位，或在三角波生成模式下选择幅值。= 1011：不屏蔽 LFSR 的位[11:0] / 三角波幅值等于 4095。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DMAEN2</name>
              <description>DAC 通道 2 DMA 使能位。此位由软件置位或清零。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAUDRIE2</name>
              <description>DAC 通道 2 DMA 欠载中断使能位。此位由软件置位或清零。</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEN2</name>
              <description>DAC 通道 2 校准使能位。此位由软件置位或清零，用于使能或禁用 DAC 通道 2 校准。仅当 DAC_CR 寄存器中 EN2 位 = 0 时才能写入（仅当 DAC 通道禁用时方可进入或退出校准模式）。否则，写操作将被忽略。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRGR</name>
          <displayName>SWTRGR</displayName>
          <description>DAC 软件触发寄存器</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWTRIG1</name>
              <description>DAC 通道 1 软件触发位。此位由软件置位，用于在软件触发模式下触发 DAC。注意：一旦 DAC_DHR1 寄存器的值加载到 DAC_DOR1 寄存器之后，此位由硬件清零（一个 APB1 时钟周期后）。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWTRIG2</name>
              <description>DAC 通道 2 软件触发位。此位由软件置位，用于在软件触发模式下触发 DAC。注意：一旦 DAC_DHR2 寄存器的值加载到 DAC_DOR2 寄存器之后，此位由硬件清零（一个 APB1 时钟周期后）。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R1</name>
          <displayName>DHR12R1</displayName>
          <description>DAC 通道 1 12 位右对齐数据保持寄存器</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>DAC 通道 1 12 位右对齐数据。这些位由软件写入，指定 DAC 通道 1 的 12 位数据。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L1</name>
          <displayName>DHR12L1</displayName>
          <description>DAC 通道 1 12 位左对齐数据保持寄存器</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>DAC 通道 1 12 位左对齐数据。这些位由软件写入，指定 DAC 通道 1 的 12 位数据。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R1</name>
          <displayName>DHR8R1</displayName>
          <description>DAC 通道 1 8 位右对齐数据保持寄存器</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>DAC 通道 1 8 位右对齐数据。这些位由软件写入，指定 DAC 通道 1 的 8 位数据。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R2</name>
          <displayName>DHR12R2</displayName>
          <description>DAC 通道 2 12 位右对齐数据保持寄存器</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>DAC 通道 2 12 位右对齐数据。这些位由软件写入，指定 DAC 通道 2 的 12 位数据。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L2</name>
          <displayName>DHR12L2</displayName>
          <description>DAC 通道 2 12 位左对齐数据保持寄存器</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>DAC 通道 2 12 位左对齐数据。这些位由软件写入，指定 DAC 通道 2 的 12 位数据。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R2</name>
          <displayName>DHR8R2</displayName>
          <description>DAC 通道 2 8 位右对齐数据保持寄存器</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>DAC 通道 2 8 位右对齐数据。这些位由软件写入，指定 DAC 通道 2 的 8 位数据。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12RD</name>
          <displayName>DHR12RD</displayName>
          <description>双 DAC 12 位右对齐数据保持寄存器</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>DAC 通道 1 12 位右对齐数据。这些位由软件写入，指定 DAC 通道 1 的 12 位数据。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>DAC 通道 2 12 位右对齐数据。这些位由软件写入，指定 DAC 通道 2 的 12 位数据。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12LD</name>
          <displayName>DHR12LD</displayName>
          <description>双 DAC 12 位左对齐数据保持寄存器</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>DAC 通道 1 12 位左对齐数据。这些位由软件写入，指定 DAC 通道 1 的 12 位数据。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>DAC 通道 2 12 位左对齐数据。这些位由软件写入，指定 DAC 通道 2 的 12 位数据。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8RD</name>
          <displayName>DHR8RD</displayName>
          <description>双 DAC 8 位右对齐数据保持寄存器</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>DAC 通道 1 8 位右对齐数据。这些位由软件写入，指定 DAC 通道 1 的 8 位数据。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>DAC 通道 2 8 位右对齐数据。这些位由软件写入，指定 DAC 通道 2 的 8 位数据。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR1</name>
          <displayName>DOR1</displayName>
          <description>DAC 通道 1 数据输出寄存器</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC1DOR</name>
              <description>DAC 通道 1 数据输出。这些位为只读，包含 DAC 通道 1 的输出数据。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR2</name>
          <displayName>DOR2</displayName>
          <description>DAC 通道 2 数据输出寄存器</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DACC2DOR</name>
              <description>DAC 通道 2 数据输出。这些位为只读，包含 DAC 通道 2 的输出数据。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>DAC 状态寄存器</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAUDR1</name>
              <description>DAC 通道 1 DMA 欠载标志位。此位由硬件置位，由软件清零（写入 1 清零）。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAL_FLAG1</name>
              <description>DAC 通道 1 校准偏移状态位。此位由硬件置位和清零。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BWST1</name>
              <description>DAC 通道 1 采样时间写入忙标志位。此位在采样保持模式使能后自动置位，并在每次软件写入 DAC_SHSR1 寄存器时置位。当 DAC_SHSR1 的写操作完成后，由硬件清零（大约需要 3 个 LSI 周期的同步时间）。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAUDR2</name>
              <description>DAC 通道 2 DMA 欠载标志位。此位由硬件置位，由软件清零（写入 1 清零）。</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAL_FLAG2</name>
              <description>DAC 通道 2 校准偏移状态位。此位由硬件置位和清零。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BWST2</name>
              <description>DAC 通道 2 采样时间写入忙标志位。此位在采样保持模式使能后自动置位，并在每次软件写入 DAC_SHSR2 寄存器时置位。当 DAC_SHSR2 的写操作完成后，由硬件清零（大约需要 3 个 LSI 周期的同步时间）。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>DAC 校准控制寄存器</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OTRIM1</name>
              <description>DAC 通道 1 偏移微调值。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OTRIM2</name>
              <description>DAC 通道 2 偏移微调值。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <displayName>MCR</displayName>
          <description>DAC 模式控制寄存器</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE1</name>
              <description>DAC 通道 1 模式选择位。这些位仅在 DAC 禁用且未处于校准模式时（即 DAC_CR 寄存器中 EN1 位 = 0 且 CEN1 位 = 0）才能写入。若 EN1 = 1 或 CEN1 = 1，写操作将被忽略。可由软件置位或清零以选择 DAC 通道 1 的工作模式：DAC 通道 1 正常模式，DAC 通道 1 采样保持模式。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MODE2</name>
              <description>DAC 通道 2 模式选择位。这些位仅在 DAC 禁用且未处于校准模式时（即 DAC_CR 寄存器中 EN2 位 = 0 且 CEN2 位 = 0）才能写入。若 EN2 = 1 或 CEN2 = 1，写操作将被忽略。可由软件置位或清零以选择 DAC 通道 2 的工作模式：DAC 通道 2 正常模式，DAC 通道 2 采样保持模式。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHSR1</name>
          <displayName>SHSR1</displayName>
          <description>DAC 采样保持采样时间寄存器 1</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSAMPLE1</name>
              <description>DAC 通道 1 采样时间（仅在采样保持模式下有效）。这些位可在 DAC 通道 1 禁用时写入，亦可在正常工作期间写入。对于后者，仅当 DAC_SR 寄存器的 BWSTx 为低电平时才能写入；若 BWSTx = 1，写操作将被忽略。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHSR2</name>
          <displayName>SHSR2</displayName>
          <description>DAC 采样保持采样时间寄存器 2</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSAMPLE2</name>
              <description>DAC 通道 2 采样时间（仅在采样保持模式下有效）。这些位可在 DAC 通道 2 禁用时写入，亦可在正常工作期间写入。对于后者，仅当 DAC_SR 寄存器的 BWSTx 为低电平时才能写入；若 BWSTx = 1，写操作将被忽略。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHHR</name>
          <displayName>SHHR</displayName>
          <description>DAC 采样保持保持时间寄存器</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>THOLD1</name>
              <description>DAC 通道 1 保持时间（仅在采样保持模式下有效）。保持时间 = (THOLD[9:0]) x T_LSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>THOLD2</name>
              <description>DAC 通道 2 保持时间（仅在采样保持模式下有效）。保持时间 = (THOLD[9:0]) x T_LSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHRR</name>
          <displayName>SHRR</displayName>
          <description>DAC 采样保持刷新时间寄存器</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>TREFRESH1</name>
              <description>DAC 通道 1 刷新时间（仅在采样保持模式下有效）。刷新时间 = (TREFRESH[7:0]) x T_LSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TREFRESH2</name>
              <description>DAC 通道 2 刷新时间（仅在采样保持模式下有效）。刷新时间 = (TREFRESH[7:0]) x T_LSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
