Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>BDMA_CCR3</name>
          <displayName>BDMA_CCR3</displayName>
          <description>BDMA 通道 3 配置寄存器</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>通道使能。当通道发生传输错误时，硬件会清零此位。在 BDMA_ISR 寄存器的 TEIFx 位被清零（通过置位 BDMA_IFCR 寄存器的 CTEIFx 位）之前，软件无法再次置位此位（即重新激活通道 x）。注意：此位由软件置位和清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCIE</name>
              <description>传输完成中断使能。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位并非只读。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HTIE</name>
              <description>半传输中断使能。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位并非只读。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEIE</name>
              <description>传输错误中断使能。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位并非只读。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>数据传输方向。此位仅在存储器到外设和外设到存储器模式下才应置位。源端属性由 PSIZE 和 PINC 以及 BDMA_CPARx 寄存器定义，这在存储器到存储器模式下同样有效。目标端属性由 MSIZE 和 MINC 以及 BDMA_CM0/1ARx 寄存器定义，这在外设到外设模式下同样有效。目标端属性由 PSIZE 和 PINC 以及 BDMA_CPARx 寄存器定义，这在存储器到存储器模式下同样有效。源端属性由 MSIZE 和 MINC 以及 BDMA_CM0/1ARx 寄存器定义，这在外设到外设模式下同样有效。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位为只读。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>从外设读取</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>从存储器读取</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIRC</name>
              <description>循环模式。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位并非只读。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINC</name>
              <description>外设地址递增模式。定义每次 DMA 传输到指定外设时的地址递增方式。在存储器到存储器模式下，若 DIR = 1 则此字段标识存储器目标地址，若 DIR = 0 则标识存储器源地址。在外设到外设模式下，若 DIR = 1 则此字段标识外设目标地址，若 DIR = 0 则标识外设源地址。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位为只读。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINC</name>
              <description>存储器地址递增模式。定义每次 DMA 传输到指定存储器时的地址递增方式。在存储器到存储器模式下，若 DIR = 1 则此字段标识存储器源地址，若 DIR = 0 则标识存储器目标地址。在外设到外设模式下，若 DIR = 1 则此字段标识外设源地址，若 DIR = 0 则标识外设目标地址。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位为只读。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSIZE</name>
              <description>外设数据宽度。定义每次 DMA 传输到指定外设的数据宽度。在存储器到存储器模式下，若 DIR = 1 则此字段标识存储器目标端，若 DIR = 0 则标识存储器源端。在外设到外设模式下，若 DIR = 1 则此字段标识外设目标端，若 DIR = 0 则标识外设源端。注意：此字段由软件置位和清零。通道使能（EN = 1）时不得写入此字段。通道使能（EN = 1）时此字段为只读。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>8 位</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>16 位</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>32 位</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIZE</name>
              <description>存储器数据宽度。定义每次 DMA 传输到指定存储器的数据宽度。在存储器到存储器模式下，若 DIR = 1 则此字段标识存储器源端，若 DIR = 0 则标识存储器目标端。在外设到外设模式下，若 DIR = 1 则此字段标识外设源端，若 DIR = 0 则标识外设目标端。注意：此字段由软件置位和清零。通道使能（EN = 1）时不得写入此字段。通道使能（EN = 1）时此字段为只读。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>8 位</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>16 位</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>32 位</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PL</name>
              <description>优先级。注意：此字段由软件置位和清零。通道使能（EN = 1）时不得写入此字段。通道使能（EN = 1）时此字段为只读。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>低</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>中</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>高</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>极高</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>存储器到存储器模式。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位为只读。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBM</name>
              <description>双缓冲模式。此位仅在存储器到外设和外设到存储器传输（MEM2MEM=0）时才应置位。处于双缓冲模式时 CIRC 位也必须置位。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位并非只读。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>禁止（BDMA 传输结束时存储器地址不切换）</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>使能（BDMA 传输结束时存储器地址切换）</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT</name>
              <description>双缓冲模式下 DMA 传输的当前目标存储器。在双缓冲模式下，硬件会在每次通道传输结束时翻转此位。注意：此位由软件置位和清零。通道使能（EN = 1）时不得写入此位。通道使能（EN = 1）时此位为只读。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>存储器 0（由 BDMA_CM0AR 指针寻址）</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>存储器 1（由 BDMA_CM1AR 指针寻址）</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CNDTR3</name>
          <displayName>BDMA_CNDTR3</displayName>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NDT</name>
              <description>待传输的数据量（0 到 2^16 - 1）。通道使能后，硬件会更新此字段：每次 BDMA 执行完一次“先读后写”的传输后该值递减，表示剩余待传输的数据项数量。若通道未处于循环模式（BDMA_CCRx 寄存器中 CIRC = 0），当编程设定的传输数据量完成后，此字段保持为 0。若通道处于循环模式（CIRC = 1），传输完成后会自动重新加载为之前编程设定的值。若此字段为 0，无论通道处于何种状态（使能与否），都不会执行任何传输。注意：此字段由软件置位和清零。通道使能（EN = 1）时不得写入此字段。通道使能（EN = 1）时此字段为只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CPAR3</name>
          <displayName>BDMA_CPAR3</displayName>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA</name>
              <description>外设地址。存放外设数据寄存器的基地址，数据即从该地址读出或写入。当 PSIZE[1:0] = 01（16 位）时，PA[31:0] 的位 0 被忽略，访问自动对齐到半字地址。当 PSIZE = 10（32 位）时，PA[31:0] 的位 1 和位 0 被忽略，访问自动对齐到字地址。在存储器到存储器模式下，若 DIR = 1 则此寄存器标识存储器目标地址，若 DIR = 0 则标识存储器源地址。在外设到外设模式下，若 DIR = 1 则此寄存器标识外设目标地址，若 DIR = 0 则标识外设源地址。注意：此寄存器由软件置位和清零。通道使能（EN = 1）时不得写入此寄存器。通道使能（EN = 1）时此寄存器并非只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CM0AR3</name>
          <displayName>BDMA_CM0AR3</displayName>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MA</name>
              <description>存储器地址。存放存储器的基地址，数据即从该地址读出或写入。当 MSIZE[1:0] = 01（16 位）时，MA[31:0] 的位 0 被忽略，访问自动对齐到半字地址。当 MSIZE = 10（32 位）时，MA[31:0] 的位 1 和位 0 被忽略，访问自动对齐到字地址。在存储器到存储器模式下，若 DIR = 1 则此寄存器标识存储器源地址，若 DIR = 0 则标识存储器目标地址。在外设到外设模式下，若 DIR = 1 则此寄存器标识外设源地址，若 DIR = 0 则标识外设目标地址。注意：此寄存器由软件置位和清零。通道使能（EN = 1）时不得写入此寄存器。通道使能（EN = 1）时此寄存器并非只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BDMA_CM1AR3</name>
          <displayName>BDMA_CM1AR3</displayName>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MA</name>
              <description>存储器地址。存放存储器的基地址，数据即从该地址读出或写入。当 MSIZE[1:0] = 01（16 位）时，MA[31:0] 的位 0 被忽略，访问自动对齐到半字地址。当 MSIZE = 10（32 位）时，MA[31:0] 的位 1 和位 0 被忽略，访问自动对齐到字地址。在存储器到存储器模式下，若 DIR = 1 则此寄存器标识存储器源地址，若 DIR = 0 则标识存储器目标地址。在外设到外设模式下，若 DIR = 1 则此寄存器标识外设源地址，若 DIR = 0 则标识外设目标地址。注意：此寄存器由软件置位和清零。通道使能（EN = 1）时不得写入此寄存器。通道使能（EN = 1）时此寄存器并非只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
