Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <description>DMA2D（Chrom-Art 2D DMA 加速器）</description>
      <groupName>DMA2D</groupName>
      <baseAddress>0x52001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA2D</name>
        <description>DMA2D 全局中断</description>
        <value>90</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>DMA2D 控制寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>START</name>
              <description>启动 将此位置 1 可根据各配置寄存器中加载的参数启动 DMA2D 传输</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>暂停 将此位置 1 可暂停当前传输。此位由软件置位和清零。当 START 位被硬件清零时，此位由硬件自动清零。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <description>中止 将此位置 1 可中止当前传输。此位由软件置位，并在 START 位被硬件清零时由硬件自动清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>传输错误中断使能 此位由软件置位和清零。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>传输完成中断使能 此位由软件置位和清零。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIE</name>
              <description>传输水印中断使能 此位由软件置位和清零。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIE</name>
              <description>CLUT 访问错误中断使能 此位由软件置位和清零。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIE</name>
              <description>CLUT 传输完成中断使能 此位由软件置位和清零。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIE</name>
              <description>配置错误中断使能 此位由软件置位和清零。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA2D 模式 此位由软件置位和清零。传输进行期间不可修改。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>DMA2D 中断状态寄存器</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEIF</name>
              <description>传输错误中断标志 当 DMA 传输（数据传输或自动 CLUT 加载）期间发生错误时，此位置 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <description>传输完成中断标志 当 DMA2D 传输操作完成（仅限数据传输）时，此位置 1。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIF</name>
              <description>传输水印中断标志 当水印行的最后一个像素传输完成时，此位置 1。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIF</name>
              <description>CLUT 访问错误中断标志 当 CLUT 正在从系统存储器自动复制到 DMA2D 内部存储器期间，CPU 访问了 CLUT 时，此位置 1。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>CLUT 传输完成中断标志 当 CLUT 从系统存储区复制到 DMA2D 内部存储器完成时，此位置 1。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIF</name>
              <description>配置错误中断标志 当 DMA2D_CR、DMA2DFGPFCCR 或 DMA2D_BGPFCCR 的 START 位置 1 但配置有误时，此位置 1。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <displayName>IFCR</displayName>
          <description>DMA2D 中断标志清零寄存器</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>清除传输错误中断标志 将此位写 1 可清零 DMA2D_ISR 寄存器中的 TEIF 标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>清除传输完成中断标志 将此位写 1 可清零 DMA2D_ISR 寄存器中的 TCIF 标志</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTWIF</name>
              <description>清除传输水印中断标志 将此位写 1 可清零 DMA2D_ISR 寄存器中的 TWIF 标志</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAECIF</name>
              <description>清除 CLUT 访问错误中断标志 将此位写 1 可清零 DMA2D_ISR 寄存器中的 CAEIF 标志</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF</name>
              <description>清除 CLUT 传输完成中断标志 将此位写 1 可清零 DMA2D_ISR 寄存器中的 CTCIF 标志</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCEIF</name>
              <description>清除配置错误中断标志 将此位写 1 可清零 DMA2D_ISR 寄存器中的 CEIF 标志</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGMAR</name>
          <displayName>FGMAR</displayName>
          <description>DMA2D 前景层存储器地址寄存器</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>存储器地址 前景图像数据的存放地址。此寄存器仅在数据传输禁用时可写。一旦数据传输开始，此寄存器即为只读。地址对齐方式必须与所选图像格式匹配，例如：32 位每像素格式必须 32 位对齐，16 位每像素格式必须 16 位对齐，4 位每像素格式必须 8 位对齐。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGOR</name>
          <displayName>FGOR</displayName>
          <description>DMA2D 前景层偏移寄存器</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>行偏移 前景层的行偏移量，以像素为单位。该值用于生成地址，在每行末尾累加以确定下一行的起始地址。这些位仅在数据传输禁用时可写。一旦数据传输开始，即变为只读。若图像格式为 4 位每像素，行偏移必须为偶数。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGMAR</name>
          <displayName>BGMAR</displayName>
          <description>DMA2D 背景层存储器地址寄存器</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>存储器地址 背景图像数据的存放地址。此寄存器仅在数据传输禁用时可写。一旦数据传输开始，此寄存器即为只读。地址对齐方式必须与所选图像格式匹配，例如：32 位每像素格式必须 32 位对齐，16 位每像素格式必须 16 位对齐，4 位每像素格式必须 8 位对齐。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGOR</name>
          <displayName>BGOR</displayName>
          <description>DMA2D 背景层偏移寄存器</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>行偏移 背景图像的行偏移量，以像素为单位。该值用于地址生成，在每行末尾累加以确定下一行的起始地址。这些位仅在数据传输禁用时可写。一旦数据传输开始，即变为只读。若图像格式为 4 位每像素，行偏移必须为偶数。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGPFCCR</name>
          <displayName>FGPFCCR</displayName>
          <description>DMA2D 前景层像素格式转换控制寄存器</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CM</name>
              <description>颜色模式 这些位定义前景图像的颜色格式。仅在数据传输禁用时可写。一旦传输开始，即变为只读。其他值：无意义</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCM</name>
              <description>CLUT 颜色模式 此位定义 CLUT 的颜色格式。仅在传输禁用时可写。一旦 CLUT 传输开始，此位即变为只读。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>启动 将此位置 1 可启动 CLUT 的自动加载。此位在以下情况下由硬件自动清零：传输结束时；用户应用程序通过置位 DMA2D_CR 中的 ABORT 位中止传输时；发生传输错误时；由于配置错误或另一传输操作（数据传输或后台 CLUT 自动传输）正在进行而导致传输未能启动时。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT 大小 这些位定义前景图像所用 CLUT 的大小。一旦 CLUT 传输开始，此字段即为只读。CLUT 条目数量等于 CS[7:0] + 1。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha 模式 这些位选择前景图像使用的 Alpha 通道值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。其他配置：无意义</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CSS</name>
              <description>色度子采样 这些位定义 YCbCr 颜色模式下的色度子采样模式。一旦传输开始，这些位即为只读。其他值：无意义</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <description>Alpha 取反 此位将 Alpha 值取反。一旦传输开始，此位即为只读。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBS</name>
              <description>红蓝交换 此位允许交换 R 和 B 通道以支持 BGR 或 ABGR 颜色格式。一旦传输开始，此位即为只读。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha 值 这些位定义一个固定的 Alpha 通道值，根据 AM[1:0] 位所选的 Alpha 模式，该值可替换原始 Alpha 值或与原始 Alpha 值相乘。这些位仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCOLR</name>
          <displayName>FGCOLR</displayName>
          <description>DMA2D 前景层颜色寄存器</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLUE</name>
              <description>蓝色分量 这些位定义前景图像在 A4 或 A8 模式下的蓝色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <description>绿色分量 这些位定义前景图像在 A4 或 A8 模式下的绿色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <description>红色分量 这些位定义前景图像在 A4 或 A8 模式下的红色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGPFCCR</name>
          <displayName>BGPFCCR</displayName>
          <description>DMA2D 背景层像素格式转换控制寄存器</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CM</name>
              <description>颜色模式 这些位定义背景图像的颜色格式。仅在数据传输禁用时可写。一旦传输开始，即变为只读。其他值：无意义</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCM</name>
              <description>CLUT 颜色模式 这些位定义 CLUT 的颜色格式。仅在传输禁用时可写。一旦 CLUT 传输开始，此位即变为只读。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>启动 将此位置 1 可启动 CLUT 的自动加载。此位在以下情况下由硬件自动清零：传输结束时；用户应用程序通过置位 DMA2D_CR 中的 ABORT 位中止传输时；发生传输错误时；由于配置错误或另一传输操作（数据传输或后台 CLUT 自动传输）正在进行而导致传输未能启动时。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT 大小 这些位定义背景层所用 CLUT 的大小。一旦 CLUT 传输开始，此字段即为只读。CLUT 条目数量等于 CS[7:0] + 1。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha 模式 这些位定义背景图像使用的 Alpha 通道值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。其他值：无意义</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <description>Alpha 取反 此位将 Alpha 值取反。一旦传输开始，此位即为只读。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBS</name>
              <description>红蓝交换 此位允许交换 R 和 B 通道以支持 BGR 或 ABGR 颜色格式。一旦传输开始，此位即为只读。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha 值 这些位定义一个固定的 Alpha 通道值，根据 AM[1:0] 位所选的 Alpha 模式，该值可替换原始 Alpha 值或与原始 Alpha 值相乘。这些位仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCOLR</name>
          <displayName>BGCOLR</displayName>
          <description>DMA2D 背景层颜色寄存器</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLUE</name>
              <description>蓝色分量 这些位定义背景层在 A4 或 A8 模式下的蓝色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <description>绿色分量 这些位定义背景层在 A4 或 A8 模式下的绿色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <description>红色分量 这些位定义背景层在 A4 或 A8 模式下的红色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCMAR</name>
          <displayName>FGCMAR</displayName>
          <description>DMA2D 前景层 CLUT 存储器地址寄存器</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>存储器地址 前景图像专用 CLUT 数据的存放地址。此寄存器仅在无传输进行时可写。一旦 CLUT 传输开始，此寄存器即为只读。若前景 CLUT 格式为 32 位，地址必须 32 位对齐。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCMAR</name>
          <displayName>BGCMAR</displayName>
          <description>DMA2D 背景层 CLUT 存储器地址寄存器</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>存储器地址 背景图像专用 CLUT 数据的存放地址。此寄存器仅在无传输进行时可写。一旦 CLUT 传输开始，此寄存器即为只读。若背景 CLUT 格式为 32 位，地址必须 32 位对齐。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPFCCR</name>
          <displayName>OPFCCR</displayName>
          <description>DMA2D 输出层像素格式转换控制寄存器</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CM</name>
              <description>颜色模式 这些位定义输出图像的颜色格式。仅在数据传输禁用时可写。一旦传输开始，即变为只读。其他值：无意义</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <description>Alpha 取反 此位将 Alpha 值取反。一旦传输开始，此位即为只读。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBS</name>
              <description>红蓝交换 此位允许交换 R 和 B 通道以支持 BGR 或 ABGR 颜色格式。一旦传输开始，此位即为只读。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OCOLR</name>
          <displayName>OCOLR</displayName>
          <description>DMA2D 输出层颜色寄存器</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLUE</name>
              <description>蓝色分量 这些位定义输出图像的蓝色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <description>绿色分量 这些位定义输出图像的绿色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <description>红色分量 这些位定义输出图像的红色分量值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha 通道值 这些位定义输出颜色的 Alpha 通道值。仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OMAR</name>
          <displayName>OMAR</displayName>
          <description>DMA2D 输出层存储器地址寄存器</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>存储器地址 输出 FIFO 数据的存放地址。这些位仅在数据传输禁用时可写。一旦传输开始，即变为只读。地址对齐方式必须与所选图像格式匹配，例如：32 位每像素格式必须 32 位对齐，16 位每像素格式必须 16 位对齐。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OOR</name>
          <displayName>OOR</displayName>
          <description>DMA2D 输出层偏移寄存器</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>行偏移 输出图像的行偏移量，以像素为单位。该值用于地址生成，在每行末尾累加以确定下一行的起始地址。这些位仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NLR</name>
          <displayName>NLR</displayName>
          <description>DMA2D 行数寄存器</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NL</name>
              <description>行数 待传输区域的行数。这些位仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <description>每行像素数 待传输区域每行的像素数量。这些位仅在数据传输禁用时可写。一旦传输开始，即变为只读。若任一输入图像格式为 4 位每像素，每行像素数必须为偶数。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LWR</name>
          <displayName>LWR</displayName>
          <description>DMA2D 行水印寄存器</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LW</name>
              <description>行水印 这些位用于配置产生中断的行水印值。当水印行的最后一个像素传输完成时，将触发中断。这些位仅在数据传输禁用时可写。一旦传输开始，即变为只读。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
