Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>DMAMUX_C15CR</name>
          <displayName>DMAMUX_C15CR</displayName>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMA 请求识别。选择输入 DMA 请求。关于复用器输入到资源的分配关系，请参阅 DMAMUX 表。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>中断禁用</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>中断使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>事件生成禁用</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>事件生成使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SE</name>
              <description>同步使能</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>同步禁用</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>同步使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步极性。定义所选同步输入的边沿极性：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>无事件，即不进行同步也不进行检测。</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>上升沿</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>下降沿</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>上升沿和下降沿</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBREQ</name>
              <description>待转发的 DMA 请求数减 1。定义同步事件后转发至 DMA 控制器的 DMA 请求数量，以及/或者生成输出事件前的 DMA 请求数量。此字段仅可在 SE 和 EGE 位均为低电平时写入。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步信号识别。选择同步输入（参见输入与资源的映射关系）。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_CSR</name>
          <displayName>DMAMUX_CSR</displayName>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOF0</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF1</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF2</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF3</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF4</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF5</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF6</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF7</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF8</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF9</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF10</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF11</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF12</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF13</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF14</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF15</name>
              <description>同步溢出事件标志。当 DMA 请求线复用器通道 x 上发生同步事件，且 DMA 请求计数器值低于 NBREQ 时，该标志位置位。通过向 DMAMUX_CFR 寄存器的对应 CSOFx 位写入 1 可清除此标志。对于 DMAMUX2，位 15:8 保留，请保持复位值。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_CFR</name>
          <displayName>DMAMUX_CFR</displayName>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSOF0</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF1</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF2</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF3</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF4</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF5</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF6</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF7</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF8</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF9</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF10</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF11</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF12</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF13</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF14</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF15</name>
              <description>清除同步溢出事件标志。向每位写入 1 可清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_RG0CR</name>
          <displayName>DMAMUX_RG0CR</displayName>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>信号识别。选择用于 DMA 请求发生器通道 x 的 DMA 请求触发输入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OIE</name>
              <description>触发溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>触发溢出事件发生时中断禁用</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>触发溢出事件发生时中断使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道 x 使能</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DMA 请求发生器通道 x 禁用</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DMA 请求发生器通道 x 使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发极性。定义所选触发输入的边沿极性。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>无事件，即不进行触发检测也不生成触发。</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>上升沿</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>下降沿</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>上升沿和下降沿</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>待生成的 DMA 请求数（减 1）。定义触发事件后生成的 DMA 请求数量。实际生成的 DMA 请求数为 GNBREQ + 1。注意：此字段仅可在 GE 位禁用时写入。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_RG1CR</name>
          <displayName>DMAMUX_RG1CR</displayName>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>信号识别。选择用于 DMA 请求发生器通道 x 的 DMA 请求触发输入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OIE</name>
              <description>触发溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>触发溢出事件发生时中断禁用</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>触发溢出事件发生时中断使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道 x 使能</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DMA 请求发生器通道 x 禁用</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DMA 请求发生器通道 x 使能</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发极性。定义所选触发输入的边沿极性。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>无事件，即不进行触发检测也不生成触发。</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>上升沿</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>下降沿</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>上升沿和下降沿</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>待生成的 DMA 请求数（减 1）。定义触发事件后生成的 DMA 请求数量。实际生成的 DMA 请求数为 GNBREQ + 1。注意：此字段仅可在 GE 位禁用时写入。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
