Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>DMAMUX_RGSR</name>
          <displayName>DMAMUX_RGSR</displayName>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OF0</name>
              <description>[:0]: 触发溢出事件标志。当 DMA 请求发生器通道 x 上发生新的触发事件，且发生在请求计数器下溢之前（内部请求计数器通过 DMAMUX_RGxCR 寄存器的 GNBREQ 字段编程设定），该标志位置位。通过向 DMAMUX_RGCFR 寄存器的对应 COFx 位写入 1 可清除此标志。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF1</name>
              <description>[:0]: 触发溢出事件标志。当 DMA 请求发生器通道 x 上发生新的触发事件，且发生在请求计数器下溢之前（内部请求计数器通过 DMAMUX_RGxCR 寄存器的 GNBREQ 字段编程设定），该标志位置位。通过向 DMAMUX_RGCFR 寄存器的对应 COFx 位写入 1 可清除此标志。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF2</name>
              <description>[:0]: 触发溢出事件标志。当 DMA 请求发生器通道 x 上发生新的触发事件，且发生在请求计数器下溢之前（内部请求计数器通过 DMAMUX_RGxCR 寄存器的 GNBREQ 字段编程设定），该标志位置位。通过向 DMAMUX_RGCFR 寄存器的对应 COFx 位写入 1 可清除此标志。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF3</name>
              <description>[:0]: 触发溢出事件标志。当 DMA 请求发生器通道 x 上发生新的触发事件，且发生在请求计数器下溢之前（内部请求计数器通过 DMAMUX_RGxCR 寄存器的 GNBREQ 字段编程设定），该标志位置位。通过向 DMAMUX_RGCFR 寄存器的对应 COFx 位写入 1 可清除此标志。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF4</name>
              <description>[:0]: 触发溢出事件标志。当 DMA 请求发生器通道 x 上发生新的触发事件，且发生在请求计数器下溢之前（内部请求计数器通过 DMAMUX_RGxCR 寄存器的 GNBREQ 字段编程设定），该标志位置位。通过向 DMAMUX_RGCFR 寄存器的对应 COFx 位写入 1 可清除此标志。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF5</name>
              <description>[:0]: 触发溢出事件标志。当 DMA 请求发生器通道 x 上发生新的触发事件，且发生在请求计数器下溢之前（内部请求计数器通过 DMAMUX_RGxCR 寄存器的 GNBREQ 字段编程设定），该标志位置位。通过向 DMAMUX_RGCFR 寄存器的对应 COFx 位写入 1 可清除此标志。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF6</name>
              <description>[:0]: 触发溢出事件标志。当 DMA 请求发生器通道 x 上发生新的触发事件，且发生在请求计数器下溢之前（内部请求计数器通过 DMAMUX_RGxCR 寄存器的 GNBREQ 字段编程设定），该标志位置位。通过向 DMAMUX_RGCFR 寄存器的对应 COFx 位写入 1 可清除此标志。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF7</name>
              <description>[:0]: 触发溢出事件标志。当 DMA 请求发生器通道 x 上发生新的触发事件，且发生在请求计数器下溢之前（内部请求计数器通过 DMAMUX_RGxCR 寄存器的 GNBREQ 字段编程设定），该标志位置位。通过向 DMAMUX_RGCFR 寄存器的对应 COFx 位写入 1 可清除此标志。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_RGCFR</name>
          <displayName>DMAMUX_RGCFR</displayName>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COF0</name>
              <description>清除触发溢出事件标志。向每位写入 1 可清除 DMAMUX_RGSR 寄存器中对应的溢出标志 OFx。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COF1</name>
              <description>清除触发溢出事件标志。向每位写入 1 可清除 DMAMUX_RGSR 寄存器中对应的溢出标志 OFx。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COF2</name>
              <description>清除触发溢出事件标志。向每位写入 1 可清除 DMAMUX_RGSR 寄存器中对应的溢出标志 OFx。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COF3</name>
              <description>清除触发溢出事件标志。向每位写入 1 可清除 DMAMUX_RGSR 寄存器中对应的溢出标志 OFx。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COF4</name>
              <description>清除触发溢出事件标志。向每位写入 1 可清除 DMAMUX_RGSR 寄存器中对应的溢出标志 OFx。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COF5</name>
              <description>清除触发溢出事件标志。向每位写入 1 可清除 DMAMUX_RGSR 寄存器中对应的溢出标志 OFx。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COF6</name>
              <description>清除触发溢出事件标志。向每位写入 1 可清除 DMAMUX_RGSR 寄存器中对应的溢出标志 OFx。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COF7</name>
              <description>清除触发溢出事件标志。向每位写入 1 可清除 DMAMUX_RGSR 寄存器中对应的溢出标志 OFx。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX2</name>
      <description>DMA 请求复用器</description>
      <groupName>DMAMUX</groupName>
      <baseAddress>0x58025800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMAMUX2_OVR</name>
        <description>DMAMUX2 溢出中断</description>
        <value>128</value>
      </interrupt>
      <registers>
        <register>
          <name>C0CR</name>
          <displayName>C0CR</displayName>
          <description>DMA 请求线复用器通道 0 控制寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>输入 DMA 请求线选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能/禁止</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE</name>
              <description>同步工作模式使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步事件类型选择。定义所选同步输入上的同步事件：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBREQ</name>
              <description>DMA 请求转发数量。定义在产生输出事件之前转发的 DMA 请求数量。在同步模式下，该字段还定义了同步事件到来之后需要转发的 DMA 请求数量，达到该数量后停止转发。实际转发的 DMA 请求数量为 NBREQ+1。注意：仅当 SE 和 EGE 位均复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步输入选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CR</name>
          <displayName>C1CR</displayName>
          <description>DMA 请求线复用器通道 1 控制寄存器</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>输入 DMA 请求线选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能/禁止</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE</name>
              <description>同步工作模式使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步事件类型选择。定义所选同步输入上的同步事件：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBREQ</name>
              <description>DMA 请求转发数量。定义在产生输出事件之前转发的 DMA 请求数量。在同步模式下，该字段还定义了同步事件到来之后需要转发的 DMA 请求数量，达到该数量后停止转发。实际转发的 DMA 请求数量为 NBREQ+1。注意：仅当 SE 和 EGE 位均复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步输入选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CR</name>
          <displayName>C2CR</displayName>
          <description>DMA 请求线复用器通道 2 控制寄存器</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>输入 DMA 请求线选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能/禁止</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE</name>
              <description>同步工作模式使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步事件类型选择。定义所选同步输入上的同步事件：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBREQ</name>
              <description>DMA 请求转发数量。定义在产生输出事件之前转发的 DMA 请求数量。在同步模式下，该字段还定义了同步事件到来之后需要转发的 DMA 请求数量，达到该数量后停止转发。实际转发的 DMA 请求数量为 NBREQ+1。注意：仅当 SE 和 EGE 位均复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步输入选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C3CR</name>
          <displayName>C3CR</displayName>
          <description>DMA 请求线复用器通道 3 控制寄存器</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>输入 DMA 请求线选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能/禁止</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE</name>
              <description>同步工作模式使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步事件类型选择。定义所选同步输入上的同步事件：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBREQ</name>
              <description>DMA 请求转发数量。定义在产生输出事件之前转发的 DMA 请求数量。在同步模式下，该字段还定义了同步事件到来之后需要转发的 DMA 请求数量，达到该数量后停止转发。实际转发的 DMA 请求数量为 NBREQ+1。注意：仅当 SE 和 EGE 位均复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步输入选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C4CR</name>
          <displayName>C4CR</displayName>
          <description>DMA 请求线复用器通道 4 控制寄存器</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>输入 DMA 请求线选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能/禁止</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE</name>
              <description>同步工作模式使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步事件类型选择。定义所选同步输入上的同步事件：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBREQ</name>
              <description>DMA 请求转发数量。定义在产生输出事件之前转发的 DMA 请求数量。在同步模式下，该字段还定义了同步事件到来之后需要转发的 DMA 请求数量，达到该数量后停止转发。实际转发的 DMA 请求数量为 NBREQ+1。注意：仅当 SE 和 EGE 位均复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步输入选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C5CR</name>
          <displayName>C5CR</displayName>
          <description>DMA 请求线复用器通道 5 控制寄存器</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>输入 DMA 请求线选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能/禁止</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE</name>
              <description>同步工作模式使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步事件类型选择。定义所选同步输入上的同步事件：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBREQ</name>
              <description>DMA 请求转发数量。定义在产生输出事件之前转发的 DMA 请求数量。在同步模式下，该字段还定义了同步事件到来之后需要转发的 DMA 请求数量，达到该数量后停止转发。实际转发的 DMA 请求数量为 NBREQ+1。注意：仅当 SE 和 EGE 位均复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步输入选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C6CR</name>
          <displayName>C6CR</displayName>
          <description>DMA 请求线复用器通道 6 控制寄存器</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>输入 DMA 请求线选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能/禁止</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE</name>
              <description>同步工作模式使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步事件类型选择。定义所选同步输入上的同步事件：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBREQ</name>
              <description>DMA 请求转发数量。定义在产生输出事件之前转发的 DMA 请求数量。在同步模式下，该字段还定义了同步事件到来之后需要转发的 DMA 请求数量，达到该数量后停止转发。实际转发的 DMA 请求数量为 NBREQ+1。注意：仅当 SE 和 EGE 位均复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步输入选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C7CR</name>
          <displayName>C7CR</displayName>
          <description>DMA 请求线复用器通道 7 控制寄存器</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>输入 DMA 请求线选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>同步事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGE</name>
              <description>事件生成使能/禁止</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE</name>
              <description>同步工作模式使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPOL</name>
              <description>同步事件类型选择。定义所选同步输入上的同步事件：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBREQ</name>
              <description>DMA 请求转发数量。定义在产生输出事件之前转发的 DMA 请求数量。在同步模式下，该字段还定义了同步事件到来之后需要转发的 DMA 请求数量，达到该数量后停止转发。实际转发的 DMA 请求数量为 NBREQ+1。注意：仅当 SE 和 EGE 位均复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>同步输入选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG0CR</name>
          <displayName>RG0CR</displayName>
          <description>DMA 请求发生器通道 0 控制寄存器</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA 请求触发输入选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <description>触发事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发事件类型选择。定义所选 DMA 请求触发输入上的触发事件。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>DMA 请求生成数量。定义触发事件到来之后生成的 DMA 请求数量，达到该数量后停止生成。实际生成的 DMA 请求数量为 GNBREQ+1。注意：仅当 GE 位复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
