Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>RG1CR</name>
          <displayName>RG1CR</displayName>
          <description>DMA 请求发生器通道 1 控制寄存器</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA 请求触发输入选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <description>触发事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发事件类型选择。定义所选 DMA 请求触发输入上的触发事件。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>DMA 请求生成数量。定义触发事件到来之后生成的 DMA 请求数量，达到该数量后停止生成。实际生成的 DMA 请求数量为 GNBREQ+1。注意：仅当 GE 位复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG2CR</name>
          <displayName>RG2CR</displayName>
          <description>DMA 请求发生器通道 2 控制寄存器</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA 请求触发输入选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <description>触发事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发事件类型选择。定义所选 DMA 请求触发输入上的触发事件。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>DMA 请求生成数量。定义触发事件到来之后生成的 DMA 请求数量，达到该数量后停止生成。实际生成的 DMA 请求数量为 GNBREQ+1。注意：仅当 GE 位复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG3CR</name>
          <displayName>RG3CR</displayName>
          <description>DMA 请求发生器通道 3 控制寄存器</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA 请求触发输入选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <description>触发事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发事件类型选择。定义所选 DMA 请求触发输入上的触发事件。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>DMA 请求生成数量。定义触发事件到来之后生成的 DMA 请求数量，达到该数量后停止生成。实际生成的 DMA 请求数量为 GNBREQ+1。注意：仅当 GE 位复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG4CR</name>
          <displayName>RG4CR</displayName>
          <description>DMA 请求发生器通道 4 控制寄存器</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA 请求触发输入选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <description>触发事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发事件类型选择。定义所选 DMA 请求触发输入上的触发事件。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>DMA 请求生成数量。定义触发事件到来之后生成的 DMA 请求数量，达到该数量后停止生成。实际生成的 DMA 请求数量为 GNBREQ+1。注意：仅当 GE 位复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG5CR</name>
          <displayName>RG5CR</displayName>
          <description>DMA 请求发生器通道 5 控制寄存器</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA 请求触发输入选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <description>触发事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发事件类型选择。定义所选 DMA 请求触发输入上的触发事件。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>DMA 请求生成数量。定义触发事件到来之后生成的 DMA 请求数量，达到该数量后停止生成。实际生成的 DMA 请求数量为 GNBREQ+1。注意：仅当 GE 位复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG6CR</name>
          <displayName>RG6CR</displayName>
          <description>DMA 请求发生器通道 6 控制寄存器</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA 请求触发输入选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <description>触发事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发事件类型选择。定义所选 DMA 请求触发输入上的触发事件。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>DMA 请求生成数量。定义触发事件到来之后生成的 DMA 请求数量，达到该数量后停止生成。实际生成的 DMA 请求数量为 GNBREQ+1。注意：仅当 GE 位复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG7CR</name>
          <displayName>RG7CR</displayName>
          <description>DMA 请求发生器通道 7 控制寄存器</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIG_ID</name>
              <description>DMA 请求触发输入选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <description>触发事件溢出中断使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <description>DMA 请求发生器通道使能/禁止</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <description>DMA 请求发生器触发事件类型选择。定义所选 DMA 请求触发输入上的触发事件。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <description>DMA 请求生成数量。定义触发事件到来之后生成的 DMA 请求数量，达到该数量后停止生成。实际生成的 DMA 请求数量为 GNBREQ+1。注意：仅当 GE 位复位时才能写入此字段。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RGSR</name>
          <displayName>RGSR</displayName>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OF0</name>
              <description>触发溢出事件标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF1</name>
              <description>触发溢出事件标志</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF2</name>
              <description>触发溢出事件标志</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF3</name>
              <description>触发溢出事件标志</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF4</name>
              <description>触发溢出事件标志</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF5</name>
              <description>触发溢出事件标志</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF6</name>
              <description>触发溢出事件标志</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF7</name>
              <description>触发溢出事件标志</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RGCFR</name>
          <displayName>RGCFR</displayName>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COF0</name>
              <description>清除触发溢出事件标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COF1</name>
              <description>清除触发溢出事件标志</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COF2</name>
              <description>清除触发溢出事件标志</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COF3</name>
              <description>清除触发溢出事件标志</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COF4</name>
              <description>清除触发溢出事件标志</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COF5</name>
              <description>清除触发溢出事件标志</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COF6</name>
              <description>清除触发溢出事件标志</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COF7</name>
              <description>清除触发溢出事件标志</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOF0</name>
              <description>同步溢出事件标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF1</name>
              <description>同步溢出事件标志</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF2</name>
              <description>同步溢出事件标志</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF3</name>
              <description>同步溢出事件标志</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF4</name>
              <description>同步溢出事件标志</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF5</name>
              <description>同步溢出事件标志</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF6</name>
              <description>同步溢出事件标志</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF7</name>
              <description>同步溢出事件标志</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <displayName>CFR</displayName>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSOF0</name>
              <description>清除同步溢出事件标志。向指定位写入 1 将清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF1</name>
              <description>清除同步溢出事件标志。向指定位写入 1 将清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF2</name>
              <description>清除同步溢出事件标志。向指定位写入 1 将清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF3</name>
              <description>清除同步溢出事件标志。向指定位写入 1 将清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF4</name>
              <description>清除同步溢出事件标志。向指定位写入 1 将清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF5</name>
              <description>清除同步溢出事件标志。向指定位写入 1 将清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF6</name>
              <description>清除同步溢出事件标志。向指定位写入 1 将清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSOF7</name>
              <description>清除同步溢出事件标志。向指定位写入 1 将清除 DMAMUX_CSR 寄存器中对应的溢出标志 SOFx。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
