Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FMC</name>
      <description>灵活存储控制器（FMC）</description>
      <groupName>FMC</groupName>
      <baseAddress>0x52004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FMC</name>
        <description>FMC 全局中断</description>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>BCR1</name>
          <displayName>BCR1</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030DB</resetValue>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>存储 Bank 使能位。此位用于使能存储 Bank。复位后 Bank1 使能，其余均禁用。访问被禁用的 Bank 会导致 AXI 总线产生 ERROR。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>地址/数据复用使能位。此位置 1 时，地址与数据值在数据总线上复用，仅对 NOR 和 PSRAM 存储器有效：</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>存储器类型。这些位定义对应存储 Bank 所连接的外部存储器类型：</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>存储器数据总线宽度。定义外部存储器件的宽度，对所有存储器类型均有效。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>Flash 访问使能。此位使能 NOR Flash 存储器访问操作。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>突发使能位。此位使能/禁止读操作期间的同步访问。仅对以突发模式工作的同步存储器有效：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>等待信号极性位。此位定义来自存储器的等待信号极性，同步或异步模式下均可使用：</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>等待时序配置。NWAIT 信号指示来自存储器的数据是否有效，或在同步模式下访问存储器时是否需要插入等待状态。此配置位决定 NWAIT 是在等待状态前一个时钟周期由存储器发出，还是在等待状态期间发出：</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>写使能位。此位指示 FMC 在该 Bank 中的写操作是使能还是禁止：</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>等待使能位。此位使能/禁止通过 NWAIT 信号在同步模式下访问存储器时插入等待状态。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>扩展模式使能。此位使能 FMC 在 FMC_BWTR 寄存器中编程异步访问的写时序，从而使读写操作使用不同的时序。注意：当扩展模式禁用时，FMC 可按 Mode1 或 Mode2 工作，规则如下：** 选择 SRAM/PSRAM 存储器类型（MTYP = 0x0 或 0x01）时，默认模式为 Mode 1；** 选择 NOR 存储器类型（MTYP = 0x10）时，默认模式为 Mode 2。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>异步传输期间等待信号。此位使能/禁止 FMC 在异步协议期间也使用等待信号。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM 页大小。用于 Cellular RAM 1.5，该存储器不允许突发访问跨越页之间的地址边界。配置这些位后，当突发访问达到存储器页大小时，FMC 控制器会自动将其分割（页大小请参考存储器数据手册）。其他配置：保留。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>写突发使能。对于以突发模式工作的 PSRAM（CRAM），此位使能写操作期间的同步访问。同步读访问的使能位为 FMC_BCRx 寄存器中的 BURSTEN 位。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCLKEN</name>
              <description>连续时钟使能。此位使能输出到外部存储器件的 FMC_CLK 时钟。注意：FMC_BCR2..4 寄存器中的 CCLKEN 位无效，仅通过 FMC_BCR1 寄存器使能。Bank 1 必须配置为同步模式才能生成 FMC_CLK 连续时钟。若 CCLKEN 位置 1，FMC_CLK 时钟分频比由 FMC_BTR1 寄存器中的 CLKDIV 值指定，FMC_BWTR1 中的 CLKDIV 无效。若使用同步模式且 CCLKEN 位置 1，则连接到除 Bank 1 以外其他 Bank 的同步存储器由同一时钟驱动（其他 Bank 的 FMC_BTR2..4 和 FMC_BWTR2..4 寄存器中的 CLKDIV 值无效）。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFDIS</name>
              <description>写 FIFO 禁止。此位禁止 FMC 控制器使用的写 FIFO。注意：FMC_BCR2..4 寄存器中的 WFDIS 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMAP</name>
              <description>FMC Bank 映射。这些位允许重映射 SDRAM Bank2 或交换 FMC NOR/PSRAM 与 SDRAM Bank。请参见表 10。注意：FMC_BCR2..4 寄存器中的 BMAP 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC 控制器使能。此位使能/禁止 FMC 控制器。注意：FMC_BCR2..4 寄存器中的 FMCEN 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR1</name>
          <displayName>BTR1</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。若 FMC_BCRx 寄存器中的 EXTMOD 位置 1，则该寄存器被划分为写访问和读访问两部分，即提供 2 个寄存器：一个用于配置读访问（本寄存器），另一个用于配置写访问（FMC_BWTRx 寄存器）。</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>地址建立阶段持续时间。这些位由软件写入，用于定义地址建立阶段的持续时间（参见图 81 至图 93），用于 SRAM、ROM 和异步 NOR Flash：各访问模式的地址建立阶段持续时间请参见对应图示（参见图 81 至图 93）。注意：同步访问中此值无效。在复用模式或 Mode D 下，ADDSET 的最小值为 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>地址保持阶段持续时间。这些位由软件写入，用于定义地址保持阶段的持续时间（参见图 81 至图 93），用于 Mode D 或复用访问：各访问模式的地址保持阶段持续时间请参见对应图示（图 81 至图 93）。注意：同步访问中不使用此值，地址保持阶段始终为 1 个存储器时钟周期。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>数据阶段持续时间。这些位由软件写入，用于定义数据阶段的持续时间（参见图 81 至图 93），用于异步访问：各存储器类型和访问模式的数据阶段持续时间请参见对应图示（图 81 至图 93）。示例：Mode1，写访问，DATAST=1：数据阶段持续时间 = DATAST+1 = 2 个 KCK_FMC 时钟周期。注意：同步访问中此值无效。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>总线周转阶段持续时间。这些位由软件写入，用于在写转读或读转写事务结束时添加延迟。编程的总线周转延迟插入在异步读（复用模式或 Mode D）或写事务与对静态 Bank 的任何其他异步/同步读写之间。若执行读操作，Bank 可相同或不同；若为写操作，Bank 必须不同（复用模式或 Mode D 除外）。在某些情况下，无论 BUSTRUN 编程值为何，总线周转延迟按以下规则固定：除复用模式和 Mode D 外，对同一静态存储 Bank 的两次连续异步写传输之间不插入总线周转延迟。以下情况之间插入 1 个 FMC 时钟周期的总线周转延迟：对同一静态存储 Bank 的两次连续异步读传输（复用模式和 Mode D 除外）；异步读到对任何静态 Bank 或动态 Bank 的异步或同步写（复用模式和 Mode D 除外）。以下情况之间插入 2 个 FMC 时钟周期的总线周转延迟：对同一 Bank 的两次连续同步写操作（突发或单次模式）；同步写（突发或单次）访问与对静态存储 Bank 的异步写或读传输（读操作时 Bank 可相同或不同）；两次连续同步读操作（突发或单次模式）后接对另一静态存储 Bank 的任何同步/异步读或写。以下情况之间插入 3 个 FMC 时钟周期的总线周转延迟：对不同静态 Bank 的两次连续同步写操作（突发或单次模式）；同步写访问（突发或单次模式）与对相同或不同 Bank 的同步读。总线周转延迟用于匹配连续事务之间的最小时间（tEHEL，从 NEx 高电平到 NEx 低电平）以及存储器在读取后释放数据总线所需的最大时间（tEHQZ）：若 EXTMOD = 0，则 (BUSTRUN + 1) 个 KCK_FMC 周期 ≥ tEHELmin 且 (BUSTRUN + 2) 个 KCK_FMC 周期 ≥ tEHQZmax；若 EXTMOD = 1，则 (BUSTRUN + 2) 个 KCK_FMC 周期 ≥ max(tEHELmin, tEHQZmax)。...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>时钟分频比（用于 FMC_CLK 信号）。这些位定义 FMC_CLK 时钟输出信号的周期，以 KCK_FMC 周期数表示：异步 NOR Flash、SRAM 或 PSRAM 访问中此值无效。注意：FMC_CLK 分频比公式请参见第 20.6.5 节：同步事务。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>同步存储器数据延迟。对于使能了读写突发模式的同步访问，这些位定义存储器时钟周期数。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>访问模式。这些位指定异步访问模式，如时序图所示。仅当 FMC_BCRx 寄存器中的 EXTMOD 位为 1 时才生效。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR2</name>
          <displayName>BCR2</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D2</resetValue>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>存储 Bank 使能位。此位用于使能存储 Bank。复位后 Bank1 使能，其余均禁用。访问被禁用的 Bank 会导致 AXI 总线产生 ERROR。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>地址/数据复用使能位。此位置 1 时，地址与数据值在数据总线上复用，仅对 NOR 和 PSRAM 存储器有效：</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>存储器类型。这些位定义对应存储 Bank 所连接的外部存储器类型：</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>存储器数据总线宽度。定义外部存储器件的宽度，对所有存储器类型均有效。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>Flash 访问使能。此位使能 NOR Flash 存储器访问操作。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>突发使能位。此位使能/禁止读操作期间的同步访问。仅对以突发模式工作的同步存储器有效：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>等待信号极性位。此位定义来自存储器的等待信号极性，同步或异步模式下均可使用：</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>等待时序配置。NWAIT 信号指示来自存储器的数据是否有效，或在同步模式下访问存储器时是否需要插入等待状态。此配置位决定 NWAIT 是在等待状态前一个时钟周期由存储器发出，还是在等待状态期间发出：</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>写使能位。此位指示 FMC 在该 Bank 中的写操作是使能还是禁止：</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>等待使能位。此位使能/禁止通过 NWAIT 信号在同步模式下访问存储器时插入等待状态。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>扩展模式使能。此位使能 FMC 在 FMC_BWTR 寄存器中编程异步访问的写时序，从而使读写操作使用不同的时序。注意：当扩展模式禁用时，FMC 可按 Mode1 或 Mode2 工作，规则如下：** 选择 SRAM/PSRAM 存储器类型（MTYP = 0x0 或 0x01）时，默认模式为 Mode 1；** 选择 NOR 存储器类型（MTYP = 0x10）时，默认模式为 Mode 2。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>异步传输期间等待信号。此位使能/禁止 FMC 在异步协议期间也使用等待信号。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM 页大小。用于 Cellular RAM 1.5，该存储器不允许突发访问跨越页之间的地址边界。配置这些位后，当突发访问达到存储器页大小时，FMC 控制器会自动将其分割（页大小请参考存储器数据手册）。其他配置：保留。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>写突发使能。对于以突发模式工作的 PSRAM（CRAM），此位使能写操作期间的同步访问。同步读访问的使能位为 FMC_BCRx 寄存器中的 BURSTEN 位。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCLKEN</name>
              <description>连续时钟使能。此位使能输出到外部存储器件的 FMC_CLK 时钟。注意：FMC_BCR2..4 寄存器中的 CCLKEN 位无效，仅通过 FMC_BCR1 寄存器使能。Bank 1 必须配置为同步模式才能生成 FMC_CLK 连续时钟。若 CCLKEN 位置 1，FMC_CLK 时钟分频比由 FMC_BTR1 寄存器中的 CLKDIV 值指定，FMC_BWTR1 中的 CLKDIV 无效。若使用同步模式且 CCLKEN 位置 1，则连接到除 Bank 1 以外其他 Bank 的同步存储器由同一时钟驱动（其他 Bank 的 FMC_BTR2..4 和 FMC_BWTR2..4 寄存器中的 CLKDIV 值无效）。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFDIS</name>
              <description>写 FIFO 禁止。此位禁止 FMC 控制器使用的写 FIFO。注意：FMC_BCR2..4 寄存器中的 WFDIS 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMAP</name>
              <description>FMC Bank 映射。这些位允许重映射 SDRAM Bank2 或交换 FMC NOR/PSRAM 与 SDRAM Bank。请参见表 10。注意：FMC_BCR2..4 寄存器中的 BMAP 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC 控制器使能。此位使能/禁止 FMC 控制器。注意：FMC_BCR2..4 寄存器中的 FMCEN 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR2</name>
          <displayName>BTR2</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。若 FMC_BCRx 寄存器中的 EXTMOD 位置 1，则该寄存器被划分为写访问和读访问两部分，即提供 2 个寄存器：一个用于配置读访问（本寄存器），另一个用于配置写访问（FMC_BWTRx 寄存器）。</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>地址建立阶段持续时间。这些位由软件写入，用于定义地址建立阶段的持续时间（参见图 81 至图 93），用于 SRAM、ROM 和异步 NOR Flash：各访问模式的地址建立阶段持续时间请参见对应图示（参见图 81 至图 93）。注意：同步访问中此值无效。在复用模式或 Mode D 下，ADDSET 的最小值为 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>地址保持阶段持续时间。这些位由软件写入，用于定义地址保持阶段的持续时间（参见图 81 至图 93），用于 Mode D 或复用访问：各访问模式的地址保持阶段持续时间请参见对应图示（图 81 至图 93）。注意：同步访问中不使用此值，地址保持阶段始终为 1 个存储器时钟周期。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>数据阶段持续时间。这些位由软件写入，用于定义数据阶段的持续时间（参见图 81 至图 93），用于异步访问：各存储器类型和访问模式的数据阶段持续时间请参见对应图示（图 81 至图 93）。示例：Mode1，写访问，DATAST=1：数据阶段持续时间 = DATAST+1 = 2 个 KCK_FMC 时钟周期。注意：同步访问中此值无效。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>总线周转阶段持续时间。这些位由软件写入，用于在写转读或读转写事务结束时添加延迟。编程的总线周转延迟插入在异步读（复用模式或 Mode D）或写事务与对静态 Bank 的任何其他异步/同步读写之间。若执行读操作，Bank 可相同或不同；若为写操作，Bank 必须不同（复用模式或 Mode D 除外）。在某些情况下，无论 BUSTRUN 编程值为何，总线周转延迟按以下规则固定：除复用模式和 Mode D 外，对同一静态存储 Bank 的两次连续异步写传输之间不插入总线周转延迟。以下情况之间插入 1 个 FMC 时钟周期的总线周转延迟：对同一静态存储 Bank 的两次连续异步读传输（复用模式和 Mode D 除外）；异步读到对任何静态 Bank 或动态 Bank 的异步或同步写（复用模式和 Mode D 除外）。以下情况之间插入 2 个 FMC 时钟周期的总线周转延迟：对同一 Bank 的两次连续同步写操作（突发或单次模式）；同步写（突发或单次）访问与对静态存储 Bank 的异步写或读传输（读操作时 Bank 可相同或不同）；两次连续同步读操作（突发或单次模式）后接对另一静态存储 Bank 的任何同步/异步读或写。以下情况之间插入 3 个 FMC 时钟周期的总线周转延迟：对不同静态 Bank 的两次连续同步写操作（突发或单次模式）；同步写访问（突发或单次模式）与对相同或不同 Bank 的同步读。总线周转延迟用于匹配连续事务之间的最小时间（tEHEL，从 NEx 高电平到 NEx 低电平）以及存储器在读取后释放数据总线所需的最大时间（tEHQZ）：若 EXTMOD = 0，则 (BUSTRUN + 1) 个 KCK_FMC 周期 ≥ tEHELmin 且 (BUSTRUN + 2) 个 KCK_FMC 周期 ≥ tEHQZmax；若 EXTMOD = 1，则 (BUSTRUN + 2) 个 KCK_FMC 周期 ≥ max(tEHELmin, tEHQZmax)。...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>时钟分频比（用于 FMC_CLK 信号）。这些位定义 FMC_CLK 时钟输出信号的周期，以 KCK_FMC 周期数表示：异步 NOR Flash、SRAM 或 PSRAM 访问中此值无效。注意：FMC_CLK 分频比公式请参见第 20.6.5 节：同步事务。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>同步存储器数据延迟。对于使能了读写突发模式的同步访问，这些位定义存储器时钟周期数。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>访问模式。这些位指定异步访问模式，如时序图所示。仅当 FMC_BCRx 寄存器中的 EXTMOD 位为 1 时才生效。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR3</name>
          <displayName>BCR3</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D2</resetValue>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>存储 Bank 使能位。此位用于使能存储 Bank。复位后 Bank1 使能，其余均禁用。访问被禁用的 Bank 会导致 AXI 总线产生 ERROR。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>地址/数据复用使能位。此位置 1 时，地址与数据值在数据总线上复用，仅对 NOR 和 PSRAM 存储器有效：</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>存储器类型。这些位定义对应存储 Bank 所连接的外部存储器类型：</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>存储器数据总线宽度。定义外部存储器件的宽度，对所有存储器类型均有效。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>Flash 访问使能。此位使能 NOR Flash 存储器访问操作。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>突发使能位。此位使能/禁止读操作期间的同步访问。仅对以突发模式工作的同步存储器有效：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>等待信号极性位。此位定义来自存储器的等待信号极性，同步或异步模式下均可使用：</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>等待时序配置。NWAIT 信号指示来自存储器的数据是否有效，或在同步模式下访问存储器时是否需要插入等待状态。此配置位决定 NWAIT 是在等待状态前一个时钟周期由存储器发出，还是在等待状态期间发出：</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>写使能位。此位指示 FMC 在该 Bank 中的写操作是使能还是禁止：</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>等待使能位。此位使能/禁止通过 NWAIT 信号在同步模式下访问存储器时插入等待状态。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>扩展模式使能。此位使能 FMC 在 FMC_BWTR 寄存器中编程异步访问的写时序，从而使读写操作使用不同的时序。注意：当扩展模式禁用时，FMC 可按 Mode1 或 Mode2 工作，规则如下：** 选择 SRAM/PSRAM 存储器类型（MTYP = 0x0 或 0x01）时，默认模式为 Mode 1；** 选择 NOR 存储器类型（MTYP = 0x10）时，默认模式为 Mode 2。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>异步传输期间等待信号。此位使能/禁止 FMC 在异步协议期间也使用等待信号。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM 页大小。用于 Cellular RAM 1.5，该存储器不允许突发访问跨越页之间的地址边界。配置这些位后，当突发访问达到存储器页大小时，FMC 控制器会自动将其分割（页大小请参考存储器数据手册）。其他配置：保留。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>写突发使能。对于以突发模式工作的 PSRAM（CRAM），此位使能写操作期间的同步访问。同步读访问的使能位为 FMC_BCRx 寄存器中的 BURSTEN 位。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCLKEN</name>
              <description>连续时钟使能。此位使能输出到外部存储器件的 FMC_CLK 时钟。注意：FMC_BCR2..4 寄存器中的 CCLKEN 位无效，仅通过 FMC_BCR1 寄存器使能。Bank 1 必须配置为同步模式才能生成 FMC_CLK 连续时钟。若 CCLKEN 位置 1，FMC_CLK 时钟分频比由 FMC_BTR1 寄存器中的 CLKDIV 值指定，FMC_BWTR1 中的 CLKDIV 无效。若使用同步模式且 CCLKEN 位置 1，则连接到除 Bank 1 以外其他 Bank 的同步存储器由同一时钟驱动（其他 Bank 的 FMC_BTR2..4 和 FMC_BWTR2..4 寄存器中的 CLKDIV 值无效）。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFDIS</name>
              <description>写 FIFO 禁止。此位禁止 FMC 控制器使用的写 FIFO。注意：FMC_BCR2..4 寄存器中的 WFDIS 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMAP</name>
              <description>FMC Bank 映射。这些位允许重映射 SDRAM Bank2 或交换 FMC NOR/PSRAM 与 SDRAM Bank。请参见表 10。注意：FMC_BCR2..4 寄存器中的 BMAP 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC 控制器使能。此位使能/禁止 FMC 控制器。注意：FMC_BCR2..4 寄存器中的 FMCEN 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
