Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>BTR3</name>
          <displayName>BTR3</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。若 FMC_BCRx 寄存器中的 EXTMOD 位置 1，则该寄存器被划分为写访问和读访问两部分，即提供 2 个寄存器：一个用于配置读访问（本寄存器），另一个用于配置写访问（FMC_BWTRx 寄存器）。</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>地址建立阶段持续时间。这些位由软件写入，用于定义地址建立阶段的持续时间（参见图 81 至图 93），用于 SRAM、ROM 和异步 NOR Flash：各访问模式的地址建立阶段持续时间请参见对应图示（参见图 81 至图 93）。注意：同步访问中此值无效。在复用模式或 Mode D 下，ADDSET 的最小值为 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>地址保持阶段持续时间。这些位由软件写入，用于定义地址保持阶段的持续时间（参见图 81 至图 93），用于 Mode D 或复用访问：各访问模式的地址保持阶段持续时间请参见对应图示（图 81 至图 93）。注意：同步访问中不使用此值，地址保持阶段始终为 1 个存储器时钟周期。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>数据阶段持续时间。这些位由软件写入，用于定义数据阶段的持续时间（参见图 81 至图 93），用于异步访问：各存储器类型和访问模式的数据阶段持续时间请参见对应图示（图 81 至图 93）。示例：Mode1，写访问，DATAST=1：数据阶段持续时间 = DATAST+1 = 2 个 KCK_FMC 时钟周期。注意：同步访问中此值无效。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>总线周转阶段持续时间。这些位由软件写入，用于在写转读或读转写事务结束时添加延迟。编程的总线周转延迟插入在异步读（复用模式或 Mode D）或写事务与对静态 Bank 的任何其他异步/同步读写之间。若执行读操作，Bank 可相同或不同；若为写操作，Bank 必须不同（复用模式或 Mode D 除外）。在某些情况下，无论 BUSTRUN 编程值为何，总线周转延迟按以下规则固定：除复用模式和 Mode D 外，对同一静态存储 Bank 的两次连续异步写传输之间不插入总线周转延迟。以下情况之间插入 1 个 FMC 时钟周期的总线周转延迟：对同一静态存储 Bank 的两次连续异步读传输（复用模式和 Mode D 除外）；异步读到对任何静态 Bank 或动态 Bank 的异步或同步写（复用模式和 Mode D 除外）。以下情况之间插入 2 个 FMC 时钟周期的总线周转延迟：对同一 Bank 的两次连续同步写操作（突发或单次模式）；同步写（突发或单次）访问与对静态存储 Bank 的异步写或读传输（读操作时 Bank 可相同或不同）；两次连续同步读操作（突发或单次模式）后接对另一静态存储 Bank 的任何同步/异步读或写。以下情况之间插入 3 个 FMC 时钟周期的总线周转延迟：对不同静态 Bank 的两次连续同步写操作（突发或单次模式）；同步写访问（突发或单次模式）与对相同或不同 Bank 的同步读。总线周转延迟用于匹配连续事务之间的最小时间（tEHEL，从 NEx 高电平到 NEx 低电平）以及存储器在读取后释放数据总线所需的最大时间（tEHQZ）：若 EXTMOD = 0，则 (BUSTRUN + 1) 个 KCK_FMC 周期 ≥ tEHELmin 且 (BUSTRUN + 2) 个 KCK_FMC 周期 ≥ tEHQZmax；若 EXTMOD = 1，则 (BUSTRUN + 2) 个 KCK_FMC 周期 ≥ max(tEHELmin, tEHQZmax)。...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>时钟分频比（用于 FMC_CLK 信号）。这些位定义 FMC_CLK 时钟输出信号的周期，以 KCK_FMC 周期数表示：异步 NOR Flash、SRAM 或 PSRAM 访问中此值无效。注意：FMC_CLK 分频比公式请参见第 20.6.5 节：同步事务。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>同步存储器数据延迟。对于使能了读写突发模式的同步访问，这些位定义存储器时钟周期数。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>访问模式。这些位指定异步访问模式，如时序图所示。仅当 FMC_BCRx 寄存器中的 EXTMOD 位为 1 时才生效。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR4</name>
          <displayName>BCR4</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D2</resetValue>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>存储 Bank 使能位。此位用于使能存储 Bank。复位后 Bank1 使能，其余均禁用。访问被禁用的 Bank 会导致 AXI 总线产生 ERROR。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>地址/数据复用使能位。此位置 1 时，地址与数据值在数据总线上复用，仅对 NOR 和 PSRAM 存储器有效：</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>存储器类型。这些位定义对应存储 Bank 所连接的外部存储器类型：</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>存储器数据总线宽度。定义外部存储器件的宽度，对所有存储器类型均有效。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>Flash 访问使能。此位使能 NOR Flash 存储器访问操作。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>突发使能位。此位使能/禁止读操作期间的同步访问。仅对以突发模式工作的同步存储器有效：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>等待信号极性位。此位定义来自存储器的等待信号极性，同步或异步模式下均可使用：</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>等待时序配置。NWAIT 信号指示来自存储器的数据是否有效，或在同步模式下访问存储器时是否需要插入等待状态。此配置位决定 NWAIT 是在等待状态前一个时钟周期由存储器发出，还是在等待状态期间发出：</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>写使能位。此位指示 FMC 在该 Bank 中的写操作是使能还是禁止：</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>等待使能位。此位使能/禁止通过 NWAIT 信号在同步模式下访问存储器时插入等待状态。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>扩展模式使能。此位使能 FMC 在 FMC_BWTR 寄存器中编程异步访问的写时序，从而使读写操作使用不同的时序。注意：当扩展模式禁用时，FMC 可按 Mode1 或 Mode2 工作，规则如下：** 选择 SRAM/PSRAM 存储器类型（MTYP = 0x0 或 0x01）时，默认模式为 Mode 1；** 选择 NOR 存储器类型（MTYP = 0x10）时，默认模式为 Mode 2。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>异步传输期间等待信号。此位使能/禁止 FMC 在异步协议期间也使用等待信号。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM 页大小。用于 Cellular RAM 1.5，该存储器不允许突发访问跨越页之间的地址边界。配置这些位后，当突发访问达到存储器页大小时，FMC 控制器会自动将其分割（页大小请参考存储器数据手册）。其他配置：保留。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>写突发使能。对于以突发模式工作的 PSRAM（CRAM），此位使能写操作期间的同步访问。同步读访问的使能位为 FMC_BCRx 寄存器中的 BURSTEN 位。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCLKEN</name>
              <description>连续时钟使能。此位使能输出到外部存储器件的 FMC_CLK 时钟。注意：FMC_BCR2..4 寄存器中的 CCLKEN 位无效，仅通过 FMC_BCR1 寄存器使能。Bank 1 必须配置为同步模式才能生成 FMC_CLK 连续时钟。若 CCLKEN 位置 1，FMC_CLK 时钟分频比由 FMC_BTR1 寄存器中的 CLKDIV 值指定，FMC_BWTR1 中的 CLKDIV 无效。若使用同步模式且 CCLKEN 位置 1，则连接到除 Bank 1 以外其他 Bank 的同步存储器由同一时钟驱动（其他 Bank 的 FMC_BTR2..4 和 FMC_BWTR2..4 寄存器中的 CLKDIV 值无效）。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFDIS</name>
              <description>写 FIFO 禁止。此位禁止 FMC 控制器使用的写 FIFO。注意：FMC_BCR2..4 寄存器中的 WFDIS 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMAP</name>
              <description>FMC Bank 映射。这些位允许重映射 SDRAM Bank2 或交换 FMC NOR/PSRAM 与 SDRAM Bank。请参见表 10。注意：FMC_BCR2..4 寄存器中的 BMAP 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC 控制器使能。此位使能/禁止 FMC 控制器。注意：FMC_BCR2..4 寄存器中的 FMCEN 位无效，仅通过 FMC_BCR1 寄存器使能。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR4</name>
          <displayName>BTR4</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。若 FMC_BCRx 寄存器中的 EXTMOD 位置 1，则该寄存器被划分为写访问和读访问两部分，即提供 2 个寄存器：一个用于配置读访问（本寄存器），另一个用于配置写访问（FMC_BWTRx 寄存器）。</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>地址建立阶段持续时间。这些位由软件写入，用于定义地址建立阶段的持续时间（参见图 81 至图 93），用于 SRAM、ROM 和异步 NOR Flash：各访问模式的地址建立阶段持续时间请参见对应图示（参见图 81 至图 93）。注意：同步访问中此值无效。在复用模式或 Mode D 下，ADDSET 的最小值为 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>地址保持阶段持续时间。这些位由软件写入，用于定义地址保持阶段的持续时间（参见图 81 至图 93），用于 Mode D 或复用访问：各访问模式的地址保持阶段持续时间请参见对应图示（图 81 至图 93）。注意：同步访问中不使用此值，地址保持阶段始终为 1 个存储器时钟周期。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>数据阶段持续时间。这些位由软件写入，用于定义数据阶段的持续时间（参见图 81 至图 93），用于异步访问：各存储器类型和访问模式的数据阶段持续时间请参见对应图示（图 81 至图 93）。示例：Mode1，写访问，DATAST=1：数据阶段持续时间 = DATAST+1 = 2 个 KCK_FMC 时钟周期。注意：同步访问中此值无效。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>总线周转阶段持续时间。这些位由软件写入，用于在写转读或读转写事务结束时添加延迟。编程的总线周转延迟插入在异步读（复用模式或 Mode D）或写事务与对静态 Bank 的任何其他异步/同步读写之间。若执行读操作，Bank 可相同或不同；若为写操作，Bank 必须不同（复用模式或 Mode D 除外）。在某些情况下，无论 BUSTRUN 编程值为何，总线周转延迟按以下规则固定：除复用模式和 Mode D 外，对同一静态存储 Bank 的两次连续异步写传输之间不插入总线周转延迟。以下情况之间插入 1 个 FMC 时钟周期的总线周转延迟：对同一静态存储 Bank 的两次连续异步读传输（复用模式和 Mode D 除外）；异步读到对任何静态 Bank 或动态 Bank 的异步或同步写（复用模式和 Mode D 除外）。以下情况之间插入 2 个 FMC 时钟周期的总线周转延迟：对同一 Bank 的两次连续同步写操作（突发或单次模式）；同步写（突发或单次）访问与对静态存储 Bank 的异步写或读传输（读操作时 Bank 可相同或不同）；两次连续同步读操作（突发或单次模式）后接对另一静态存储 Bank 的任何同步/异步读或写。以下情况之间插入 3 个 FMC 时钟周期的总线周转延迟：对不同静态 Bank 的两次连续同步写操作（突发或单次模式）；同步写访问（突发或单次模式）与对相同或不同 Bank 的同步读。总线周转延迟用于匹配连续事务之间的最小时间（tEHEL，从 NEx 高电平到 NEx 低电平）以及存储器在读取后释放数据总线所需的最大时间（tEHQZ）：若 EXTMOD = 0，则 (BUSTRUN + 1) 个 KCK_FMC 周期 ≥ tEHELmin 且 (BUSTRUN + 2) 个 KCK_FMC 周期 ≥ tEHQZmax；若 EXTMOD = 1，则 (BUSTRUN + 2) 个 KCK_FMC 周期 ≥ max(tEHELmin, tEHQZmax)。...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>时钟分频比（用于 FMC_CLK 信号）。这些位定义 FMC_CLK 时钟输出信号的周期，以 KCK_FMC 周期数表示：异步 NOR Flash、SRAM 或 PSRAM 访问中此值无效。注意：FMC_CLK 分频比公式请参见第 20.6.5 节：同步事务。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>同步存储器数据延迟。对于使能了读写突发模式的同步访问，这些位定义存储器时钟周期数。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>访问模式。这些位指定异步访问模式，如时序图所示。仅当 FMC_BCRx 寄存器中的 EXTMOD 位为 1 时才生效。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR</name>
          <displayName>PCR</displayName>
          <description>NAND Flash 控制寄存器</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>PWAITEN</name>
              <description>等待特性使能位。此位使能 NAND Flash 存储 Bank 的等待特性：</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBKEN</name>
              <description>NAND Flash 存储 Bank 使能位。此位使能存储 Bank。访问被禁用的存储 Bank 会导致 AXI 总线产生 ERROR。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWID</name>
              <description>数据总线宽度。这些位定义外部存储器件的宽度。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECC 计算逻辑使能位</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCLR</name>
              <description>CLE 到 RE 延迟。这些位以 KCK_FMC 时钟周期数设置从 CLE 低电平到 RE 低电平的时间。时间由以下公式给出：t_clr = (TCLR + SET + 2) × TKCK_FMC，其中 TKCK_FMC 为 KCK_FMC 时钟周期。注意：SET 为 MEMSET 或 ATTSET，取决于所寻址的空间。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TAR</name>
              <description>ALE 到 RE 延迟。这些位以 KCK_FMC 时钟周期数设置从 ALE 低电平到 RE 低电平的时间。时间为：t_ar = (TAR + SET + 2) × TKCK_FMC，其中 TKCK_FMC 为 FMC 时钟周期。注意：SET 为 MEMSET 或 ATTSET，取决于所寻址的空间。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ECCPS</name>
              <description>ECC 页大小。这些位定义扩展 ECC 的页大小：</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>该寄存器包含 FIFO 状态和中断信息。FMC 具有一个 FIFO，用于在写入存储器时缓冲最多 16 个字的数据。这用于快速写入 FIFO 并释放 AXI 总线用于访问 FMC 以外的外设，同时 FMC 将其 FIFO 中的数据排空到存储器中。其中一个寄存器位指示 FIFO 的状态，用于 ECC 相关目的。ECC 在数据写入存储器时计算。为了读取正确的 ECC，软件必须等待 FIFO 为空。</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>IRS</name>
              <description>中断上升沿状态。该标志由硬件置位，由软件复位。注意：如果软件向此位写入 1，它将置位。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILS</name>
              <description>中断高电平状态。该标志由硬件置位，由软件复位。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFS</name>
              <description>中断下降沿状态。该标志由硬件置位，由软件复位。注意：如果软件向此位写入 1，它将置位。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IREN</name>
              <description>中断上升沿检测使能位</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILEN</name>
              <description>中断高电平检测使能位</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFEN</name>
              <description>中断下降沿检测使能位</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEMPT</name>
              <description>FIFO 为空。只读位，提供 FIFO 的状态。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMEM</name>
          <displayName>PMEM</displayName>
          <description>FMC_PMEM 读写寄存器包含 NAND Flash 存储 Bank 的时序信息。该信息用于访问 NAND Flash 的公共存储空间，以进行命令、地址写访问和数据读写访问。</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>MEMSET</name>
              <description>公共存储器建立时间。这些位定义在命令（NWE、NOE）有效之前、用于建立地址的 KCK_FMC 时钟周期数（+1），用于对公共存储空间的 NAND Flash 读写访问：</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMWAIT</name>
              <description>公共存储器等待时间。这些位定义命令（NWE、NOE）有效的最小 KCK_FMC 时钟周期数（+1），用于对公共存储空间的 NAND Flash 读写访问。若等待信号（NWAIT）在编程的 KCK_FMC 值结束时为有效（低电平），则命令有效的持续时间将被延长：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMHOLD</name>
              <description>公共存储器保持时间。这些位定义在命令（NWE、NOE）无效后地址保持（写访问时还包括数据保持）的 KCK_FMC 时钟周期数（写访问）和 KCK_FMC+1 时钟周期数（读访问），用于对公共存储空间的 NAND Flash 读写访问：</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMHIZ</name>
              <description>公共存储器数据总线高阻态时间。这些位定义在 NAND Flash 对公共存储空间写访问启动后，数据总线保持高阻态的 KCK_FMC 时钟周期数。仅对写事务有效：</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PATT</name>
          <displayName>PATT</displayName>
          <description>FMC_PATT 读写寄存器包含 NAND Flash 存储 Bank 的时序信息。用于对 NAND Flash 属性存储空间的 8 位访问，当最后一次地址写访问的时序必须与此前访问的时序不同时使用（就绪/忙管理请参见第 20.8.5 节：NAND Flash 预等待特性）。</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>ATTSET</name>
              <description>属性存储器建立时间。这些位定义在命令（NWE、NOE）有效之前、用于建立地址的 KCK_FMC 时钟周期数（+1），用于对属性存储空间的 NAND Flash 读写访问：</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>属性存储器等待时间。这些位定义命令（NWE、NOE）有效的最小 KCK_FMC 时钟周期数（+1），用于对属性存储空间的 NAND Flash 读写访问。若等待信号（NWAIT）在编程的 KCK_FMC 值结束时为有效（低电平），则命令有效的持续时间将被延长：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTHOLD</name>
              <description>属性存储器保持时间。这些位定义在命令（NWE、NOE）无效后地址保持（写访问时还包括数据保持）的 KCK_FMC 时钟周期数，用于对属性存储空间的 NAND Flash 读写访问：</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTHIZ</name>
              <description>属性存储器数据总线高阻态时间。这些位定义在 NAND Flash 对插槽上的属性存储空间写访问启动后，数据总线保持高阻态的 KCK_FMC 时钟周期数。仅对写事务有效：</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCR</name>
          <displayName>ECCR</displayName>
          <description>该寄存器包含由 FMC NAND 控制器的 ECC 计算模块计算出的当前纠错码值。当 CPU 以正确的地址读/写 NAND Flash 存储器页的数据时（参见第 20.8.6 节：NAND Flash 存储器中纠错码（ECC）的计算），从/向 NAND Flash 存储器读/写的数据由 ECC 计算模块自动处理。读取了 X 字节后（根据 FMC_PCR 寄存器中的 ECCPS 字段），CPU 必须从 FMC_ECC 寄存器中读取计算出的 ECC 值，然后校验这些计算出的校验数据是否与记录在备用区的校验值相同，以确定页是否有效，并在无效时进行纠正。FMC_ECCR 寄存器在读出后应通过将 ECCEN 位清零来清除。要计算新的数据块，必须将 ECCEN 位置 1。</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>ECC 结果。该字段包含由 ECC 计算逻辑计算出的值。表 167 描述了这些位字段的内容。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BWTR1</name>
          <displayName>BWTR1</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。当 FMC_BCRx 寄存器中的 EXTMOD 位置 1 时，本寄存器对写访问有效。</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>地址建立阶段持续时间。这些位由软件写入，用于定义地址建立阶段的持续时间，以 KCK_FMC 周期数表示（参见图 81 至图 93），用于异步访问：... 注意：同步访问中不使用此值，地址建立阶段始终为 1 个 Flash 时钟周期。在复用模式下，ADDSET 的最小值为 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>地址保持阶段持续时间。这些位由软件写入，用于定义地址保持阶段的持续时间（参见图 81 至图 93），用于异步复用访问：... 注意：同步 NOR Flash 访问中不使用此值，地址保持阶段始终为 1 个 Flash 时钟周期。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>数据阶段持续时间。这些位由软件写入，用于定义数据阶段的持续时间（参见图 81 至图 93），用于异步 SRAM、PSRAM 和 NOR Flash 存储器访问：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>总线周转阶段持续时间。这些位由软件写入，用于在写事务结束时添加延迟，以匹配连续事务之间的最小时间（tEHEL，从 ENx 高电平到 ENx 低电平）：(BUSTRUN + 1) 个 KCK_FMC 周期 ≥ tEHELmin。编程的总线周转延迟插入在异步写传输与对静态 Bank 的任何其他异步/同步读或写传输之间。若执行读操作，Bank 可相同或不同；若为写操作，Bank 必须不同（复用模式或 Mode D 除外）。在某些情况下，无论 BUSTRUN 编程值为何，总线周转延迟按以下规则固定：除复用模式和 Mode D 外，对同一静态存储 Bank 的两次连续异步写传输之间不插入总线周转延迟。以下情况之间插入 2 个 FMC 时钟周期的总线周转延迟：对同一 Bank 的两次连续同步写操作（突发或单次模式）；同步写传输（突发或单次模式）与对静态存储 Bank 的异步写或读传输。以下情况之间插入 3 个 FMC 时钟周期的总线周转延迟：对不同静态 Bank 的两次连续同步写操作（突发或单次模式）；同步写传输（突发或单次模式）与对相同或不同 Bank 的同步读。...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>访问模式。这些位指定异步访问模式，如后续时序图所示。仅当 FMC_BCRx 寄存器中的 EXTMOD 位为 1 时才生效。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
