Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>BWTR2</name>
          <displayName>BWTR2</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。当 FMC_BCRx 寄存器中的 EXTMOD 位置 1 时，本寄存器对写访问有效。</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>地址建立阶段持续时间。这些位由软件写入，用于定义地址建立阶段的持续时间，以 KCK_FMC 周期数表示（参见图 81 至图 93），用于异步访问：... 注意：同步访问中不使用此值，地址建立阶段始终为 1 个 Flash 时钟周期。在复用模式下，ADDSET 的最小值为 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>地址保持阶段持续时间。这些位由软件写入，用于定义地址保持阶段的持续时间（参见图 81 至图 93），用于异步复用访问：... 注意：同步 NOR Flash 访问中不使用此值，地址保持阶段始终为 1 个 Flash 时钟周期。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>数据阶段持续时间。这些位由软件写入，用于定义数据阶段的持续时间（参见图 81 至图 93），用于异步 SRAM、PSRAM 和 NOR Flash 存储器访问：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>总线周转阶段持续时间。这些位由软件写入，用于在写事务结束时添加延迟，以匹配连续事务之间的最小时间（tEHEL，从 ENx 高电平到 ENx 低电平）：(BUSTRUN + 1) 个 KCK_FMC 周期 ≥ tEHELmin。编程的总线周转延迟插入在异步写传输与对静态 Bank 的任何其他异步/同步读或写传输之间。若执行读操作，Bank 可相同或不同；若为写操作，Bank 必须不同（复用模式或 Mode D 除外）。在某些情况下，无论 BUSTRUN 编程值为何，总线周转延迟按以下规则固定：除复用模式和 Mode D 外，对同一静态存储 Bank 的两次连续异步写传输之间不插入总线周转延迟。以下情况之间插入 2 个 FMC 时钟周期的总线周转延迟：对同一 Bank 的两次连续同步写操作（突发或单次模式）；同步写传输（突发或单次模式）与对静态存储 Bank 的异步写或读传输。以下情况之间插入 3 个 FMC 时钟周期的总线周转延迟：对不同静态 Bank 的两次连续同步写操作（突发或单次模式）；同步写传输（突发或单次模式）与对相同或不同 Bank 的同步读。...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>访问模式。这些位指定异步访问模式，如后续时序图所示。仅当 FMC_BCRx 寄存器中的 EXTMOD 位为 1 时才生效。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BWTR3</name>
          <displayName>BWTR3</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。当 FMC_BCRx 寄存器中的 EXTMOD 位置 1 时，本寄存器对写访问有效。</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>地址建立阶段持续时间。这些位由软件写入，用于定义地址建立阶段的持续时间，以 KCK_FMC 周期数表示（参见图 81 至图 93），用于异步访问：... 注意：同步访问中不使用此值，地址建立阶段始终为 1 个 Flash 时钟周期。在复用模式下，ADDSET 的最小值为 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>地址保持阶段持续时间。这些位由软件写入，用于定义地址保持阶段的持续时间（参见图 81 至图 93），用于异步复用访问：... 注意：同步 NOR Flash 访问中不使用此值，地址保持阶段始终为 1 个 Flash 时钟周期。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>数据阶段持续时间。这些位由软件写入，用于定义数据阶段的持续时间（参见图 81 至图 93），用于异步 SRAM、PSRAM 和 NOR Flash 存储器访问：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>总线周转阶段持续时间。这些位由软件写入，用于在写事务结束时添加延迟，以匹配连续事务之间的最小时间（tEHEL，从 ENx 高电平到 ENx 低电平）：(BUSTRUN + 1) 个 KCK_FMC 周期 ≥ tEHELmin。编程的总线周转延迟插入在异步写传输与对静态 Bank 的任何其他异步/同步读或写传输之间。若执行读操作，Bank 可相同或不同；若为写操作，Bank 必须不同（复用模式或 Mode D 除外）。在某些情况下，无论 BUSTRUN 编程值为何，总线周转延迟按以下规则固定：除复用模式和 Mode D 外，对同一静态存储 Bank 的两次连续异步写传输之间不插入总线周转延迟。以下情况之间插入 2 个 FMC 时钟周期的总线周转延迟：对同一 Bank 的两次连续同步写操作（突发或单次模式）；同步写传输（突发或单次模式）与对静态存储 Bank 的异步写或读传输。以下情况之间插入 3 个 FMC 时钟周期的总线周转延迟：对不同静态 Bank 的两次连续同步写操作（突发或单次模式）；同步写传输（突发或单次模式）与对相同或不同 Bank 的同步读。...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>访问模式。这些位指定异步访问模式，如后续时序图所示。仅当 FMC_BCRx 寄存器中的 EXTMOD 位为 1 时才生效。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BWTR4</name>
          <displayName>BWTR4</displayName>
          <description>该寄存器包含各存储 Bank 的控制信息，用于 SRAM、PSRAM 和 NOR Flash 存储器。当 FMC_BCRx 寄存器中的 EXTMOD 位置 1 时，本寄存器对写访问有效。</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>地址建立阶段持续时间。这些位由软件写入，用于定义地址建立阶段的持续时间，以 KCK_FMC 周期数表示（参见图 81 至图 93），用于异步访问：... 注意：同步访问中不使用此值，地址建立阶段始终为 1 个 Flash 时钟周期。在复用模式下，ADDSET 的最小值为 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>地址保持阶段持续时间。这些位由软件写入，用于定义地址保持阶段的持续时间（参见图 81 至图 93），用于异步复用访问：... 注意：同步 NOR Flash 访问中不使用此值，地址保持阶段始终为 1 个 Flash 时钟周期。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>数据阶段持续时间。这些位由软件写入，用于定义数据阶段的持续时间（参见图 81 至图 93），用于异步 SRAM、PSRAM 和 NOR Flash 存储器访问：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>总线周转阶段持续时间。这些位由软件写入，用于在写事务结束时添加延迟，以匹配连续事务之间的最小时间（tEHEL，从 ENx 高电平到 ENx 低电平）：(BUSTRUN + 1) 个 KCK_FMC 周期 ≥ tEHELmin。编程的总线周转延迟插入在异步写传输与对静态 Bank 的任何其他异步/同步读或写传输之间。若执行读操作，Bank 可相同或不同；若为写操作，Bank 必须不同（复用模式或 Mode D 除外）。在某些情况下，无论 BUSTRUN 编程值为何，总线周转延迟按以下规则固定：除复用模式和 Mode D 外，对同一静态存储 Bank 的两次连续异步写传输之间不插入总线周转延迟。以下情况之间插入 2 个 FMC 时钟周期的总线周转延迟：对同一 Bank 的两次连续同步写操作（突发或单次模式）；同步写传输（突发或单次模式）与对静态存储 Bank 的异步写或读传输。以下情况之间插入 3 个 FMC 时钟周期的总线周转延迟：对不同静态 Bank 的两次连续同步写操作（突发或单次模式）；同步写传输（突发或单次模式）与对相同或不同 Bank 的同步读。...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>访问模式。这些位指定异步访问模式，如后续时序图所示。仅当 FMC_BCRx 寄存器中的 EXTMOD 位为 1 时才生效。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDCR1</name>
          <displayName>SDCR1</displayName>
          <description>该寄存器包含各 SDRAM 存储 Bank 的控制参数</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000002D0</resetValue>
          <fields>
            <field>
              <name>NC</name>
              <description>列地址位数。这些位定义列地址的位数。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NR</name>
              <description>行地址位数。这些位定义行地址的位数。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>存储器数据总线宽度。这些位定义存储器件的宽度。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <description>内部 Bank 数量。此位设置内部 Bank 的数量。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS 延迟。这些位以存储器时钟周期数设置 SDRAM CAS 延迟。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WP</name>
              <description>写保护。此位使能对 SDRAM Bank 的写模式访问。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDCLK</name>
              <description>SDRAM 时钟配置。这些位为两个 SDRAM Bank 定义 SDRAM 时钟周期，并允许在更改频率之前禁用时钟。在这种情况下，SDRAM 必须重新初始化。注意：FMC_SDCR2 寄存器中的对应位为只读。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RBURST</name>
              <description>突发读。此位使能突发读模式。SDRAM 控制器在 CAS 延迟期间预取下一个读命令并将数据存储在读 FIFO 中。注意：FMC_SDCR2 寄存器中的对应位为只读。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPIPE</name>
              <description>读流水线。这些位定义 CAS 延迟后读取数据的延迟，以 KCK_FMC 时钟周期数表示。注意：FMC_SDCR2 寄存器中的对应位为只读。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDCR2</name>
          <displayName>SDCR2</displayName>
          <description>该寄存器包含各 SDRAM 存储 Bank 的控制参数</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000002D0</resetValue>
          <fields>
            <field>
              <name>NC</name>
              <description>列地址位数。这些位定义列地址的位数。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NR</name>
              <description>行地址位数。这些位定义行地址的位数。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>存储器数据总线宽度。这些位定义存储器件的宽度。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <description>内部 Bank 数量。此位设置内部 Bank 的数量。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS 延迟。这些位以存储器时钟周期数设置 SDRAM CAS 延迟。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WP</name>
              <description>写保护。此位使能对 SDRAM Bank 的写模式访问。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDCLK</name>
              <description>SDRAM 时钟配置。这些位为两个 SDRAM Bank 定义 SDRAM 时钟周期，并允许在更改频率之前禁用时钟。在这种情况下，SDRAM 必须重新初始化。注意：FMC_SDCR2 寄存器中的对应位为只读。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RBURST</name>
              <description>突发读。此位使能突发读模式。SDRAM 控制器在 CAS 延迟期间预取下一个读命令并将数据存储在读 FIFO 中。注意：FMC_SDCR2 寄存器中的对应位为只读。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPIPE</name>
              <description>读流水线。这些位定义 CAS 延迟后读取数据的延迟，以 KCK_FMC 时钟周期数表示。注意：FMC_SDCR2 寄存器中的对应位为只读。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDTR1</name>
          <displayName>SDTR1</displayName>
          <description>该寄存器包含各 SDRAM Bank 的时序参数</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>TMRD</name>
              <description>加载模式寄存器到激活。这些位定义加载模式寄存器命令与激活或刷新命令之间的延迟，以存储器时钟周期数表示。....</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TXSR</name>
              <description>退出自刷新延迟。这些位定义从释放自刷新命令到发出激活命令之间的延迟，以存储器时钟周期数表示。.... 注意：若使用两片 SDRAM 器件，FMC_SDTR1 和 FMC_SDTR2 必须编程为与较慢 SDRAM 器件对应的相同 TXSR 时序。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRAS</name>
              <description>自刷新时间。这些位定义最小自刷新周期，以存储器时钟周期数表示。....</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>行周期延迟。这些位定义刷新命令与激活命令之间的延迟，以及两次连续刷新命令之间的延迟，以存储器时钟周期数表示。TRC 时序仅在 FMC_SDTR1 寄存器中配置。若使用两片 SDRAM 器件，TRC 必须编程为较慢器件的时序。.... 注意：TRC 必须与 SDRAM 器件数据手册中定义的 TRC 和 TRFC（自动刷新周期）时序匹配。注意：FMC_SDTR2 寄存器中的对应位无效。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TWR</name>
              <description>恢复延迟。这些位定义写命令与预充电命令之间的延迟，以存储器时钟周期数表示。.... 注意：TWR 必须编程为与 SDRAM 数据手册中定义的写恢复时间（tWR）匹配，并保证：TWR ≥ TRAS - TRCD 且 TWR ≥ TRC - TRCD - TRP。示例：TRAS = 4 个周期，TRCD = 2 个周期，则 TWR &gt;= 2 个周期，TWR 必须编程为 0x1。若使用两片 SDRAM 器件，FMC_SDTR1 和 FMC_SDTR2 必须编程为与较慢 SDRAM 器件对应的相同 TWR 时序。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRP</name>
              <description>行预充电延迟。这些位定义预充电命令与另一命令之间的延迟，以存储器时钟周期数表示。TRP 时序仅在 FMC_SDTR1 寄存器中配置。若使用两片 SDRAM 器件，TRP 必须编程为较慢器件的时序。.... 注意：FMC_SDTR2 寄存器中的对应位无效。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRCD</name>
              <description>行到列延迟。这些位定义激活命令与读/写命令之间的延迟，以存储器时钟周期数表示。....</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDTR2</name>
          <displayName>SDTR2</displayName>
          <description>该寄存器包含各 SDRAM Bank 的时序参数</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>TMRD</name>
              <description>加载模式寄存器到激活。这些位定义加载模式寄存器命令与激活或刷新命令之间的延迟，以存储器时钟周期数表示。....</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TXSR</name>
              <description>退出自刷新延迟。这些位定义从释放自刷新命令到发出激活命令之间的延迟，以存储器时钟周期数表示。.... 注意：若使用两片 SDRAM 器件，FMC_SDTR1 和 FMC_SDTR2 必须编程为与较慢 SDRAM 器件对应的相同 TXSR 时序。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRAS</name>
              <description>自刷新时间。这些位定义最小自刷新周期，以存储器时钟周期数表示。....</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>行周期延迟。这些位定义刷新命令与激活命令之间的延迟，以及两次连续刷新命令之间的延迟，以存储器时钟周期数表示。TRC 时序仅在 FMC_SDTR1 寄存器中配置。若使用两片 SDRAM 器件，TRC 必须编程为较慢器件的时序。.... 注意：TRC 必须与 SDRAM 器件数据手册中定义的 TRC 和 TRFC（自动刷新周期）时序匹配。注意：FMC_SDTR2 寄存器中的对应位无效。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TWR</name>
              <description>恢复延迟。这些位定义写命令与预充电命令之间的延迟，以存储器时钟周期数表示。.... 注意：TWR 必须编程为与 SDRAM 数据手册中定义的写恢复时间（tWR）匹配，并保证：TWR ≥ TRAS - TRCD 且 TWR ≥ TRC - TRCD - TRP。示例：TRAS = 4 个周期，TRCD = 2 个周期，则 TWR &gt;= 2 个周期，TWR 必须编程为 0x1。若使用两片 SDRAM 器件，FMC_SDTR1 和 FMC_SDTR2 必须编程为与较慢 SDRAM 器件对应的相同 TWR 时序。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRP</name>
              <description>行预充电延迟。这些位定义预充电命令与另一命令之间的延迟，以存储器时钟周期数表示。TRP 时序仅在 FMC_SDTR1 寄存器中配置。若使用两片 SDRAM 器件，TRP 必须编程为较慢器件的时序。.... 注意：FMC_SDTR2 寄存器中的对应位无效。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRCD</name>
              <description>行到列延迟。这些位定义激活命令与读/写命令之间的延迟，以存储器时钟周期数表示。....</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDCMR</name>
          <displayName>SDCMR</displayName>
          <description>该寄存器包含访问 SDRAM 器件时发出的命令。此寄存器用于初始化 SDRAM 器件，以及激活自刷新和掉电模式。一旦写入 MODE 字段，命令将根据 CTB1 和 CTB2 命令位仅发送到一个或两个 SDRAM Bank。此寄存器对两个 SDRAM Bank 通用。</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>命令模式。这些位定义发送到 SDRAM 器件的命令。注意：发出命令时，必须至少设置一个命令目标 Bank 位（CTB1 或 CTB2），否则命令将被忽略。注意：若使用两个 SDRAM Bank，自动刷新和 PALL 命令必须同时发送到两个器件，且 CTB1 和 CTB2 位均置位，否则命令将被忽略。注意：若仅使用一个 SDRAM Bank 且发出了命令并设置了其关联的 CTB 位，则未用 Bank 的另一个 CTB 位必须保持为 0。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CTB2</name>
              <description>命令目标 Bank 2。此位指示命令是否发送到 SDRAM Bank 2。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTB1</name>
              <description>命令目标 Bank 1。此位指示命令是否发送到 SDRAM Bank 1。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRFS</name>
              <description>自动刷新次数。这些位定义当 MODE = 011 时发出的连续自动刷新命令的次数。....</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MRD</name>
              <description>模式寄存器定义。此 14 位字段定义 SDRAM 模式寄存器的内容。模式寄存器通过加载模式寄存器命令进行编程。MRD[13:0] 位也用于编程移动 SDRAM 的扩展模式寄存器。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRTR</name>
          <displayName>SDRTR</displayName>
          <description>该寄存器通过配置刷新定时器计数值，以 SDCLK 时钟周期数设置刷新周期之间的刷新速率。示例中 64 ms 为 SDRAM 刷新周期。如果内部刷新请求在读请求已被接受时发生，刷新速率必须增加 20 个 SDRAM 时钟周期（如上例）以获得安全余量，对应 COUNT 值为 0000111000000（448）。此 13 位字段被加载到一个使用 SDRAM 时钟递减的定时器中。当计数达到零时，该定时器产生一个刷新脉冲。COUNT 值必须至少设置为 41 个 SDRAM 时钟周期。一旦编程了 FMC_SDRTR 寄存器，定时器就开始计数。如果寄存器中编程的值为 0，则不执行刷新。初始化过程之后不得重新编程此寄存器，以避免修改刷新速率。每次产生刷新脉冲时，此 13 位 COUNT 字段被重新加载到计数器中。如果正在进行存储器访问，自动刷新请求将被延迟。但是，如果存储器访问和自动刷新请求同时产生，则自动刷新优先。如果存储器访问在刷新操作期间发生，则请求被缓冲，待刷新完成后处理。此寄存器对 SDRAM Bank 1 和 Bank 2 通用。</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRE</name>
              <description>清除刷新错误标志。此位用于清除状态寄存器中的刷新错误标志（RE）。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COUNT</name>
              <description>刷新定时器计数值。此 13 位字段定义 SDRAM 器件的刷新速率，以存储器时钟周期数表示。必须至少设置为 41 个 SDRAM 时钟周期（0x29）。刷新速率 = (COUNT + 1) × SDRAM 时钟频率，COUNT = (SDRAM 刷新周期 / 行数) - 20</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REIE</name>
              <description>刷新错误（RE）中断使能</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDSR</name>
          <displayName>SDSR</displayName>
          <description>SDRAM 状态寄存器</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RE</name>
              <description>刷新错误标志。若 REIE = 1 且 RE = 1，则产生中断。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODES1</name>
              <description>Bank 1 状态模式。这些位定义 SDRAM Bank 1 的状态模式。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODES2</name>
              <description>Bank 2 状态模式。这些位定义 SDRAM Bank 2 的状态模式。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
