Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>HSEM_ICR</name>
          <displayName>HSEM_ICR</displayName>
          <description>HSEM 中断清除寄存器</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISEM0</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM1</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM2</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM3</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM4</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM5</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM6</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM7</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM8</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM9</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM10</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM11</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM12</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM13</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM14</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM15</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM16</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM17</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM18</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM19</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM20</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM21</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM22</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM23</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM24</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM25</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM26</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM27</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM28</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM29</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM30</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM31</name>
              <description>信号量 n 中断清除位</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_ISR</name>
          <displayName>HSEM_ISR</displayName>
          <description>HSEM 中断状态寄存器</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISEM0</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM1</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM2</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM3</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM4</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM5</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM6</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM7</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM8</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM9</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM10</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM11</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM12</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM13</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM14</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM15</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM16</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM17</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM18</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM19</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM20</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM21</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM22</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM23</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM24</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM25</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM26</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM27</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM28</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM29</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM30</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM31</name>
              <description>信号量 n 中断状态位（使能屏蔽前）</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_MISR</name>
          <displayName>HSEM_MISR</displayName>
          <description>HSEM 屏蔽中断状态寄存器</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISEM0</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM1</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM2</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM3</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM4</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM5</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM6</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM7</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM8</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM9</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM10</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM11</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM12</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM13</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM14</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM15</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM16</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM17</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM18</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM19</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM20</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM21</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM22</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM23</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM24</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM25</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM26</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM27</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM28</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM29</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM30</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM31</name>
              <description>信号量 n 中断状态位（使能屏蔽后）</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_CR</name>
          <displayName>HSEM_CR</displayName>
          <description>HSEM 清除寄存器</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASTERID</name>
              <description>待清除信号量的主设备 ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>信号量清除密钥</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_KEYR</name>
          <displayName>HSEM_KEYR</displayName>
          <description>HSEM 密钥寄存器</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>信号量清除密钥</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
