Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>I2C 总线接口</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C1_ER</name>
        <description>I2C1 错误中断</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>I2C1_EV</name>
        <description>I2C1 事件中断</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>访问：无等待状态，但对本寄存器的写访问正在进行时再次发起写访问的情况除外。此时，第二次写访问会插入等待状态，直到前一次写操作完成。第二次写访问的延迟最长可达 2 个 PCLK1 周期 + 6 个 I2CCLK 周期。</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PE</name>
              <description>外设使能。注意：当 PE=0 时，I2C 的 SCL 和 SDA 线将被释放，内部状态机和状态位恢复为复位值。清零 PE 后，必须保持低电平至少 3 个 APB 时钟周期。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXIE</name>
              <description>发送中断使能</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXIE</name>
              <description>接收中断使能</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDRIE</name>
              <description>地址匹配中断使能（仅从机模式）</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACKIE</name>
              <description>接收到非应答中断使能</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPIE</name>
              <description>STOP 检测中断使能</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>传输完成中断使能。注意：以下任一事件均会产生中断：传输完成（TC）、传输完成重载（TCR）。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>错误中断使能。注意：以下任一错误均会产生中断：仲裁丢失（ARLO）、总线错误检测（BERR）、上溢/下溢（OVR）、超时检测（TIMEOUT）、PEC 错误检测（PECERR）、SMBus 报警引脚事件检测（ALERT）。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DNF</name>
              <description>数字噪声滤波器。这些位用于配置 SDA 和 SCL 输入端的数字噪声滤波器。数字滤波器可滤除宽度不超过 DNF[3:0] × tI2CCLK 的毛刺……注意：若模拟滤波器也使能，则数字滤波器叠加在模拟滤波器之上。此滤波器仅可在 I2C 禁用（PE=0）时编程。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ANFOFF</name>
              <description>模拟噪声滤波器关闭。注意：此位仅可在 I2C 禁用（PE=0）时编程。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>DMA 发送请求使能</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>DMA 接收请求使能</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBC</name>
              <description>从机字节控制。此位用于在从机模式下使能硬件字节控制。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOSTRETCH</name>
              <description>时钟拉伸禁用。此位用于在从机模式下禁用时钟拉伸。主机模式下必须保持清零。注意：此位仅可在 I2C 禁用（PE=0）时编程。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN</name>
              <description>停止模式唤醒使能。注意：若器件不支持从停止模式唤醒，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。注意：WUPEN 仅可在 DNF=0000 时置位。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCEN</name>
              <description>通用广播使能</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMBHEN</name>
              <description>SMBus 主机地址使能。注意：若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMBDEN</name>
              <description>SMBus 设备默认地址使能。注意：若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALERTEN</name>
              <description>SMBus 报警使能。设备模式（SMBHEN=0）：……主机模式（SMBHEN=1）：……注意：当 ALERTEN=0 时，SMBA 引脚可用作标准 GPIO。若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECEN</name>
              <description>PEC 使能。注意：若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>访问：无等待状态，但对本寄存器的写访问正在进行时再次发起写访问的情况除外。此时，第二次写访问会插入等待状态，直到前一次写操作完成。第二次写访问的延迟最长可达 2 个 PCLK1 周期 + 6 个 I2CCLK 周期。</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SADD0</name>
              <description>从机地址位 0（主机模式）。7 位地址模式（ADD10=0）：此位为无关位。10 位地址模式（ADD10=1）：此位应写入待发送从机地址的位 0。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD1</name>
              <description>从机地址位 7:1（主机模式）。7 位地址模式（ADD10=0）：这些位应写入待发送的 7 位从机地址。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 7:1。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD2</name>
              <description>从机地址位 7:1（主机模式）。7 位地址模式（ADD10=0）：这些位应写入待发送的 7 位从机地址。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 7:1。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD3</name>
              <description>从机地址位 7:1（主机模式）。7 位地址模式（ADD10=0）：这些位应写入待发送的 7 位从机地址。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 7:1。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD4</name>
              <description>从机地址位 7:1（主机模式）。7 位地址模式（ADD10=0）：这些位应写入待发送的 7 位从机地址。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 7:1。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD5</name>
              <description>从机地址位 7:1（主机模式）。7 位地址模式（ADD10=0）：这些位应写入待发送的 7 位从机地址。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 7:1。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD6</name>
              <description>从机地址位 7:1（主机模式）。7 位地址模式（ADD10=0）：这些位应写入待发送的 7 位从机地址。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 7:1。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD7</name>
              <description>从机地址位 7:1（主机模式）。7 位地址模式（ADD10=0）：这些位应写入待发送的 7 位从机地址。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 7:1。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD8</name>
              <description>从机地址位 9:8（主机模式）。7 位地址模式（ADD10=0）：这些位为无关位。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 9:8。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADD9</name>
              <description>从机地址位 9:8（主机模式）。7 位地址模式（ADD10=0）：这些位为无关位。10 位地址模式（ADD10=1）：这些位应写入待发送从机地址的位 9:8。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_WRN</name>
              <description>传输方向（主机模式）。注意：START 位置位期间不允许更改此位。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD10</name>
              <description>10 位地址模式（主机模式）。注意：START 位置位期间不允许更改此位。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HEAD10R</name>
              <description>10 位地址仅读取报头方向（主机接收模式）。注意：START 位置位期间不允许更改此位。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>起始条件生成。此位由软件置位，由硬件在 Start 信号及随后的地址序列发送完成后、发生仲裁丢失时、检测到超时错误时或 PE=0 时清零。也可以通过软件对 I2C_ICR 寄存器的 ADDRCF 位写 1 来清零。若 I2C 已处于主机模式且 AUTOEND=0，当 RELOAD=0 时，置位此位将在 NBYTES 传输结束后生成重复起始条件（Repeated Start）。否则，置位此位将在总线空闲后生成一个起始条件（START）。注意：对此位写 0 无效。即使总线处于 BUSY 状态或 I2C 处于从机模式，亦可置位 START 位。RELOAD 置位时此位无效。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOP</name>
              <description>停止条件生成（主机模式）。此位由软件置位，在检测到停止条件时或 PE=0 时由硬件清零。主机模式下：……注意：对此位写 0 无效。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACK</name>
              <description>NACK 生成（从机模式）。此位由软件置位，在 NACK 发送后、收到 STOP 条件或地址匹配事件时、或 PE=0 时由硬件清零。注意：对此位写 0 无效。此位仅用于从机模式：在主机接收模式下，无论 NACK 位为何值，硬件都会在 STOP 或 RESTART 条件前的最后一个字节之后自动生成 NACK。在从机接收 NOSTRETCH 模式下发生上溢时，无论 NACK 位为何值，均自动生成 NACK。当硬件 PEC 校验使能（PECBYTE=1）时，PEC 应答值不依赖于 NACK 的值。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBYTES</name>
              <description>字节数。在此编入待发送/接收的字节数。在从机模式且 SBC=0 时此字段为无关位。注意：START 位置位期间不允许更改这些位。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RELOAD</name>
              <description>NBYTES 重载模式。此位由软件置位和清零。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTOEND</name>
              <description>自动结束模式（主机模式）。此位由软件置位和清零。注意：此位在从机模式或 RELOAD 位置位时无效。</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECBYTE</name>
              <description>数据包错误校验字节。此位由软件置位，在 PEC 传输完成、收到 STOP 条件或地址匹配事件时、或 PE=0 时由硬件清零。注意：对此位写 0 无效。此位在 RELOAD 置位时无效。此位在从机模式且 SBC=0 时无效。若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR1</name>
          <displayName>OAR1</displayName>
          <description>访问：无等待状态，但对本寄存器的写访问正在进行时再次发起写访问的情况除外。此时，第二次写访问会插入等待状态，直到前一次写操作完成。第二次写访问的延迟最长可达 2 个 PCLK1 周期 + 6 个 I2CCLK 周期。</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OA1</name>
              <description>接口地址。7 位地址模式：无关位。10 位地址模式：地址的位 9:8。注意：这些位仅可在 OA1EN=0 时写入。OA1[7:1]：接口地址的位 7:1。注意：这些位仅可在 OA1EN=0 时写入。OA1[0]：接口地址。7 位地址模式：无关位。10 位地址模式：地址的位 0。注意：此位仅可在 OA1EN=0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>OA1MODE</name>
              <description>自身地址 1 的 10 位模式。注意：此位仅可在 OA1EN=0 时写入。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OA1EN</name>
              <description>自身地址 1 使能</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR2</name>
          <displayName>OAR2</displayName>
          <description>访问：无等待状态，但对本寄存器的写访问正在进行时再次发起写访问的情况除外。此时，第二次写访问会插入等待状态，直到前一次写操作完成。第二次写访问的延迟最长可达 2 个 PCLK1 周期 + 6 个 I2CCLK 周期。</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OA2</name>
              <description>接口地址的位 7:1。注意：这些位仅可在 OA2EN=0 时写入。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>OA2MSK</name>
              <description>自身地址 2 掩码。注意：这些位仅可在 OA2EN=0 时写入。一旦 OA2MSK 不等于 0，即使比较匹配，保留的 I2C 地址（0b0000xxx 和 0b1111xxx）也不会被应答。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OA2EN</name>
              <description>自身地址 2 使能</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR</name>
          <displayName>TIMINGR</displayName>
          <description>访问：无等待状态</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCLL</name>
              <description>SCL 低电平周期（主机模式）。此字段用于在主机模式下生成 SCL 低电平周期。tSCLL = (SCLL + 1) × tPRESC。注意：SCLL 也用于生成 tBUF 和 tSU:STA 时序。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCLH</name>
              <description>SCL 高电平周期（主机模式）。此字段用于在主机模式下生成 SCL 高电平周期。tSCLH = (SCLH + 1) × tPRESC。注意：SCLH 也用于生成 tSU:STO 和 tHD:STA 时序。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SDADEL</name>
              <description>数据保持时间。此字段用于生成 SCL 下降沿与 SDA 边沿之间的延迟 tSDADEL。在主机模式以及 NOSTRETCH=0 的从机模式下，SCL 线在 tSDADEL 期间被拉低。tSDADEL = SDADEL × tPRESC。注意：SDADEL 用于生成 tHD:DAT 时序。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SCLDEL</name>
              <description>数据建立时间。此字段用于生成 SDA 边沿与 SCL 上升沿之间的延迟 tSCLDEL。在主机模式以及 NOSTRETCH=0 的从机模式下，SCL 线在 tSCLDEL 期间被拉低。tSCLDEL = (SCLDEL + 1) × tPRESC。注意：tSCLDEL 用于生成 tSU:DAT 时序。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PRESC</name>
              <description>时序预分频器。此字段用于对 I2CCLK 进行预分频，以生成时钟周期 tPRESC，供数据建立和保持计数器（参见第 9 页的 I2C 时序）以及 SCL 高、低电平计数器（参见第 24 页的 I2C 主机初始化）使用。tPRESC = (PRESC + 1) × tI2CCLK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUTR</name>
          <displayName>TIMEOUTR</displayName>
          <description>访问：无等待状态，但对本寄存器的写访问正在进行时再次发起写访问的情况除外。此时，第二次写访问会插入等待状态，直到前一次写操作完成。第二次写访问的延迟最长可达 2 个 PCLK1 周期 + 6 个 I2CCLK 周期。</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMEOUTA</name>
              <description>总线超时 A。此字段用于配置：当 TIDLE=0 时，SCL 低电平超时条件 tTIMEOUT。tTIMEOUT = (TIMEOUTA + 1) × 2048 × tI2CCLK。当 TIDLE=1 时，总线空闲条件（SCL 和 SDA 均为高电平）。tIDLE = (TIMEOUTA + 1) × 4 × tI2CCLK。注意：这些位仅可在 TIMOUTEN=0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TIDLE</name>
              <description>空闲时钟超时检测。注意：此位仅可在 TIMOUTEN=0 时写入。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMOUTEN</name>
              <description>时钟超时使能</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMEOUTB</name>
              <description>总线超时 B。此字段用于配置累积时钟扩展超时：在主机模式下，检测主机累积时钟低电平扩展时间（tLOW:MEXT）；在从机模式下，检测从机累积时钟低电平扩展时间（tLOW:SEXT）。tLOW:EXT = (TIMEOUTB + 1) × 2048 × tI2CCLK。注意：这些位仅可在 TEXTEN=0 时写入。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TEXTEN</name>
              <description>扩展时钟超时使能</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
