Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>访问：无等待状态</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>TXE</name>
              <description>发送数据寄存器空（发送器）。当 I2C_TXDR 寄存器为空时，此位由硬件置位。当下一待发送数据写入 I2C_TXDR 寄存器时，此位清零。软件可对此位写 1 以清空发送数据寄存器 I2C_TXDR。注意：PE=0 时此位由硬件置位。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXIS</name>
              <description>发送中断状态（发送器）。当 I2C_TXDR 寄存器为空且待发送数据必须写入 I2C_TXDR 寄存器时，此位由硬件置位。当下一待发送数据写入 I2C_TXDR 寄存器时，此位清零。仅当 NOSTRETCH=1 时，软件可对此位写 1，以生成 TXIS 事件（若 TXIE=1 则产生中断，若 TXDMAEN=1 则产生 DMA 请求）。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>接收数据寄存器非空（接收器）。当接收到的数据被复制到 I2C_RXDR 寄存器且可供读取时，此位由硬件置位。读取 I2C_RXDR 后此位清零。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>地址匹配（从机模式）。当接收到的从机地址与任一已使能的从机地址匹配时，此位由硬件置位。通过软件将 ADDRCF 位置位来清零。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NACKF</name>
              <description>接收到非应答标志。当在字节传输后接收到 NACK 时，此位由硬件置位。通过软件将 NACKCF 位置位来清零。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>停止条件检测标志。当总线上检测到停止条件且本外设参与了此次传输时，此位由硬件置位：作为主机——前提是停止条件由本外设生成；或作为从机——前提是本外设在此次传输中先前已被寻址。通过软件将 STOPCF 位置位来清零。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TC</name>
              <description>传输完成（主机模式）。当 RELOAD=0、AUTOEND=0 且 NBYTES 字节的数据已完成传输时，此位由硬件置位。当 START 位或 STOP 位置位时由软件清零。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCR</name>
              <description>传输完成重载。当 RELOAD=1 且 NBYTES 字节的数据已完成传输时，此位由硬件置位。当 NBYTES 被写入非零值时由软件清零。注意：PE=0 时此位由硬件清零。此标志仅适用于主机模式，或 SBC 位置位的从机模式。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BERR</name>
              <description>总线错误。当本外设参与传输期间检测到异常的起始或停止条件时，此位由硬件置位。从机模式下地址阶段期间不会置位此标志。通过软件将 BERRCF 位置位来清零。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARLO</name>
              <description>仲裁丢失。发生仲裁丢失时此位由硬件置位。通过软件将 ARLOCF 位置位来清零。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR</name>
              <description>上溢/下溢（从机模式）。在 NOSTRETCH=1 的从机模式下，当发生上溢/下溢错误时此位由硬件置位。通过软件将 OVRCF 位置位来清零。注意：PE=0 时此位由硬件清零。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PECERR</name>
              <description>接收 PEC 错误。当接收到的 PEC 与 PEC 寄存器内容不匹配时，此位由硬件置位。在接收到错误的 PEC 后自动发送 NACK。通过软件将 PECCF 位置位来清零。注意：PE=0 时此位由硬件清零。若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>超时或 tLOW 检测标志。发生超时或扩展时钟超时时此位由硬件置位。通过软件将 TIMEOUTCF 位置位来清零。注意：PE=0 时此位由硬件清零。若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALERT</name>
              <description>SMBus 报警。当 SMBHEN=1（SMBus 主机配置）、ALERTEN=1 且 SMBA 引脚上检测到 SMBALERT 事件（下降沿）时，此位由硬件置位。通过软件将 ALERTCF 位置位来清零。注意：PE=0 时此位由硬件清零。若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>总线忙碌。此标志指示总线上正在进行通信。检测到起始条件时此位由硬件置位。检测到停止条件或 PE=0 时由硬件清零。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>传输方向（从机模式）。发生地址匹配事件（ADDR=1）时更新此标志。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDCODE</name>
              <description>地址匹配码（从机模式）。发生地址匹配事件（ADDR=1）时，这些位更新为接收到的地址。在 10 位地址情况下，ADDCODE 提供 10 位报头，后跟地址的 2 个最高有效位。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>访问：无等待状态</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRCF</name>
              <description>地址匹配标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 ADDR 标志。对此位写 1 同时也会清零 I2C_CR2 寄存器中的 START 位。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACKCF</name>
              <description>非应答标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 ACKF 标志。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPCF</name>
              <description>停止检测标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 STOPF 标志。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERRCF</name>
              <description>总线错误标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 BERRF 标志。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARLOCF</name>
              <description>仲裁丢失标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 ARLO 标志。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRCF</name>
              <description>上溢/下溢标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 OVR 标志。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECCF</name>
              <description>PEC 错误标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 PECERR 标志。注意：若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMOUTCF</name>
              <description>超时检测标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 TIMEOUT 标志。注意：若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALERTCF</name>
              <description>报警标志清零。对此位写 1 可清零 I2C_ISR 寄存器中的 ALERT 标志。注意：若器件不支持 SMBus 功能，此位为保留位，由硬件强制置 0。请参见第 25.3 节：I2C 实现。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PECR</name>
          <displayName>PECR</displayName>
          <description>访问：无等待状态</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PEC</name>
              <description>数据包错误校验寄存器。当 PECEN=1 时，此字段包含内部 PEC 值。PE=0 时 PEC 由硬件清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDR</name>
          <displayName>RXDR</displayName>
          <description>访问：无等待状态</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>8 位接收数据。从 I2C 总线接收到的数据字节。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR</name>
          <displayName>TXDR</displayName>
          <description>访问：无等待状态</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>8 位发送数据。待发送到 I2C 总线的数据字节。注意：这些位仅可在 TXE=1 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
