Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 error interrupt</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 event interrupt</description>
        <value>33</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3</name>
      <baseAddress>0x40005C00</baseAddress>
      <interrupt>
        <name>I2C3_ER</name>
        <description>I2C3 error interrupt</description>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>I2C3_EV</name>
        <description>I2C3 event interrupt</description>
        <value>72</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4</name>
      <baseAddress>0x58001C00</baseAddress>
      <interrupt>
        <name>I2C4_ER</name>
        <description>I2C4 error interrupt</description>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>I2C4_EV</name>
        <description>I2C4 event interrupt</description>
        <value>95</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <description>通用输入输出端口</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x58020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <displayName>MODER</displayName>
          <description>GPIO 端口模式寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xABFFFFFF</resetValue>
          <fields>
            <field>
              <name>MODE0</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE1</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE2</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE3</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE4</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE5</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE6</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE7</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE8</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE9</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE10</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE11</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE12</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE13</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE14</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE15</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 模式。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <displayName>OTYPER</displayName>
          <description>GPIO 端口输出类型寄存器</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OT0</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT1</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT2</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT3</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT4</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT5</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT6</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT7</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT8</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT9</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT10</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT11</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT12</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT13</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT14</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OT15</name>
              <description>端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出类型。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPEEDR</name>
          <displayName>OSPEEDR</displayName>
          <description>GPIO 端口输出速度寄存器</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0C000000</resetValue>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED8</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED9</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED10</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED11</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED12</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED13</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED14</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED15</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 输出速度。注意：各速度档位对应的频率规格及电源与负载条件，请参阅器件数据手册。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <displayName>PUPDR</displayName>
          <description>GPIO 端口上拉/下拉寄存器</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x12100000</resetValue>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD1</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD2</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD3</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD4</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD5</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD6</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD7</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD8</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD9</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD10</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD11</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD12</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD13</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD14</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD15</name>
              <description>[1:0]：端口 x 配置位（y = 0..15）。由软件写入，用于配置 I/O 上拉或下拉。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>GPIO 端口输入数据寄存器</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID0</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID1</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID2</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID3</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID4</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID5</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID6</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID7</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID8</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID9</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID10</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID11</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID12</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID13</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID14</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID15</name>
              <description>端口输入数据位（y = 0..15）。这些位为只读，保存对应 I/O 端口的输入值。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
