Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>ODR</name>
          <displayName>ODR</displayName>
          <description>GPIO 端口输出数据寄存器</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OD0</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD1</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD2</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD3</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD4</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD5</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD6</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD7</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD8</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD9</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD10</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD11</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD12</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD13</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD14</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD15</name>
              <description>端口输出数据位。软件可读写这些位。注意：如需原子方式置位/复位，可通过写 GPIOx_BSRR 或 GPIOx_BRR 寄存器（x = A..F）来单独置位和/或复位各 OD 位。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <displayName>BSRR</displayName>
          <description>GPIO 端口置位/复位寄存器</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BS0</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS1</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS2</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS3</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS4</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS5</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS6</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS7</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS8</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS9</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS10</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS11</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS12</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS13</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS14</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS15</name>
              <description>端口 x 置位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR0</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR1</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR2</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR3</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR4</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR5</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR6</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR7</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR8</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR9</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR10</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR11</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR12</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR13</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR14</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR15</name>
              <description>端口 x 复位位 y（y = 0..15）。这些位为只写，读操作返回 0x0000。注意：若 BSx 和 BRx 同时置位，BSx 优先。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <displayName>LCKR</displayName>
          <description>此寄存器用于在向位 16（LCKK）施加正确的写入序列后锁定端口位的配置。位 [15:0] 的值用于锁定 GPIO 的配置。写入序列期间，LCKR[15:0] 的值不得更改。在端口位上施加锁定序列后，该端口位的值将无法再被修改，直至下次 MCU 复位或外设复位。向 GPIOx_LCKR 寄存器写入需遵循特定的写入序列，锁定序列期间仅允许字访问（32 位）。每个锁定位将冻结对应的配置寄存器（控制寄存器和复用功能寄存器）。</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LCK0</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK1</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK2</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK3</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK4</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK5</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK6</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK7</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK8</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK9</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK10</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK11</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK12</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK13</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK14</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK15</name>
              <description>端口 x 锁定位 y（y = 0..15）。这些位可读写，但仅在 LCKK 位为 0 时可写。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCKK</name>
              <description>锁定密钥。此位可随时读取，仅可通过锁定密钥写入序列进行修改。锁定密钥写入序列：WR LCKR[16] = 1 + LCKR[15:0]、WR LCKR[16] = 0 + LCKR[15:0]、WR LCKR[16] = 1 + LCKR[15:0]、RD LCKR、RD LCKR[16] = 1（此读操作为可选，但可用于确认锁定已生效）。注意：锁定密钥写入序列过程中，LCK[15:0] 的值不得更改。序列中任何错误都将导致本次锁定中止。在对端口的任意位成功执行首次锁定序列后，读取 LCKK 位将始终返回 1，直至下次 MCU 复位或外设复位。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <displayName>AFRL</displayName>
          <description>GPIO 复用功能低位寄存器</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 0..7）。由软件写入，用于配置复用功能 I/O。AFSELy 选择：</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 0..7）。由软件写入，用于配置复用功能 I/O。AFSELy 选择：</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 0..7）。由软件写入，用于配置复用功能 I/O。AFSELy 选择：</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 0..7）。由软件写入，用于配置复用功能 I/O。AFSELy 选择：</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 0..7）。由软件写入，用于配置复用功能 I/O。AFSELy 选择：</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 0..7）。由软件写入，用于配置复用功能 I/O。AFSELy 选择：</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 0..7）。由软件写入，用于配置复用功能 I/O。AFSELy 选择：</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 0..7）。由软件写入，用于配置复用功能 I/O。AFSELy 选择：</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <displayName>AFRH</displayName>
          <description>GPIO 复用功能高位寄存器</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 8..15）。由软件写入，用于配置复用功能 I/O。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 8..15）。由软件写入，用于配置复用功能 I/O。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 8..15）。由软件写入，用于配置复用功能 I/O。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 8..15）。由软件写入，用于配置复用功能 I/O。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 8..15）。由软件写入，用于配置复用功能 I/O。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 8..15）。由软件写入，用于配置复用功能 I/O。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 8..15）。由软件写入，用于配置复用功能 I/O。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>[3:0]：端口 x 引脚 y 的复用功能选择（y = 8..15）。由软件写入，用于配置复用功能 I/O。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
