Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>MDMA_C0MAR</name>
          <displayName>MDMA_C0MAR</displayName>
          <description>MDMA 通道 x 掩码地址寄存器</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAR</name>
              <description>掩码地址</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C0MDR</name>
          <displayName>MDMA_C0MDR</displayName>
          <description>MDMA 通道 x 掩码数据寄存器</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDR</name>
              <description>掩码数据</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1ISR</name>
          <displayName>MDMA_C1ISR</displayName>
          <description>MDMA 通道 x 中断/状态寄存器</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEIF1</name>
              <description>通道 x 传输错误中断标志。此位由硬件置位。软件向 DMA_IFCRy 寄存器的对应位写 1 可将其清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF1</name>
              <description>通道 x 通道传输完成中断标志。此位由硬件置位。软件向 DMA_IFCRy 寄存器的对应位写 1 可将其清零。当最后一个块传输完成且通道已自动禁用时，CTC 置位。当通道因 EN 位写 0 而挂起时，CTC 同样置位。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRTIF1</name>
              <description>通道 x 块重复传输完成中断标志。此位由硬件置位。软件向 DMA_IFCRy 寄存器的对应位写 1 可将其清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTIF1</name>
              <description>通道 x 块传输完成中断标志。此位由硬件置位。软件向 DMA_IFCRy 寄存器的对应位写 1 可将其清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF1</name>
              <description>通道 x 缓冲区传输完成</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRQA1</name>
              <description>通道 x 请求活跃标志</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1IFCR</name>
          <displayName>MDMA_C1IFCR</displayName>
          <description>MDMA 通道 x 中断标志清除寄存器</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEIF1</name>
              <description>通道 x 清除传输错误中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 TEIFx 清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF1</name>
              <description>通道 x 清除通道传输完成中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 CTCIFx 清零。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBRTIF1</name>
              <description>通道 x 清除块重复传输完成中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 BRTIFx 清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBTIF1</name>
              <description>通道 x 清除块传输完成中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 BTIFx 清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLTCIF1</name>
              <description>通道 x 清除缓冲区传输完成中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 TCIFx 清零。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1ESR</name>
          <displayName>MDMA_C1ESR</displayName>
          <description>MDMA 通道 x 错误状态寄存器</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEA</name>
              <description>传输错误地址。在 MDMA 数据传输发生错误时，这些位由硬件置位与清零，与 TED 配合使用。该字段指示引发传输/访问错误的地址的低 7 位。软件可将其（截断至缓冲区传输长度大小）与当前 SAR/DAR 值相加来还原故障地址。注意：由于 FIFO 管理机制，SAR/DAR 当前值并不反映该最后地址。SAR/DAR 仅在（缓冲区）传完 TLEN+1 字节后才更新。注意：发生链接数据错误时此字段不会置位。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>TED</name>
              <description>传输错误方向。在 MDMA 数据传输发生错误时，此位由硬件置位与清零。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TELD</name>
              <description>传输错误（链接数据）。当读取块链接数据结构发生传输错误时，此位由硬件置位。软件向 DMA_IFCRy 寄存器中的 CTEIFx 位写 1 可将其清零。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMD</name>
              <description>传输错误（掩码数据）。当写入掩码数据发生传输错误时，此位由硬件置位。软件向 DMA_IFCRy 寄存器中的 CTEIFx 位写 1 可将其清零。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASE</name>
              <description>地址/大小错误。当编程地址与数据大小不对齐时，此位由硬件置位。TED 将指示问题在源端还是目的端。软件向 DMA_IFCRy 寄存器中的 CTEIFx 位写 1 可将其清零。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSE</name>
              <description>块大小错误。当块大小不是源端或目的端数据大小的整数倍时，此位由硬件置位。TED 将指示问题在源端还是目的端。软件向 DMA_IFCRy 寄存器中的 CTEIFx 位写 1 可将其清零。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1CR</name>
          <displayName>MDMA_C1CR</displayName>
          <description>此寄存器用于控制相应通道。</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>通道使能</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>传输错误中断使能。此位由软件置位与清零。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTCIE</name>
              <description>通道传输完成中断使能。此位由软件置位与清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRTIE</name>
              <description>块重复传输中断使能。此位由软件置位与清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIE</name>
              <description>块传输中断使能。此位由软件置位与清零。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>缓冲区传输完成中断使能。此位由软件置位与清零。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PL</name>
              <description>优先级。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BEX</name>
              <description>字节端序交换</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEX</name>
              <description>半字端序交换</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEX</name>
              <description>字端序交换</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRQ</name>
              <description>软件请求。向此位写 1 将使 MDMA_ISRy 寄存器中的 CRQAx 置位，从而激活通道 x 的请求。注意：可通过整个 CxCR 寄存器或地址偏移为 0x4E + 0x40*通道号的 8 位/16 位寄存器来激活 SWRQ。在软件请求的情况下，不会产生应答信号（无硬件信号，也不进行 CxMAR 写访问）。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1TCR</name>
          <displayName>MDMA_C1TCR</displayName>
          <description>此寄存器用于配置相应通道。</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SINC</name>
              <description>源地址增量模式。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。注意：当源端为 AHB 总线时（SBUS=1），禁止 SINC = 00。在链接列表模式下，在一个块（单次或重复块传输模式中的最后一个块）结束时，此寄存器将从存储器（地址由当前 LAR[31:0] + 0x00 给出）重新加载。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DINC</name>
              <description>目的地址增量模式。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。注意：当目的端为 AHB 总线时（DBUS=1），禁止 DINC = 00。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SSIZE</name>
              <description>源数据大小。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。注意：若为 TCM 访问/AHB 端口编程了 11 值，将发生传输错误（TEIF 位置位）。若 SINCOS &lt; SSIZE 且 SINC != 00，结果不可预测。注意：当源端为 TCM/AHB 总线时（SBUS=1），禁止 SSIZE = 11（双字）。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DSIZE</name>
              <description>目的数据大小。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。注意：若为 TCM 访问/AHB 端口编程了 11 值，将发生传输错误（TEIF 位置位）。若 DINCOS &lt; DSIZE 且 DINC != 00，结果不可预测。注意：当目的端为 TCM/AHB 总线时（DBUS=1），禁止 DSIZE = 11（双字）。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SINCOS</name>
              <description>源地址增量偏移大小</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DINCOS</name>
              <description>目的地址增量偏移</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SBURST</name>
              <description>源端突发传输配置</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBURST</name>
              <description>目的端突发传输配置</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TLEN</name>
              <description>缓冲区传输长度</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PKE</name>
              <description>打包使能。此位由软件置位与清零。若源数据大小小于目的数据大小，将按 PAM 值进行填充。若源数据大小大于目的数据大小，将被截断。对齐方式根据 PAM[0] 值确定。此位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAM</name>
              <description>填充/对齐模式。这些位由软件置位与清零。情况 1：源数据大小小于目的数据大小——3 种选项有效。情况 2：源数据大小大于目的数据大小——多余部分被丢弃。当 PKE = 1 或 DSIZE=SSIZE 时，这些位被忽略。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRGM</name>
              <description>触发模式。这些位由软件置位与清零。注意：若当前块的 TRGM 为 11，则通过链接列表机制在当前块结束时加载的所有值必须保持相同的 TRGM=11 值和相同的 SWRM 值，否则结果未定义。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SWRM</name>
              <description>软件请求模式。此位由软件置位与清零。若当前有硬件或软件请求处于活跃状态，此位的变更将延迟到当前传输完成之后。若 CxMAR 包含有效地址，CxMDR 的值也将写入 CxMAR 地址。此位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BWM</name>
              <description>缓冲写模式。此位由软件置位与清零。此位受保护，仅当 EN 为 0 时才可写入。注意：所有 MDMA 目的端访问均为不可缓存访问。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1BNDTR</name>
          <displayName>MDMA_C1BNDTR</displayName>
          <description>MDMA 通道 x 块数据传输数量寄存器</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BNDT</name>
              <description>待传输数据块数量</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
            <field>
              <name>BRSUM</name>
              <description>块重复源地址更新模式。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRDUM</name>
              <description>块重复目的地址更新模式。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRC</name>
              <description>块重复计数。此字段包含当前块的重复次数（0 到 4095）。通道使能后，此寄存器为只读，指示剩余块数（不含当前块）。每次完整块传输完成后此寄存器递减。最后一个块传输完成后，此寄存器可保持为零，或自动从存储器重新加载（在链接列表模式下——即链接地址有效时）。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1SAR</name>
          <displayName>MDMA_C1SAR</displayName>
          <description>MDMA 通道 x 源地址寄存器</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SAR</name>
              <description>源地址基址</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1DAR</name>
          <displayName>MDMA_C1DAR</displayName>
          <description>MDMA 通道 x 目的地址寄存器</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DAR</name>
              <description>目的地址基址</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1BRUR</name>
          <displayName>MDMA_C1BRUR</displayName>
          <description>MDMA 通道 x 块重复地址更新寄存器</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUV</name>
              <description>源地址更新值</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DUV</name>
              <description>目的地址更新值</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1LAR</name>
          <displayName>MDMA_C1LAR</displayName>
          <description>MDMA 通道 x 链接地址寄存器</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LAR</name>
              <description>链接地址寄存器</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1TBR</name>
          <displayName>MDMA_C1TBR</displayName>
          <description>MDMA 通道 x 触发与总线选择寄存器</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSEL</name>
              <description>触发选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SBUS</name>
              <description>源总线选择。此位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBUS</name>
              <description>目的总线选择。此位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1MAR</name>
          <displayName>MDMA_C1MAR</displayName>
          <description>MDMA 通道 x 掩码地址寄存器</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAR</name>
              <description>掩码地址</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C1MDR</name>
          <displayName>MDMA_C1MDR</displayName>
          <description>MDMA 通道 x 掩码数据寄存器</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDR</name>
              <description>掩码数据</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C2ISR</name>
          <displayName>MDMA_C2ISR</displayName>
          <description>MDMA 通道 x 中断/状态寄存器</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEIF2</name>
              <description>通道 x 传输错误中断标志。此位由硬件置位。软件向 DMA_IFCRy 寄存器的对应位写 1 可将其清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF2</name>
              <description>通道 x 通道传输完成中断标志。此位由硬件置位。软件向 DMA_IFCRy 寄存器的对应位写 1 可将其清零。当最后一个块传输完成且通道已自动禁用时，CTC 置位。当通道因 EN 位写 0 而挂起时，CTC 同样置位。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRTIF2</name>
              <description>通道 x 块重复传输完成中断标志。此位由硬件置位。软件向 DMA_IFCRy 寄存器的对应位写 1 可将其清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTIF2</name>
              <description>通道 x 块传输完成中断标志。此位由硬件置位。软件向 DMA_IFCRy 寄存器的对应位写 1 可将其清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF2</name>
              <description>通道 x 缓冲区传输完成</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRQA2</name>
              <description>通道 x 请求活跃标志</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C2IFCR</name>
          <displayName>MDMA_C2IFCR</displayName>
          <description>MDMA 通道 x 中断标志清除寄存器</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEIF2</name>
              <description>通道 x 清除传输错误中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 TEIFx 清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF2</name>
              <description>通道 x 清除通道传输完成中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 CTCIFx 清零。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBRTIF2</name>
              <description>通道 x 清除块重复传输完成中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 BRTIFx 清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBTIF2</name>
              <description>通道 x 清除块传输完成中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 BTIFx 清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLTCIF2</name>
              <description>通道 x 清除缓冲区传输完成中断标志。向此位写 1 可将 MDMA_ISRy 寄存器中的 TCIFx 清零。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
