Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>MDMA_C15CR</name>
          <displayName>MDMA_C15CR</displayName>
          <description>此寄存器用于控制相应通道。</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>通道使能</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>传输错误中断使能。此位由软件置位与清零。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTCIE</name>
              <description>通道传输完成中断使能。此位由软件置位与清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRTIE</name>
              <description>块重复传输中断使能。此位由软件置位与清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIE</name>
              <description>块传输中断使能。此位由软件置位与清零。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>缓冲区传输完成中断使能。此位由软件置位与清零。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PL</name>
              <description>优先级。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BEX</name>
              <description>字节端序交换</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEX</name>
              <description>半字端序交换</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEX</name>
              <description>字端序交换</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRQ</name>
              <description>软件请求。向此位写 1 将使 MDMA_ISRy 寄存器中的 CRQAx 置位，从而激活通道 x 的请求。注意：可通过整个 CxCR 寄存器或地址偏移为 0x4E + 0x40*通道号的 8 位/16 位寄存器来激活 SWRQ。在软件请求的情况下，不会产生应答信号（无硬件信号，也不进行 CxMAR 写访问）。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15TCR</name>
          <displayName>MDMA_C15TCR</displayName>
          <description>此寄存器用于配置相应通道。</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SINC</name>
              <description>源地址增量模式。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。注意：当源端为 AHB 总线时（SBUS=1），禁止 SINC = 00。在链接列表模式下，在一个块（单次或重复块传输模式中的最后一个块）结束时，此寄存器将从存储器（地址由当前 LAR[31:0] + 0x00 给出）重新加载。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DINC</name>
              <description>目的地址增量模式。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。注意：当目的端为 AHB 总线时（DBUS=1），禁止 DINC = 00。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SSIZE</name>
              <description>源数据大小。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。注意：若为 TCM 访问/AHB 端口编程了 11 值，将发生传输错误（TEIF 位置位）。若 SINCOS &lt; SSIZE 且 SINC != 00，结果不可预测。注意：当源端为 TCM/AHB 总线时（SBUS=1），禁止 SSIZE = 11（双字）。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DSIZE</name>
              <description>目的数据大小。这些位由软件置位与清零。这些位受保护，仅当 EN 为 0 时才可写入。注意：若为 TCM 访问/AHB 端口编程了 11 值，将发生传输错误（TEIF 位置位）。若 DINCOS &lt; DSIZE 且 DINC != 00，结果不可预测。注意：当目的端为 TCM/AHB 总线时（DBUS=1），禁止 DSIZE = 11（双字）。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SINCOS</name>
              <description>源地址增量偏移大小</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DINCOS</name>
              <description>目的地址增量偏移</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SBURST</name>
              <description>源端突发传输配置</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBURST</name>
              <description>目的端突发传输配置</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TLEN</name>
              <description>缓冲区传输长度</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PKE</name>
              <description>打包使能。此位由软件置位与清零。若源数据大小小于目的数据大小，将按 PAM 值进行填充。若源数据大小大于目的数据大小，将被截断。对齐方式根据 PAM[0] 值确定。此位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAM</name>
              <description>填充/对齐模式。这些位由软件置位与清零。情况 1：源数据大小小于目的数据大小——3 种选项有效。情况 2：源数据大小大于目的数据大小——多余部分被丢弃。当 PKE = 1 或 DSIZE=SSIZE 时，这些位被忽略。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRGM</name>
              <description>触发模式。这些位由软件置位与清零。注意：若当前块的 TRGM 为 11，则通过链接列表机制在当前块结束时加载的所有值必须保持相同的 TRGM=11 值和相同的 SWRM 值，否则结果未定义。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SWRM</name>
              <description>软件请求模式。此位由软件置位与清零。若当前有硬件或软件请求处于活跃状态，此位的变更将延迟到当前传输完成之后。若 CxMAR 包含有效地址，CxMDR 的值也将写入 CxMAR 地址。此位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BWM</name>
              <description>缓冲写模式。此位由软件置位与清零。此位受保护，仅当 EN 为 0 时才可写入。注意：所有 MDMA 目的端访问均为不可缓存访问。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15BNDTR</name>
          <displayName>MDMA_C15BNDTR</displayName>
          <description>MDMA 通道 x 块数据传输数量寄存器</description>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BNDT</name>
              <description>待传输数据块数量</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
            <field>
              <name>BRSUM</name>
              <description>块重复源地址更新模式。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRDUM</name>
              <description>块重复目的地址更新模式。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRC</name>
              <description>块重复计数。此字段包含当前块的重复次数（0 到 4095）。通道使能后，此寄存器为只读，指示剩余块数（不含当前块）。每次完整块传输完成后此寄存器递减。最后一个块传输完成后，此寄存器可保持为零，或自动从存储器重新加载（在链接列表模式下——即链接地址有效时）。这些位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15SAR</name>
          <displayName>MDMA_C15SAR</displayName>
          <description>MDMA 通道 x 源地址寄存器</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SAR</name>
              <description>源地址基址</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15DAR</name>
          <displayName>MDMA_C15DAR</displayName>
          <description>MDMA 通道 x 目的地址寄存器</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DAR</name>
              <description>目的地址基址</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15BRUR</name>
          <displayName>MDMA_C15BRUR</displayName>
          <description>MDMA 通道 x 块重复地址更新寄存器</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUV</name>
              <description>源地址更新值</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DUV</name>
              <description>目的地址更新值</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15LAR</name>
          <displayName>MDMA_C15LAR</displayName>
          <description>MDMA 通道 x 链接地址寄存器</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LAR</name>
              <description>链接地址寄存器</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15TBR</name>
          <displayName>MDMA_C15TBR</displayName>
          <description>MDMA 通道 x 触发与总线选择寄存器</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSEL</name>
              <description>触发选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SBUS</name>
              <description>源总线选择。此位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBUS</name>
              <description>目的总线选择。此位受保护，仅当 EN 为 0 时才可写入。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15MAR</name>
          <displayName>MDMA_C15MAR</displayName>
          <description>MDMA 通道 x 掩码地址寄存器</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAR</name>
              <description>掩码地址</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C15MDR</name>
          <displayName>MDMA_C15MDR</displayName>
          <description>MDMA 通道 x 掩码数据寄存器</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDR</name>
              <description>掩码数据</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
