Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>QUADSPI</name>
      <description>QUADSPI</description>
      <groupName>QUADSPI</groupName>
      <baseAddress>0x52005000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>QUADSPI</name>
        <description>QuadSPI 全局中断</description>
        <value>92</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>QUADSPI 控制寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>使能 使能 QUADSPI。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <description>中止请求 该位中止正在进行的命令序列。中止完成后自动复位。该位会停止当前传输。在轮询模式或存储器映射模式下，该位还会复位 APM 位或 DM 位。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA 使能 在间接模式下，可通过 QUADSPI_DR 寄存器使用 DMA 输入或输出数据。当 FIFO 阈值标志 FTF 置位时，将启动 DMA 传输。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEN</name>
              <description>超时计数器使能 该位仅在选择了存储器映射模式（FMODE = 11）时有效。激活该位后，如果在指定时间内没有发生访问，片选信号（nCS）将被释放（从而降低功耗），该时间由 TIMEOUT[15:0]（QUADSPI_LPTR）定义。使能超时计数器。默认情况下，QUADSPI 不会停止其预取操作，即使长时间没有对 Flash 存储器的访问，仍会保持上一次读操作有效，nCS 维持低电平。由于 Flash 存储器在 nCS 保持低电平时功耗较高，应用程序可能需要激活超时计数器（TCEN = 1，QUADSPI_CR[3]），以便在 FIFO 被预取数据填满后，若在 TIMEOUT[15:0]（QUADSPI_LPTR）个周期内没有发生访问，则释放 nCS。该位只能在 BUSY = 0 时修改。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSHIFT</name>
              <description>采样偏移 默认情况下，QUADSPI 在 Flash 存储器驱动数据后的 1/2 个 CLK 周期处采样数据。该位允许延迟采样数据，以补偿外部信号延迟。固件必须确保在 DDR 模式下（DDRM = 1）SSHIFT = 0。该字段只能在 BUSY = 0 时修改。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFM</name>
              <description>双 Flash 模式 该位激活双 Flash 模式，即同时使用两个外部 Flash 存储器，使吞吐量和容量翻倍。该位只能在 BUSY = 0 时修改。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSEL</name>
              <description>Flash 存储器选择 该位在单 Flash 模式（DFM = 0）下选择要寻址的 Flash 存储器。该位只能在 BUSY = 0 时修改。当 DFM = 1 时该位被忽略。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTHRES</name>
              <description>FIFO 阈值级别 在间接模式下，定义 FIFO 中触发 FIFO 阈值标志（FTF，QUADSPI_SR[2]）置位的字节阈值数。在间接写模式（FMODE = 00）下：...... 在间接读模式（FMODE = 01）下：...... 如果 DMAEN = 1，则在更改 FTHRES 值之前必须先禁用相应通道的 DMA 控制器。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>传输错误中断使能 该位使能传输错误中断。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>传输完成中断使能 该位使能传输完成中断。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTIE</name>
              <description>FIFO 阈值中断使能 该位使能 FIFO 阈值中断。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMIE</name>
              <description>状态匹配中断使能 该位使能状态匹配中断。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOIE</name>
              <description>超时中断使能 该位使能超时中断。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APMS</name>
              <description>自动轮询模式停止 该位决定匹配后是否停止自动轮询。该位只能在 BUSY = 0 时修改。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMM</name>
              <description>轮询匹配模式 该位指示在自动轮询模式期间用于确定匹配的方法。该位只能在 BUSY = 0 时修改。</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>时钟预分频器</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <displayName>DCR</displayName>
          <description>QUADSPI 器件配置寄存器</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKMODE</name>
              <description>指示 CLK 在命令之间所处的电平</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSHT</name>
              <description>片选高电平时间 CSHT + 1 定义了向 Flash 存储器发出的命令之间，片选信号（nCS）必须保持高电平的最小 CLK 周期数。...... 该字段只能在 BUSY = 0 时修改。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FSIZE</name>
              <description>Flash 存储器容量 该字段使用以下公式定义外部存储器的容量：Flash 存储器的字节数 = 2[FSIZE+1]。FSIZE + 1 实际上是寻址 Flash 存储器所需的地址位数。在间接模式下，Flash 存储器容量最大可达 4GB（使用 32 位寻址），但在存储器映射模式下，可寻址空间限制为 256MB。如果 DFM = 1，FSIZE 表示两个 Flash 存储器的总容量。该字段只能在 BUSY = 0 时修改。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>QUADSPI 状态寄存器</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEF</name>
              <description>传输错误标志 在间接模式下，当访问了无效地址时该位置位。向 CTEF 写入 1 可将其清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCF</name>
              <description>传输完成标志 在间接模式下，当已传输完编程数量的数据时该位置位；或在任何模式下，当传输被中止时该位置位。向 CTCF 写入 1 可将其清零。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTF</name>
              <description>FIFO 阈值标志 在间接模式下，当达到 FIFO 阈值时，或当 Flash 存储器读取完成后 FIFO 中仍有数据时，该位置位。一旦阈值条件不再满足，该位自动清零。在自动轮询模式下，每次读取状态寄存器时该位置位，读取数据寄存器时该位清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMF</name>
              <description>状态匹配标志 在自动轮询模式下，当未掩码的接收数据与匹配寄存器（QUADSPI_PSMAR）中的对应位匹配时，该位置位。向 CSMF 写入 1 可将其清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>超时标志 发生超时时该位置位。向 CTOF 写入 1 可将其清零。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>忙标志 当操作正在进行时该位置位。当 Flash 存储器操作完成且 FIFO 为空时，该位自动清零。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEVEL</name>
              <description>FIFO 级别 该字段给出 FIFO 中当前保存的有效字节数。FIFO 为空时 FLEVEL = 0，满时为 16。在存储器映射模式和自动状态轮询模式下，FLEVEL 为零。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <displayName>FCR</displayName>
          <description>QUADSPI 标志清零寄存器</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEF</name>
              <description>清除传输错误标志 写入 1 将清零 QUADSPI_SR 寄存器中的 TEF 标志。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCF</name>
              <description>清除传输完成标志 写入 1 将清零 QUADSPI_SR 寄存器中的 TCF 标志。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSMF</name>
              <description>清除状态匹配标志 写入 1 将清零 QUADSPI_SR 寄存器中的 SMF 标志。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTOF</name>
              <description>清除超时标志 写入 1 将清零 QUADSPI_SR 寄存器中的 TOF 标志。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DLR</name>
          <displayName>DLR</displayName>
          <description>QUADSPI 数据长度寄存器</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DL</name>
              <description>数据长度 在间接模式和状态轮询模式下要获取的数据数量（值 + 1）。状态轮询模式下应使用不大于 3（表示 4 字节）的值。间接模式下的全 1 值表示未定义长度，此时 QUADSPI 将持续传输直到存储器末尾（由 FSIZE 定义）。0x0000_0000：传输 1 字节；0x0000_0001：传输 2 字节；0x0000_0002：传输 3 字节；0x0000_0003：传输 4 字节；......；0xFFFF_FFFD：传输 4,294,967,294（4G-2）字节；0xFFFF_FFFE：传输 4,294,967,295（4G-1）字节；0xFFFF_FFFF：未定义长度——传输所有字节直到 Flash 存储器末尾（由 FSIZE 定义）。如果 FSIZE = 0x1F，则无限继续读取。在双 Flash 模式（DFM = 1）下，即使向 DL[0] 写入 0，该位也会被强制置 1，从而确保每次访问传输偶数个字节。在存储器映射模式（FMODE = 10）下，该字段无效。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>QUADSPI 通信配置寄存器</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSTRUCTION</name>
              <description>指令 要发送到外部 SPI 器件的指令。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IMODE</name>
              <description>指令模式 该字段定义指令阶段的操作模式：该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADMODE</name>
              <description>地址模式 该字段定义地址阶段的操作模式：该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADSIZE</name>
              <description>地址大小 该位定义地址大小：该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ABMODE</name>
              <description>交替字节模式 该字段定义交替字节阶段的操作模式：该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ABSIZE</name>
              <description>交替字节大小 该位定义交替字节大小：该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCYC</name>
              <description>空周期数 该字段定义空周期阶段的持续时间。在 SDR 和 DDR 两种模式下，它指定 CLK 周期数（0-31）。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DMODE</name>
              <description>数据模式 该字段定义数据阶段的操作模式：该字段同时也决定了空周期阶段的操作模式。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FMODE</name>
              <description>功能模式 该字段定义 QUADSPI 的功能操作模式。如果 DMAEN 已为 1，则在更改 FMODE 值之前必须先禁用相应通道的 DMA 控制器。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SIOO</name>
              <description>仅发送指令一次模式 参见第 15.3.11 节：仅发送指令一次（第 13 页）。当 IMODE = 00 时该位无效。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DHHC</name>
              <description>DDR 保持 在 DDR 模式下，将数据输出延迟 QUADSPI 输出时钟周期的 1/4：此功能仅在 DDR 模式下有效。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDRM</name>
              <description>双倍数据速率模式 该位为地址阶段、交替字节阶段和数据阶段设置 DDR 模式：该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AR</name>
          <displayName>AR</displayName>
          <description>QUADSPI 地址寄存器</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>[31:0]：地址 要发送到外部 Flash 存储器的地址。当 BUSY = 0 或 FMODE = 11（存储器映射模式）时，对该字段的写入将被忽略。在双 Flash 模式下，ADDRESS[0] 自动强制为 0，因为地址应始终为偶数。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ABR</name>
          <displayName>ABR</displayName>
          <description>QUADSPI 交替字节寄存器</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALTERNATE</name>
              <description>交替字节 紧接地址之后发送到外部 SPI 器件的可选数据。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>QUADSPI 数据寄存器</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>数据 要发送到外部 SPI 器件或从外部 SPI 器件接收的数据。在间接写模式下，写入该寄存器的数据先存储在 FIFO 中，然后在数据阶段发送到 Flash 存储器。若 FIFO 过满，写操作将暂停，直到 FIFO 有足够空间容纳正在写入的数据量。在间接读模式下，读取该寄存器将（通过 FIFO）获取从 Flash 存储器接收的数据。若 FIFO 中没有读取操作所请求的字节数且 BUSY = 1，则读操作将暂停，直到有足够的数据或传输完成（以先发生者为准）。在自动轮询模式下，该寄存器包含从 Flash 存储器读取的最后数据（未掩码）。支持对该寄存器进行字、半字和字节访问。在间接写模式下，字节写入向 FIFO 添加 1 个字节，半字写入添加 2 个字节，字写入添加 4 个字节。类似地，在间接读模式下，字节读取从 FIFO 移除 1 个字节，半字读取移除 2 个字节，字读取移除 4 个字节。间接模式下的访问必须与该寄存器的低位对齐：字节读取必须读取 DATA[7:0]，半字读取必须读取 DATA[15:0]。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSMKR</name>
          <displayName>PSMKR</displayName>
          <description>QUADSPI 轮询状态掩码寄存器</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>状态掩码 在轮询模式下，对接收到的状态字节应用的掩码。对于位 n：该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSMAR</name>
          <displayName>PSMAR</displayName>
          <description>QUADSPI 轮询状态匹配寄存器</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MATCH</name>
              <description>状态匹配值 用于与掩码后的状态寄存器进行比较以获取匹配的值。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PIR</name>
          <displayName>PIR</displayName>
          <description>QUADSPI 轮询间隔寄存器</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>轮询间隔 自动轮询阶段期间两次读取之间的 CLK 周期数。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPTR</name>
          <displayName>LPTR</displayName>
          <description>QUADSPI 低功耗超时寄存器</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>超时周期 在存储器映射模式下，每次访问后，QUADSPI 会预取后续字节并将其保存在 FIFO 中。该字段指示 FIFO 填满后，QUADSPI 等待多少个 CLK 周期才将 nCS 拉高，使 Flash 存储器进入低功耗状态。该字段只能在 BUSY = 0 时写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
