Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SAI4</name>
      <description>串行音频接口</description>
      <groupName>SAI</groupName>
      <baseAddress>0x58005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SAI4</name>
        <description>SAI4 全局中断</description>
        <value>146</value>
      </interrupt>
      <registers>
        <register>
          <name>SAI_GCR</name>
          <displayName>SAI_GCR</displayName>
          <description>全局配置寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCOUT</name>
              <description>同步输出。这些位由软件置位或清零。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCIN</name>
              <description>同步输入</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_ACR1</name>
          <displayName>SAI_ACR1</displayName>
          <description>配置寄存器 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>SAIx 音频模块模式</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRTCFG</name>
              <description>协议配置。这些位由软件置位或清零。须在音频模块禁用时进行配置。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DS</name>
              <description>数据位宽。这些位由软件置位或清零。当选择 SPDIF 协议时（PRTCFG[1:0] 位），由于帧长和数据位宽在此模式下是固定的，这些位将被忽略。当通过 COMP[1:0] 位选择压扩模式时，DS[1:0] 也将被忽略，因为算法已将数据位宽固定为 8 位。须在音频模块禁用时进行配置。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>最低有效位优先。该位由软件置位或清零。须在音频模块禁用时进行配置。该位在 AC97 音频协议中无意义，因为 AC97 数据始终以 MSB 优先传输。该位在 SPDIF 音频协议中也无意义，因为 SPDIF 数据始终以 LSB 优先传输。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKSTR</name>
              <description>时钟选通边沿。该位由软件置位或清零。须在音频模块禁用时进行配置。该位在 SPDIF 音频协议中无意义。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>同步使能。这些位由软件置位或清零。须在音频子模块禁用时进行配置。注意：当 SPDIF 模式使能时，音频子模块应配置为异步模式。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MONO</name>
              <description>单声道模式。该位由软件置位或清零。仅当时隙数量等于 2 时有效。当选择单声道模式时，若音频模块作为发送器工作，时隙 0 的数据将复制到时隙 1。在接收模式下，时隙 1 被丢弃，仅存储从时隙 0 接收到的数据。更多细节请参考章节：单声道/立体声模式。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTDRIV</name>
              <description>输出驱动。该位由软件置位或清零。注意：该位须在使能音频模块之前、完成音频模块配置之后置位。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAIXEN</name>
              <description>音频模块使能（x 为 A 或 B）。该位由软件置位。若要关闭音频模块，应用软件须将此位写为 0 并轮询该位直至回读为 0，表示模块已完全禁用。在将此位置 1 之前，请确认其为 0，否则使能命令不会被响应。该位用于控制 SAIx 音频模块的状态。若在音频帧传输进行中将其禁用，则正在进行的传输将完成，并在该音频帧传输结束后完全禁用该单元。注意：当 SAIx 模块配置为主模式时，须在 SAIXEN 位置位之前确保 SAIx 输入端已有时钟信号。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA 使能。该位由软件置位或清零。注意：由于复位后音频模块默认作为发送器工作，因此在置位 DMAEN 之前须先配置 MODE[1:0] 位，以避免在接收模式下产生 DMA 请求。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOMCK</name>
              <description>无分频器</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKDIV</name>
              <description>主时钟分频器。这些位由软件置位或清零。当音频模块工作在从模式时，这些位无意义。须在音频模块禁用时进行配置。其他：主时钟频率按以下公式计算：</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>OSR</name>
              <description>主时钟过采样比</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_ACR2</name>
          <displayName>SAI_ACR2</displayName>
          <description>配置寄存器 2</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTH</name>
              <description>FIFO 阈值。该位由软件置位或清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFLUSH</name>
              <description>FIFO 刷新。该位由软件置位。读取时始终返回 0。该位应在 SAI 禁用时配置。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TRIS</name>
              <description>数据线三态管理。该位由软件置位或清零。仅当音频模块配置为发送器时有效。当音频模块配置为 SPDIF 模式时不使用该位。应在 SAI 禁用时配置。更多细节请参考章节：非活跃时隙的输出数据线管理。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUTE</name>
              <description>静音。该位由软件置位或清零。仅当音频模块作为发送器工作时有效。若时隙数量小于或等于 2，MUTE 的值与 MUTEVAL 的值关联；若时隙数量大于 2，则等于 0。更多细节请参考章节：静音模式。注意：该位对 SPDIF 音频模块无意义，不应使用。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUTEVAL</name>
              <description>静音值。该位由软件置位或清零。须在使能音频模块（SAIXEN）之前写入。仅当音频模块作为发送器工作、时隙数量小于或等于 2 且 MUTE 位置位时有效。若声明了更多时隙，在静音模式下发送的位值始终为 0，无论 MUTEVAL 的值如何。若时隙数量小于或等于 2 且 MUTEVAL = 1，则每个时隙发送的静音值为前一帧中对应时隙的值。更多细节请参考章节：静音模式。注意：该位对 SPDIF 音频模块无意义，不应使用。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUTECNT</name>
              <description>静音计数器。这些位由软件置位或清零。仅在接收模式下使用。这些位中设置的值用于与接收中检测到的连续静音帧数量进行比较。当静音帧数量等于此值时，标志位 MUTEDET 将置位，若 MUTEDETIE 位已使能则会产生中断。更多细节请参考章节：静音模式。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPL</name>
              <description>补码位。该位由软件置位或清零。用于定义压扩模式中所使用的补码类型。注意：该位仅在压扩模式为 μ-Law 算法或 A-Law 算法时有效。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>压扩模式。这些位由软件置位或清零。μ-Law 和 A-Law 对数压扩是 CCITT G.711 建议的一部分，所使用的补码类型取决于 CPL 位。数据扩展或数据压缩由 MODE[0] 位的状态决定。若音频模块配置为发送器，则进行数据压缩。若音频模块配置为接收器，则自动进行数据扩展。更多细节请参考章节：压扩模式。注意：压扩模式仅在选择 TDM 时适用。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_AFRCR</name>
          <displayName>SAI_AFRCR</displayName>
          <description>该寄存器在 AC97 和 SPDIF 音频协议中无意义</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>FRL</name>
              <description>帧长。这些位由软件置位或清零。用于定义以 SCK 时钟周期数表示的音频帧长度：帧中的位数等于 FRL[7:0] + 1。音频帧中传输的最小位数必须为 8，否则音频模块将出现异常行为。例如，当数据位宽为 8 位且在 SAI_xSLOTR 寄存器中仅定义了一个时隙 0（NBSLOT[3:0] = 0000）时，就属于最小位数不足的情况。在主模式下，若使用了主时钟（可通过 MCLK_x 引脚获取），帧长应对齐到一个 2 的幂次数，范围为 8 到 256。当不使用主时钟时（NODIV = 1），建议将帧长配置为 8 到 256 之间的值。这些位在 AC97 或 SPDIF 音频模块配置中无意义且不被使用。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSALL</name>
              <description>帧同步有效电平长度。这些位由软件置位或清零。用于指定 FS 信号在音频帧中有效电平的位时钟（SCK）周期数 + 1（FSALL[6:0] + 1）。这些位在 AC97 或 SPDIF 音频模块配置中无意义且不被使用。须在音频模块禁用时进行配置。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSDEF</name>
              <description>帧同步定义。该位由软件置位或清零。当该位置位时，SAI_xSLOTR 寄存器中定义的时隙数量必须为偶数。这意味着其中一半时隙将分配给左声道，另一半分配给右声道（例如：对于 I2S 或 MSB/LSB 对齐协议，此位须置位）。该位在 AC97 或 SPDIF 音频模块配置中无意义且不被使用。须在音频模块禁用时进行配置。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSPOL</name>
              <description>帧同步极性。该位由软件置位或清零。用于配置 FS 信号上帧起始的电平。该位在 AC97 或 SPDIF 音频模块配置中无意义且不被使用。须在音频模块禁用时进行配置。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSOFF</name>
              <description>帧同步偏移。该位由软件置位或清零。该位在 AC97 或 SPDIF 音频模块配置中无意义且不被使用。须在音频模块禁用时进行配置。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_ASLOTR</name>
          <displayName>SAI_ASLOTR</displayName>
          <description>该寄存器在 AC97 和 SPDIF 音频协议中无意义</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FBOFF</name>
              <description>首比特偏移。这些位由软件置位或清零。该位域的值定义了时隙中第一个数据传输位的位置，表示一个偏移量。在发送模式下，数据字段之外的位被强制置为 0。在接收模式下，多余的接收位将被丢弃。须在音频模块禁用时设置这些位。在 AC97 或 SPDIF 模式下将被忽略。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SLOTSZ</name>
              <description>时隙大小。这些位由软件置位或清零。时隙大小必须大于或等于数据位宽。若不满足此条件，SAI 的行为将是不确定的。有关如何驱动 SD 线的信息，请参考章节：非活跃时隙的输出数据线管理。须在音频模块禁用时设置这些位。在 AC97 或 SPDIF 模式下将被忽略。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBSLOT</name>
              <description>音频帧中的时隙数。这些位由软件置位或清零。该位域的值表示音频帧中的时隙数 + 1（包括非活跃时隙）。最大时隙数为 16。若 SAI_xFRCR 寄存器中的 FSDEF 位置位，时隙数应为偶数。须在音频模块禁用时配置时隙数。在 AC97 或 SPDIF 模式下将被忽略。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SLOTEN</name>
              <description>时隙使能。这些位由软件置位或清零。每个 SLOTEN 位对应一个时隙位置，从 0 到 15（最多 16 个时隙）。须在音频模块禁用时使能时隙。在 AC97 或 SPDIF 模式下将被忽略。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_AIM</name>
          <displayName>SAI_AIM</displayName>
          <description>中断屏蔽寄存器 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRUDRIE</name>
              <description>溢出/欠载中断使能。该位由软件置位或清零。当该位置位时，若 SAI_xSR 寄存器中的 OVRUDR 位置位，则产生中断。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUTEDETIE</name>
              <description>静音检测中断使能。该位由软件置位或清零。当该位置位时，若 SAI_xSR 寄存器中的 MUTEDET 位置位，则产生中断。该位仅在音频模块配置为接收模式时有效。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WCKCFGIE</name>
              <description>时钟配置错误中断使能。该位由软件置位或清零。仅在音频模块配置为主模式（MODE[1] = 0）且 NODIV = 0 时才被响应。若 SAI_xSR 寄存器中的 WCKCFG 标志位置位，则产生中断。注意：该位仅在 TDM 模式下使用，在其他模式下无意义。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQIE</name>
              <description>FIFO 请求中断使能。该位由软件置位或清零。当该位置位时，若 SAI_xSR 寄存器中的 FREQ 位置位，则产生中断。由于复位后音频模块默认作为发送器工作，因此在置位 FREQIE 之前须先配置 MODE 位，以避免在接收模式下产生误中断。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNRDYIE</name>
              <description>编解码器未就绪中断使能（AC97）。该位由软件置位或清零。当中断使能时，音频模块在 AC97 帧的时隙 0（tag0）中检测连接到该线路的编解码器是否就绪。若未就绪，SAI_xSR 寄存器中的 CNRDY 标志位将置位并产生中断。该位仅当通过 PRTCFG[1:0] 位选择 AC97 模式且音频模块作为接收器工作时有效。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AFSDETIE</name>
              <description>帧同步提前检测中断使能。该位由软件置位或清零。当该位置位时，若 SAI_xSR 寄存器中的 AFSDET 位置位，则产生中断。该位在 AC97、SPDIF 模式或音频模块作为主模式工作时无意义。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFSDETIE</name>
              <description>帧同步滞后检测中断使能。该位由软件置位或清零。当该位置位时，若 SAI_xSR 寄存器中的 LFSDET 位置位，则产生中断。该位在 AC97、SPDIF 模式或音频模块作为主模式工作时无意义。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_ASR</name>
          <displayName>SAI_ASR</displayName>
          <description>状态寄存器</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>OVRUDR</name>
              <description>溢出/欠载。该位为只读。溢出和欠载状态分别仅在音频模块配置为接收器和发送器时才会发生。若 SAI_xIM 寄存器中的 OVRUDRIE 位置位，可产生中断。当软件将 SAI_xCLRFR 寄存器中的 COVRUDR 位置位时，该标志位被清除。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUTEDET</name>
              <description>静音检测。该位为只读。若在给定音频帧的每个时隙中连续接收到 0 值，且持续了连续的音频帧数（由 SAI_xCR2 寄存器中的 MUTECNT 位设置），则该标志位置位。若 SAI_xIM 寄存器中的 MUTEDETIE 位置位，可产生中断。当软件将 SAI_xCLRFR 寄存器中的 CMUTEDET 位置位时，该标志位被清除。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WCKCFG</name>
              <description>时钟配置错误标志位。该位为只读。仅在音频模块工作于主模式（MODE[1] = 0）且 NODIV = 0 时使用。若 SAI_xIM 寄存器中的 WCKCFGIE 位置位，可产生中断。当软件将 SAI_xCLRFR 寄存器中的 CWCKCFG 位置位时，该标志位被清除。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQ</name>
              <description>FIFO 请求。该位为只读。请求取决于音频模块的配置：若模块配置为发送模式，FIFO 请求关联到对 SAI_xDR 的写请求操作。若模块配置为接收模式，FIFO 请求关联到从 SAI_xDR 的读请求操作。若 SAI_xIM 寄存器中的 FREQIE 位置位，该标志位可产生中断。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNRDY</name>
              <description>编解码器未就绪。该位为只读。仅在 SAI_xCR1 寄存器中选择了 AC97 音频协议且配置为接收模式时使用。若 SAI_xIM 寄存器中的 CNRDYIE 位置位，可产生中断。当软件将 SAI_xCLRFR 寄存器中的 CCNRDY 位置位时，该标志位被清除。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AFSDET</name>
              <description>帧同步提前检测。该位为只读。仅在音频模块配置为从模式时该标志位才可置位。在 AC97 或 SPDIF 模式下不使用。若 SAI_xIM 寄存器中的 AFSDETIE 位置位，可产生中断。当软件将 SAI_xCLRFR 寄存器中的 CAFSDET 位置位时，该标志位被清除。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFSDET</name>
              <description>帧同步滞后检测。该位为只读。仅在音频模块配置为从模式时该标志位才可置位。在 AC97 或 SPDIF 模式下不使用。若 SAI_xIM 寄存器中的 LFSDETIE 位置位，可产生中断。当软件将 SAI_xCLRFR 寄存器中的 CLFSDET 位置位时，该标志位被清除。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLVL</name>
              <description>FIFO 电平阈值。该位为只读。FIFO 电平阈值标志位仅由硬件管理，其设置取决于 SAI 模块的配置（发送或接收模式）。若 SAI 模块配置为发送器：若 SAI 模块配置为接收器：</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_ACLRFR</name>
          <displayName>SAI_ACLRFR</displayName>
          <description>清除标志寄存器</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COVRUDR</name>
              <description>清除溢出/欠载标志。该位为只写。将此位写 1 可清除 SAI_xSR 寄存器中的 OVRUDR 标志位。读取该位始终返回 0。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMUTEDET</name>
              <description>清除静音检测标志。该位为只写。将此位写 1 可清除 SAI_xSR 寄存器中的 MUTEDET 标志位。读取该位始终返回 0。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWCKCFG</name>
              <description>清除时钟配置错误标志。该位为只写。将此位写 1 可清除 SAI_xSR 寄存器中的 WCKCFG 标志位。仅在音频模块设置为主模式（MODE[1] = 0）且 SAI_xCR1 寄存器中 NODIV = 0 时使用。读取该位始终返回 0。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCNRDY</name>
              <description>清除编解码器未就绪标志。该位为只写。将此位写 1 可清除 SAI_xSR 寄存器中的 CNRDY 标志位。仅在 SAI_xCR1 寄存器中选择了 AC97 音频协议时使用。读取该位始终返回 0。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAFSDET</name>
              <description>清除帧同步提前检测标志。该位为只写。将此位写 1 可清除 SAI_xSR 寄存器中的 AFSDET 标志位。在 AC97 或 SPDIF 模式下不使用。读取该位始终返回 0。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLFSDET</name>
              <description>清除帧同步滞后检测标志。该位为只写。将此位写 1 可清除 SAI_xSR 寄存器中的 LFSDET 标志位。在 AC97 或 SPDIF 模式下不使用。读取该位始终返回 0。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_ADR</name>
          <displayName>SAI_ADR</displayName>
          <description>数据寄存器</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>数据。向该寄存器写入数据时，若 FIFO 未满，则将数据加载到 FIFO 中。从该寄存器读取数据时，若 FIFO 非空，则清空 FIFO 中的一项。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BCR1</name>
          <displayName>SAI_BCR1</displayName>
          <description>配置寄存器 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>SAIx 音频模块模式</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRTCFG</name>
              <description>协议配置。这些位由软件置位或清零。须在音频模块禁用时进行配置。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DS</name>
              <description>数据位宽。这些位由软件置位或清零。当选择 SPDIF 协议时（PRTCFG[1:0] 位），由于帧长和数据位宽在此模式下是固定的，这些位将被忽略。当通过 COMP[1:0] 位选择压扩模式时，DS[1:0] 也将被忽略，因为算法已将数据位宽固定为 8 位。须在音频模块禁用时进行配置。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>最低有效位优先。该位由软件置位或清零。须在音频模块禁用时进行配置。该位在 AC97 音频协议中无意义，因为 AC97 数据始终以 MSB 优先传输。该位在 SPDIF 音频协议中也无意义，因为 SPDIF 数据始终以 LSB 优先传输。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKSTR</name>
              <description>时钟选通边沿。该位由软件置位或清零。须在音频模块禁用时进行配置。该位在 SPDIF 音频协议中无意义。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>同步使能。这些位由软件置位或清零。须在音频子模块禁用时进行配置。注意：当 SPDIF 模式使能时，音频子模块应配置为异步模式。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MONO</name>
              <description>单声道模式。该位由软件置位或清零。仅当时隙数量等于 2 时有效。当选择单声道模式时，若音频模块作为发送器工作，时隙 0 的数据将复制到时隙 1。在接收模式下，时隙 1 被丢弃，仅存储从时隙 0 接收到的数据。更多细节请参考章节：单声道/立体声模式。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTDRIV</name>
              <description>输出驱动。该位由软件置位或清零。注意：该位须在使能音频模块之前、完成音频模块配置之后置位。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAIXEN</name>
              <description>音频模块使能（x 为 A 或 B）。该位由软件置位。若要关闭音频模块，应用软件须将此位写为 0 并轮询该位直至回读为 0，表示模块已完全禁用。在将此位置 1 之前，请确认其为 0，否则使能命令不会被响应。该位用于控制 SAIx 音频模块的状态。若在音频帧传输进行中将其禁用，则正在进行的传输将完成，并在该音频帧传输结束后完全禁用该单元。注意：当 SAIx 模块配置为主模式时，须在 SAIXEN 位置位之前确保 SAIx 输入端已有时钟信号。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA 使能。该位由软件置位或清零。注意：由于复位后音频模块默认作为发送器工作，因此在置位 DMAEN 之前须先配置 MODE[1:0] 位，以避免在接收模式下产生 DMA 请求。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOMCK</name>
              <description>无分频器</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKDIV</name>
              <description>主时钟分频器。这些位由软件置位或清零。当音频模块工作在从模式时，这些位无意义。须在音频模块禁用时进行配置。其他：主时钟频率按以下公式计算：</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>OSR</name>
              <description>主时钟过采样比</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
