Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SAI4">
      <name>SAI1</name>
      <baseAddress>0x40015800</baseAddress>
      <interrupt>
        <name>SAI1</name>
        <description>SAI1 global interrupt</description>
        <value>87</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SAI4">
      <name>SAI2</name>
      <baseAddress>0x40015C00</baseAddress>
      <interrupt>
        <name>SAI2</name>
        <description>SAI2 global interrupt</description>
        <value>91</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SAI4">
      <name>SAI3</name>
      <baseAddress>0x40016000</baseAddress>
      <interrupt>
        <name>SAI3</name>
        <description>SAI3 global interrupt</description>
        <value>114</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SDMMC1</name>
      <description>SDMMC1</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x52007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3FD</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SDMMC</name>
        <description>SDMMC 全局中断</description>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>SDMMC1</name>
        <description>SDMMC 全局中断</description>
        <value>49</value>
      </interrupt>
      <registers>
        <register>
          <name>POWER</name>
          <displayName>POWER</displayName>
          <description>SDMMC 电源控制寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRCTRL</name>
              <description>SDMMC 状态控制位。这些位仅可在 SDMMC 未处于上电状态（PWRCTRL ≠ 11）时写入。用于定义 SDMMC 信号的功能状态：任何后续写入将被忽略，PWRCTRL 值将保持 11。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VSWITCH</name>
              <description>电压切换序列启动。此位用于启动电压切换序列中的时序关键段：</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSWITCHEN</name>
              <description>电压切换过程使能。此位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。用于在电压切换命令响应后停止 SDMMC_CK：</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIRPOL</name>
              <description>数据和命令方向信号极性选择。此位仅可在 SDMMC 处于断电状态（PWRCTRL = 00）时写入。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCR</name>
          <displayName>CLKCR</displayName>
          <description>SDMMC_CLKCR 寄存器控制 SDMMC_CK 输出时钟、SDMMC_RX_CLK 接收时钟和总线宽度。</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>时钟分频因子。此位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。此字段定义输入时钟（SDMMCCLK）与输出时钟（SDMMC_CK）之间的分频比：SDMMC_CK 频率 = SDMMCCLK / [2 × CLKDIV]。0xx：等等.. xxx：等等..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PWRSAV</name>
              <description>省电配置位。此位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。为节省功耗，可通过设置 PWRSAV 在总线空闲时禁用 SDMMC_CK 时钟输出：</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIDBUS</name>
              <description>宽总线模式使能位。此位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NEGEDGE</name>
              <description>SDMMC_CK 数据和命令去相位选择位。此位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。当时钟分频 = 1（CLKDIV = 0）时，此位无效。数据和命令在 SDMMC_CK 下降沿变化。当时钟分频 &gt; 1（CLKDIV &gt; 0）且 DDR = 0 时：- SDMMC_CK 边沿出现在 SDMMCCLK 上升沿。当时钟分频 &gt; 1（CLKDIV &gt; 0）且 DDR = 1 时：- 数据在 SDMMC_CK 边沿之后的 SDMMCCLK 下降沿变化。- SDMMC_CK 边沿出现在 SDMMCCLK 上升沿。- 数据在 SDMMC_CK 边沿之后的 SDMMC_CK 下降沿变化。- SDMMC_CK 边沿出现在 SDMMCCLK 上升沿。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HWFC_EN</name>
              <description>硬件流控使能。此位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。当硬件流控使能后，TXFIFOE 和 RXFIFOF 标志的含义将发生改变，请参阅第 56.8.11 节中的 SDMMC 状态寄存器定义。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDR</name>
              <description>数据速率信令选择。此位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。DDR 速率仅可在 4 位或 8 位宽总线模式（WIDBUS &gt; 00）下选择。当 WIDBUS = 00（1 位宽总线）时，DDR = 1 无效。DDR 速率仅可在时钟分频 &gt; 1（CLKDIV &gt; 0）时选择。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSSPEED</name>
              <description>总线速度模式选择，可选 DS、HS、SDR12、SDR25、SDR50、DDR50、SDR104。此位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELCLKRX</name>
              <description>接收时钟选择。这些位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ARGR</name>
          <displayName>ARGR</displayName>
          <description>SDMMC_ARGR 寄存器包含一个 32 位命令参数，作为命令消息的一部分发送给卡。</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMDARG</name>
              <description>命令参数。这些位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。作为命令消息的一部分发送给卡的命令参数。如果命令包含参数，则必须在向命令寄存器写入命令之前将其加载到此寄存器中。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDR</name>
          <displayName>CMDR</displayName>
          <description>SDMMC_CMDR 寄存器包含命令索引和命令类型位。命令索引作为命令消息的一部分发送给卡。命令类型位控制命令路径状态机（CPSM）。</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMDINDEX</name>
              <description>命令索引。此位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。命令索引作为命令消息的一部分发送给卡。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CMDTRANS</name>
              <description>CPSM 将该命令视为数据传输命令，停止中断周期，并向 DPSM 发送 DataEnable 信号。此位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。如果此位置位，则 CPSM 在发送命令时发出中断周期结束信号，并向 DPSM 发出 DataEnable 信号。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSTOP</name>
              <description>CPSM 将该命令视为停止传输命令，并向 DPSM 发送 Abort 信号。此位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。如果此位置位，则 CPSM 在发送命令时向 DPSM 发出 Abort 信号。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITRESP</name>
              <description>等待响应位。此位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。用于配置 CPSM 是否等待响应，以及如需等待，等待何种类型的响应。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WAITINT</name>
              <description>CPSM 等待中断请求。如果此位置位，则 CPSM 禁用命令超时并等待卡中断请求（响应）。如果在 CPSM 等待状态下清除此位，将导致中断模式中止。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPEND</name>
              <description>CPSM 等待来自 DPSM 的数据传输结束信号（CmdPend 内部信号）。此位置位时，CPSM 在开始发送命令之前等待数据传输结束触发。WAITPEND 仅在 DTMODE = MMC 流数据传输、WIDBUS = 1 位宽总线模式、DPSMACT = 1 且 DTDIR = 主机到卡时生效。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSMEN</name>
              <description>命令路径状态机（CPSM）使能位。此位由固件写 1，当 CPSM 进入空闲状态时由硬件清零。如果此位置位，则 CPSM 使能。当 DTEN = 1 时，不会传输任何命令，也不会启动引导过程，CPSMEN 被清零为 0。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTHOLD</name>
              <description>在 DPSM 中暂停新数据块的发送和接收。如果此位置位，DPSM 将不会从 Wait_S 状态转移到 Send 状态，也不会从 Wait_R 状态转移到 Receive 状态。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTMODE</name>
              <description>选择要使用的引导模式过程。此位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTEN</name>
              <description>使能引导模式过程。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSUSPEND</name>
              <description>CPSM 将该命令视为挂起或恢复命令，并发出中断周期开始/结束信号。此位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。CMDSUSPEND = 1 且 CMDTRANS = 0：挂起命令，当响应位 BS = 0 时启动中断周期。CMDSUSPEND = 1 且 CMDTRANS = 1：带数据的恢复命令，当响应位 DF = 1 时结束中断周期。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP1R</name>
          <displayName>RESP1R</displayName>
          <description>SDMMC_RESP1/2/3/4R 寄存器包含卡的状态信息，该状态是接收到的响应的一部分。</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS1</name>
              <description>参见表 432。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP2R</name>
          <displayName>RESP2R</displayName>
          <description>SDMMC_RESP1/2/3/4R 寄存器包含卡的状态信息，该状态是接收到的响应的一部分。</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS2</name>
              <description>参见表 404。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP3R</name>
          <displayName>RESP3R</displayName>
          <description>SDMMC_RESP1/2/3/4R 寄存器包含卡的状态信息，该状态是接收到的响应的一部分。</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS3</name>
              <description>参见表 404。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP4R</name>
          <displayName>RESP4R</displayName>
          <description>SDMMC_RESP1/2/3/4R 寄存器包含卡的状态信息，该状态是接收到的响应的一部分。</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS4</name>
              <description>参见表 404。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTIMER</name>
          <displayName>DTIMER</displayName>
          <description>SDMMC_DTIMER 寄存器包含数据超时周期，以卡总线时钟周期为单位。一个计数器从 SDMMC_DTIMER 寄存器加载值，并在数据路径状态机（DPSM）进入 Wait_R 或 Busy 状态时开始递减。如果在 DPSM 处于上述任一状态时定时器计到 0，则超时状态标志置位。</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATATIME</name>
              <description>数据和 R1b 忙超时周期。此位仅可在 CPSM 和 DPSM 均未激活（CPSMACT = 0 且 DPSMACT = 0）时写入。以卡总线时钟周期为单位表示的数据和 R1b 忙超时周期。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DLENR</name>
          <displayName>DLENR</displayName>
          <description>SDMMC_DLENR 寄存器包含要传输的数据字节数。该值在数据传输开始时加载到数据计数器中。</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATALENGTH</name>
              <description>数据长度值。此寄存器仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。要传输的数据字节数。当 DDR = 1 时，DATALENGTH 被截断为 2 的倍数（最后一个奇数字节不被传输）。当 DATALENGTH = 0 时，不传输任何数据；当 CPSMEN 和 CMDTRANS = 1 请求时，也不传输任何命令，DTEN 和 CPSMEN 被清零为 0。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCTRL</name>
          <displayName>DCTRL</displayName>
          <description>SDMMC_DCTRL 寄存器控制数据路径状态机（DPSM）。</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTEN</name>
              <description>数据传输使能位。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。数据传输完成时由硬件清零。此位仅应在不使用关联数据传输命令时用于传输数据，即不应与 SD 或 eMMC 卡一起使用。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTDIR</name>
              <description>数据传输方向选择。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTMODE</name>
              <description>数据传输模式选择。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DBLOCKSIZE</name>
              <description>数据块大小。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。定义选择块数据传输模式时的数据块长度：当 DATALENGTH 不是 DBLOCKSIZE 的倍数时，传输的数据在 DBLOCKSIZE 的倍数处截断（任何剩余数据将不被传输）。当 DDR = 1 时，不得使用 DBLOCKSIZE = 0000（不会传输任何数据）。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RWSTART</name>
              <description>读等待启动。如果此位置位，读等待操作启动。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWSTOP</name>
              <description>读等待停止。此位由固件写入，当 DPSM 从 READ_WAIT 状态转移到 WAIT_R 或 IDLE 状态时由硬件自动清零。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWMOD</name>
              <description>读等待模式。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOEN</name>
              <description>SD I/O 中断使能功能。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。如果此位置位，则 DPSM 使能 SD I/O 卡特定的中断操作。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTACKEN</name>
              <description>使能引导确认的接收。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFORST</name>
              <description>FIFO 复位，将清空所有剩余数据。此位仅可在 IDMAEN = 0 且 DPSM 激活（DPSMACT = 1）时由固件写入。此位仅在发生传输错误或传输暂停时生效。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCNTR</name>
          <displayName>DCNTR</displayName>
          <description>当 DPSM 从空闲状态转移到 Wait_R 或 Wait_S 状态时，SDMMC_DCNTR 寄存器从数据长度寄存器（参见 SDMMC_DLENR）加载值。随着数据传输，计数器递减该值直到达到 0。然后 DPSM 转移到空闲状态，当没有错误发生时，数据状态结束标志（DATAEND）置位。</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATACOUNT</name>
              <description>数据计数值。读取时，返回剩余待传输的数据字节数。写入无效。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
