Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>STAR</name>
          <displayName>STAR</displayName>
          <description>SDMMC_STAR 寄存器为只读寄存器。包含两种类型的标志：静态标志（位 [29, 21, 11:0]）：这些位保持有效状态，直到通过写入 SDMMC 中断清零寄存器（参见 SDMMC_ICR）将其清零。动态标志（位 [20:12]）：这些位根据底层逻辑的状态改变状态（例如，FIFO 满和空标志在数据写入 FIFO 时置位和清零）。</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCRCFAIL</name>
              <description>收到命令响应（CRC 校验失败）。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCRCFAIL</name>
              <description>数据块已发送/接收（CRC 校验失败）。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIMEOUT</name>
              <description>命令响应超时。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。命令超时周期固定为 64 个 SDMMC_CK 时钟周期。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIMEOUT</name>
              <description>数据超时。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNDERR</name>
              <description>发送 FIFO 欠载错误或 IDMA 读传输错误。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVERR</name>
              <description>接收 FIFO 溢出错误或 IDMA 写传输错误。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDREND</name>
              <description>收到命令响应（CRC 校验通过或无 CRC）。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSENT</name>
              <description>命令已发送（无需响应）。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAEND</name>
              <description>数据传输正确结束（数据计数器 DATACOUNT 为零且未发生错误）。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DHOLD</name>
              <description>数据传输暂停。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBCKEND</name>
              <description>数据块已发送/接收（CRC 校验通过），且 DPSM 转移到 READWAIT 状态。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DABORT</name>
              <description>数据传输被 CMD12 中止。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPSMACT</name>
              <description>数据路径状态机激活，即不在空闲状态。此标志仅为硬件状态标志，不产生中断。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSMACT</name>
              <description>命令路径状态机激活，即不在空闲状态。此标志仅为硬件状态标志，不产生中断。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOHE</name>
              <description>发送 FIFO 半空。至少有一半容量的字可写入 FIFO。当 FIFO 变为半满 + 1 时，此位清零。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOHF</name>
              <description>接收 FIFO 半满。FIFO 中至少有总容量一半的字数。当 FIFO 变为半空 + 1 时，此位清零。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOF</name>
              <description>发送 FIFO 满。此标志仅为硬件状态标志，不产生中断。当 FIFO 有一个位置变为空时，此位清零。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOF</name>
              <description>接收 FIFO 满。当 FIFO 有一个位置变为空时，此位清零。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOE</name>
              <description>发送 FIFO 空。当 FIFO 有一个位置变为满时，此位清零。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOE</name>
              <description>接收 FIFO 空。此标志仅为硬件状态标志，不产生中断。当 FIFO 有一个位置变为满时，此位清零。</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYD0</name>
              <description>SDMMC_D0 线（Busy）的反相值，在 CMD 响应结束时采样一次，并在 CMD 响应后 2 个 SDMMC_CK 周期再次采样。当 SDMMC_D0 线从忙变为不忙时，此位复位为不忙。此位不指示由数据传输引起的忙状态。此标志仅为硬件状态标志，不产生中断。</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYD0END</name>
              <description>检测到 CMD 响应后的 SDMMC_D0 忙结束。这仅指示 CMD 响应后的忙结束。此位不指示由数据传输引起的忙状态。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOIT</name>
              <description>收到 SDIO 中断。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKFAIL</name>
              <description>收到引导确认（引导确认校验失败）。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKTIMEOUT</name>
              <description>引导确认超时。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSWEND</name>
              <description>电压切换时序关键段完成。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKSTOP</name>
              <description>SDMMC_CK 在电压切换过程中停止。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMATE</name>
              <description>IDMA 传输错误。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABTC</name>
              <description>IDMA 缓冲区传输完成。通过写入 SDMMC_ICR 中对应的中断清零位来清除此中断标志。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>SDMMC_ICR 寄存器为只写寄存器。将某位写 1 可清零 SDMMC_STAR 状态寄存器中对应的位。</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCRCFAILC</name>
              <description>CCRCFAIL 标志清零位。由软件置位以清零 CCRCFAIL 标志。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCRCFAILC</name>
              <description>DCRCFAIL 标志清零位。由软件置位以清零 DCRCFAIL 标志。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIMEOUTC</name>
              <description>CTIMEOUT 标志清零位。由软件置位以清零 CTIMEOUT 标志。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIMEOUTC</name>
              <description>DTIMEOUT 标志清零位。由软件置位以清零 DTIMEOUT 标志。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNDERRC</name>
              <description>TXUNDERR 标志清零位。由软件置位以清零 TXUNDERR 标志。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVERRC</name>
              <description>RXOVERR 标志清零位。由软件置位以清零 RXOVERR 标志。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDRENDC</name>
              <description>CMDREND 标志清零位。由软件置位以清零 CMDREND 标志。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSENTC</name>
              <description>CMDSENT 标志清零位。由软件置位以清零 CMDSENT 标志。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAENDC</name>
              <description>DATAEND 标志清零位。由软件置位以清零 DATAEND 标志。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DHOLDC</name>
              <description>DHOLD 标志清零位。由软件置位以清零 DHOLD 标志。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBCKENDC</name>
              <description>DBCKEND 标志清零位。由软件置位以清零 DBCKEND 标志。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DABORTC</name>
              <description>DABORT 标志清零位。由软件置位以清零 DABORT 标志。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYD0ENDC</name>
              <description>BUSYD0END 标志清零位。由软件置位以清零 BUSYD0END 标志。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOITC</name>
              <description>SDIOIT 标志清零位。由软件置位以清零 SDIOIT 标志。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKFAILC</name>
              <description>ACKFAIL 标志清零位。由软件置位以清零 ACKFAIL 标志。</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKTIMEOUTC</name>
              <description>ACKTIMEOUT 标志清零位。由软件置位以清零 ACKTIMEOUT 标志。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSWENDC</name>
              <description>VSWEND 标志清零位。由软件置位以清零 VSWEND 标志。</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKSTOPC</name>
              <description>CKSTOP 标志清零位。由软件置位以清零 CKSTOP 标志。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMATEC</name>
              <description>IDMA 传输错误清零位。由软件置位以清零 IDMATE 标志。</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABTCC</name>
              <description>IDMA 缓冲区传输完成清零位。由软件置位以清零 IDMABTC 标志。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MASKR</name>
          <displayName>MASKR</displayName>
          <description>中断屏蔽寄存器通过将对应位置 1 来确定哪些状态标志产生中断请求。</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCRCFAILIE</name>
              <description>命令 CRC 校验失败中断使能。由软件置位/清零以使能/禁用由命令 CRC 校验失败引起的中断。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCRCFAILIE</name>
              <description>数据 CRC 校验失败中断使能。由软件置位/清零以使能/禁用由数据 CRC 校验失败引起的中断。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIMEOUTIE</name>
              <description>命令超时中断使能。由软件置位/清零以使能/禁用由命令超时引起的中断。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIMEOUTIE</name>
              <description>数据超时中断使能。由软件置位/清零以使能/禁用由数据超时引起的中断。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNDERRIE</name>
              <description>发送 FIFO 欠载错误中断使能。由软件置位/清零以使能/禁用由发送 FIFO 欠载错误引起的中断。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVERRIE</name>
              <description>接收 FIFO 溢出错误中断使能。由软件置位/清零以使能/禁用由接收 FIFO 溢出错误引起的中断。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDRENDIE</name>
              <description>命令响应接收中断使能。由软件置位/清零以使能/禁用由收到命令响应引起的中断。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSENTIE</name>
              <description>命令发送中断使能。由软件置位/清零以使能/禁用由命令发送引起的中断。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAENDIE</name>
              <description>数据结束中断使能。由软件置位/清零以使能/禁用由数据结束引起的中断。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DHOLDIE</name>
              <description>数据暂停中断使能。由软件置位/清零以使能/禁用在 DPSM Wait_S 状态下暂停发送新数据时产生的中断。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBCKENDIE</name>
              <description>数据块结束中断使能。由软件置位/清零以使能/禁用由数据块结束引起的中断。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DABORTIE</name>
              <description>数据传输中止中断使能。由软件置位/清零以使能/禁用由数据传输被中止引起的中断。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOHEIE</name>
              <description>发送 FIFO 半空中断使能。由软件置位/清零以使能/禁用由发送 FIFO 半空引起的中断。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOHFIE</name>
              <description>接收 FIFO 半满中断使能。由软件置位/清零以使能/禁用由接收 FIFO 半满引起的中断。</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOFIE</name>
              <description>接收 FIFO 满中断使能。由软件置位/清零以使能/禁用由接收 FIFO 满引起的中断。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOEIE</name>
              <description>发送 FIFO 空中断使能。由软件置位/清零以使能/禁用由发送 FIFO 空引起的中断。</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYD0ENDIE</name>
              <description>BUSYD0END 中断使能。由软件置位/清零以使能/禁用在 CMD 响应后 SDMMC_D0 信号从忙变为不忙时产生的中断。</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOITIE</name>
              <description>SDIO 模式中断接收中断使能。由软件置位/清零以使能/禁用接收到 SDIO 模式中断时产生的中断。</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKFAILIE</name>
              <description>确认失败中断使能。由软件置位/清零以使能/禁用由确认失败引起的中断。</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKTIMEOUTIE</name>
              <description>确认超时中断使能。由软件置位/清零以使能/禁用由确认超时引起的中断。</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSWENDIE</name>
              <description>电压切换时序关键段完成中断使能。由软件置位/清零以使能/禁用电压切换时序关键段完成时产生的中断。</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKSTOPIE</name>
              <description>电压切换时钟停止中断使能。由软件置位/清零以使能/禁用由电压切换时钟停止引起的中断。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABTCIE</name>
              <description>IDMA 缓冲区传输完成中断使能。由软件置位/清零以使能/禁用 IDMA 完成传输某个内存缓冲区的全部数据时产生的中断。</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACKTIMER</name>
          <displayName>ACKTIMER</displayName>
          <description>SDMMC_ACKTIMER 寄存器包含确认超时周期，以 SDMMC_CK 总线时钟周期为单位。一个计数器从 SDMMC_ACKTIMER 寄存器加载值，并在数据路径状态机（DPSM）进入 Wait_Ack 状态时开始递减。如果在 DPSM 处于此状态时定时器计到 0，则确认超时状态标志置位。</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACKTIME</name>
              <description>引导确认超时周期。此位仅可在 CPSM 禁用（CPSMEN = 0）时由固件写入。以卡总线时钟周期为单位表示的引导确认超时周期。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDMACTRLR</name>
          <displayName>IDMACTRLR</displayName>
          <description>接收和发送 FIFO 可作为 32 位宽寄存器进行读写。FIFO 在 32 个连续地址上包含 32 个条目。这允许 CPU 使用其加载和存储多条指令来读写 FIFO。</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDMAEN</name>
              <description>IDMA 使能。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABMODE</name>
              <description>缓冲区模式选择。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABACT</name>
              <description>双缓冲区模式激活缓冲区指示。此位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。当 IDMA 使能时，此位由硬件翻转。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDMABSIZER</name>
          <displayName>IDMABSIZER</displayName>
          <description>SDMMC_IDMABSIZER 寄存器包含双缓冲区配置下的缓冲区大小。</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDMABNDT</name>
              <description>每缓冲区传输次数。此 8 位值乘以 8 可得到以 32 位字为单位的缓冲区大小，乘以 32 可得到以字节为单位的缓冲区大小。示例：IDMABNDT = 0x01：缓冲区大小 = 8 字 = 32 字节。这些位仅可在 DPSM 未激活（DPSMACT = 0）时由固件写入。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDMABASE0R</name>
          <displayName>IDMABASE0R</displayName>
          <description>SDMMC_IDMABASE0R 寄存器包含单缓冲区配置下的内存缓冲区基地址，以及双缓冲区配置下的缓冲区 0 基地址。</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDMABASE0</name>
              <description>缓冲区 0 内存基地址位 [31:2]，应按字对齐（位 [1:0] 始终为 0 且只读）。此寄存器可在 DPSM 未激活（DPSMACT = 0）时由固件写入，也可在 DPSM 激活（DPSMACT = 1）且内存缓冲区 0 未激活（IDMABACT = 1）时由固件动态写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDMABASE1R</name>
          <displayName>IDMABASE1R</displayName>
          <description>SDMMC_IDMABASE1R 寄存器包含双缓冲区配置下第二个缓冲区的内存基地址。</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDMABASE1</name>
              <description>缓冲区 1 内存基地址，应按字对齐（位 [1:0] 始终为 0 且只读）。此寄存器可在 DPSM 未激活（DPSMACT = 0）时由固件写入，也可在 DPSM 激活（DPSMACT = 1）且内存缓冲区 1 未激活（IDMABACT = 0）时由固件动态写入。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOR</name>
          <displayName>FIFOR</displayName>
          <description>接收和发送 FIFO 只能作为字（32 位）宽寄存器进行读写。FIFO 在连续地址上包含 16 个条目。这允许 CPU 使用其加载和存储多条指令来读写 FIFO。当以半字或字节方式访问 SDMMC_FIFOR 时，会产生 AHB 总线故障。</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFODATA</name>
              <description>接收和发送 FIFO 数据。此寄存器仅可在 DPSM 激活（DPSMACT = 1）时由固件读写。FIFO 数据占用 16 个 32 位字条目。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
