Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>VER</name>
          <displayName>VER</displayName>
          <description>SDMMC IP 版本寄存器</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>IP 次版本号。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>IP 主版本号。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ID</name>
          <displayName>ID</displayName>
          <description>SDMMC IP 标识寄存器</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00140022</resetValue>
          <fields>
            <field>
              <name>IP_ID</name>
              <description>SDMMC IP 标识。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESPCMDR</name>
          <displayName>RESPCMDR</displayName>
          <description>SDMMC 命令响应寄存器</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>RESPCMD</name>
              <description>响应命令索引</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC2</name>
      <baseAddress>0x48022400</baseAddress>
    </peripheral>
    <peripheral>
      <name>VREFBUF</name>
      <description>VREFBUF</description>
      <groupName>VREFBUF</groupName>
      <baseAddress>0x58003C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>VREFBUF 控制与状态寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>ENVR</name>
              <description>电压参考缓冲器模式使能。此位用于使能电压参考缓冲器模式。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIZ</name>
              <description>高阻抗模式。此位控制模拟开关与 VREF+ 引脚的连接或断开。有关基于 ENVR 位配置的模式说明，请参见表 196：VREF 缓冲器模式。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VRR</name>
              <description>电压参考缓冲器就绪</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VRS</name>
              <description>电压参考量程。这些位用于选择电压参考缓冲器产生的电压值。其他值：保留。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>VREFBUF 校准控制寄存器</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIM</name>
              <description>微调代码。这些位在复位后会自动加载生产测试期间存入 Flash 的微调值。向这些位写入数据可微调内部参考缓冲器电压。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <description>独立看门狗</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x58004800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <displayName>KR</displayName>
          <description>键寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>键值（只写，读取返回 0x0000）。软件必须定期向这些位写入键值 0xAAAA，否则当计数器递减到 0 时，看门狗将产生复位。写入键值 0x5555 可使能对 IWDG_PR、IWDG_RLR 和 IWDG_WINR 寄存器的访问（参见第 23.3.6 节：寄存器访问保护）。写入键值 0xCCCC 启动看门狗（选择了硬件看门狗选项时除外）。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <displayName>PR</displayName>
          <description>预分频器寄存器</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PR</name>
              <description>预分频器分频系数。这些位受写访问保护，参见第 23.3.6 节：寄存器访问保护。由软件写入，用于选择为计数器提供时钟的预分频器分频系数。要修改预分频器分频系数，必须先将 IWDG_SR 寄存器的 PVU 位复位。注意：读取本寄存器返回的是 VDD 电压域中的预分频器值。若对该寄存器的写操作正在进行中，该值可能不是最新的或无效。因此，仅当 IWDG_SR 寄存器中的 PVU 位复位时，从本寄存器读取的值才有效。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <displayName>RLR</displayName>
          <description>重装载寄存器</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>RL</name>
              <description>看门狗计数器重装载值。这些位受写访问保护，参见第 23.3.6 节。由软件写入，用于定义每次向 IWDG_KR 寄存器写入 0xAAAA 时要装载到看门狗计数器中的值。看门狗计数器从此值开始递减计数。超时周期由该值和时钟预分频器共同决定。有关超时信息，请参阅数据手册。要修改重装载值，必须先将 IWDG_SR 寄存器中的 RVU 位复位。注意：读取本寄存器返回的是 VDD 电压域中的重装载值。若对该寄存器的写操作正在进行中，该值可能不是最新的或无效。因此，仅当 IWDG_SR 寄存器中的 RVU 位复位时，从本寄存器读取的值才有效。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>状态寄存器</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PVU</name>
              <description>看门狗预分频器值更新。此位由硬件置 1，表示预分频器值更新正在进行中。当预分频器更新操作在 VDD 电压域中完成时（最多需要 5 个 RC 40 kHz 时钟周期），由硬件复位。仅当 PVU 位复位时，才能更新预分频器值。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVU</name>
              <description>看门狗计数器重装载值更新。此位由硬件置 1，表示重装载值更新正在进行中。当重装载值更新操作在 VDD 电压域中完成时（最多需要 5 个 RC 40 kHz 时钟周期），由硬件复位。仅当 RVU 位复位时，才能更新重装载值。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WVU</name>
              <description>看门狗计数器窗口值更新。此位由硬件置 1，表示窗口值更新正在进行中。当重装载值更新操作在 VDD 电压域中完成时（最多需要 5 个 RC 40 kHz 时钟周期），由硬件复位。仅当 WVU 位复位时，才能更新窗口值。仅当 generic window = 1 时才会生成此位。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINR</name>
          <displayName>WINR</displayName>
          <description>窗口寄存器</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>WIN</name>
              <description>看门狗计数器窗口值。这些位受写访问保护，参见第 23.3.6 节。这些位包含窗口值的高限，用于与递减计数器进行比较。为防止复位，必须在递减计数器的值小于窗口寄存器值且大于 0x0 时对其进行重装载。要修改重装载值，必须先将 IWDG_SR 寄存器中的 WVU 位复位。注意：读取本寄存器返回的是 VDD 电压域中的重装载值。若对该寄存器的写操作正在进行中，该值可能无效。因此，仅当 IWDG_SR 寄存器中的 WVU 位复位时，从本寄存器读取的值才有效。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
