Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDG</name>
      <description>WWDG</description>
      <groupName>WWDG</groupName>
      <baseAddress>0x50003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WWDG1_RST</name>
        <description>窗口看门狗中断</description>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>WWDG1</name>
        <description>窗口看门狗中断</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>控制寄存器</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>T</name>
              <description>7 位计数器（MSB 至 LSB）。这些位存储看门狗计数器的值。计数器每 (4096 x 2^WDGTB[1:0]) 个 PCLK 周期递减一次。当计数器从 0x40 递减至 0x3F（T6 被清零）时，将产生复位。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGA</name>
              <description>激活位。此位由软件置 1，仅能在复位后由硬件清零。当 WDGA=1 时，看门狗可产生复位。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <displayName>CFR</displayName>
          <description>配置寄存器</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>W</name>
              <description>7 位窗口值。这些位存储与递减计数器进行比较的窗口值。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGTB</name>
              <description>定时器时基。预分频器的时基可如下修改：</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EWI</name>
              <description>提前唤醒中断。此位置 1 后，每当计数器到达 0x40 时即产生中断。此中断仅能在复位后由硬件清零。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>状态寄存器</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EWIF</name>
              <description>提前唤醒中断标志。当计数器到达 0x40 时，此位由硬件置 1。必须由软件写入 0 来清零，写入 1 无效。即使中断未使能，此位也会被置 1。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>PWR</description>
      <groupName>PWR</groupName>
      <baseAddress>0x58024800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>PWR 控制寄存器 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xF000C000</resetValue>
          <fields>
            <field>
              <name>LPDS</name>
              <description>低功耗深度睡眠，配合 SVOS3 使用（SVOS4 和 SVOS5 始终使用低功耗模式，不受此位设置影响）</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDE</name>
              <description>可编程电压检测器使能</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLS</name>
              <description>可编程电压检测器阈值选择 这些位用于选择 PVD 检测的电压阈值。注意：更多详细信息请参阅产品数据手册的电气特性章节。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBP</name>
              <description>禁用备份域写保护 在复位状态下，RCC_BDCR 寄存器、RTC 寄存器（包括备份寄存器）、PWR_CR2 寄存器中的 BREN 和 MOEN 位均受到保护，防止寄生写入。必须将此位置 1 才能使能对这些寄存器的写访问。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLPS</name>
              <description>DStop 模式下 Flash 低功耗模式 此位用于在退出 DStop 模式时，在低功耗与重启时间之间取得最佳平衡。置位后，当 D1 域进入 DStop 模式时，Flash 存储器将进入低功耗模式。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SVOS</name>
              <description>系统停止模式电压调节选择 这些位控制系统 Stop 模式下的 VCORE 电压等级，以在功耗与性能之间取得最佳平衡。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AVDEN</name>
              <description>VDDA 外设电压监控器使能</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALS</name>
              <description>模拟电压检测器阈值选择 这些位用于选择 AVD 检测的电压阈值。</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR1</name>
          <displayName>CSR1</displayName>
          <description>PWR 控制状态寄存器 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>PVDO</name>
              <description>可编程电压检测输出 此位由硬件置位和清零。仅当 PVD 已通过 PVDE 位使能时才有效。注意：由于 PVD 在待机模式下被禁用，因此在待机或复位后，此位保持为 0，直到 PVDE 位置位。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOSRDY</name>
              <description>当前使用的 VOS 和 SDLEVEL 电压等级就绪位 当电压调节器和 SD 转换器均被禁用，且在 PWR 控制寄存器 3（PWR_CR3）中选择了旁路模式时，此位由硬件置 1。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOS</name>
              <description>当前应用于 VCORE 电压调节选择的 VOS。这些位反映最近一次写入 PMU 的 VOS 值。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AVDO</name>
              <description>VDDA 模拟电压检测器输出 此位由硬件置位和清零。仅当 VDDA 上的 AVD 已通过 AVDEN 位使能时才有效。注意：由于 AVD 在待机模式下被禁用，因此在待机或复位后，此位保持为 0，直到 AVDEN 位置位。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>此寄存器不受待机模式唤醒、RESET 信号和 VDD 上电复位的影响。仅由 VSW 上电复位和 VSWRST 复位来复位。当 RCC_BDCR 寄存器中的 VSWRST 位复位 VSW 域时，不得访问此寄存器。复位后，PWR_CR2 寄存器处于写保护状态。修改其内容之前，必须先将 PWR_CR1 寄存器中的 DBP 位置位以解除写保护。</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BREN</name>
              <description>备份调压器使能 置位后，备份调压器（用于在待机和 VBAT 模式下保持备份 RAM 内容）被使能。若 BREN 清零，则备份调压器关闭。备份 RAM 在运行和停止模式下仍可使用，但其内容将在待机和 VBAT 模式下丢失。若 BREN 置位，应用程序必须等待备份调压器就绪标志（BRRDY）置位，以表明写入 SRAM 的数据将在待机和 VBAT 模式下得到保持。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MONEN</name>
              <description>VBAT 和温度监控使能 置位后，VBAT 电源和温度监控被使能。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRRDY</name>
              <description>备份调压器就绪 此位由硬件置位，用于指示备份调压器已就绪。</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBATL</name>
              <description>VBAT 电平低于低阈值监控</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBATH</name>
              <description>VBAT 电平高于高阈值监控</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPL</name>
              <description>温度低于低阈值监控</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPH</name>
              <description>温度高于高阈值监控</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <displayName>CR3</displayName>
          <description>仅由上电复位（POR）复位，不受待机模式唤醒和 RESET 引脚的复位影响。此寄存器的低字节在 POR 后仅可写入一次，且应在更改 VOS 等级或 ck_sys 时钟频率之前写入。高字节无此限制。写入与 SDLEVEL、SDEXTHP、SDEN、LDOEN 和 BYPASS 位的无效组合（见表 9）对应的数据将被忽略：数据不会被写入，一次性写入机制将锁定该寄存器，任何后续写访问都将被忽略。默认电源配置将保持不变，PWR 控制状态寄存器 1（PWR_CSR1）中的 ACTVOSRDY 位将继续指示无效的电压等级。在写入新值之前，需要对系统进行下电再上电。</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>电源管理单元旁路</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOEN</name>
              <description>低压差调压器使能</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCUEN</name>
              <description>SD 转换器使能</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBE</name>
              <description>VBAT 充电使能</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBRS</name>
              <description>VBAT 充电电阻选择</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB33DEN</name>
              <description>VDD33USB 电压电平检测器使能</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBREGEN</name>
              <description>USB 调压器使能</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB33RDY</name>
              <description>USB 电源就绪</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUCR</name>
          <displayName>CPUCR</displayName>
          <description>此寄存器用于控制 CPU1 的电源。</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDDS_D1</name>
              <description>D1 域断电深度睡眠选择。此位允许 CPU1 定义 D1 域的深度睡眠模式。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDDS_D2</name>
              <description>D2 域断电深度睡眠。此位允许 CPU1 定义 D2 域的深度睡眠模式。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDDS_D3</name>
              <description>系统 D3 域断电深度睡眠。此位允许 CPU1 定义系统 D3 域的深度睡眠模式。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>STOP 标志 此位由硬件置位，仅可通过任意复位或将 CPU1 CSSF 位置位来清零。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF</name>
              <description>系统待机标志 此位由硬件置位，仅可通过上电复位（POR）或将 CPU1 CSSF 位置位来清零。</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF_D1</name>
              <description>D1 域 DStandby 标志 此位由硬件置位，可通过任意系统复位或将 CPU1 CSSF 位置位来清零。一旦置位，仅当 D1 域不再处于 DStandby 模式时才能清除此位。</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF_D2</name>
              <description>D2 域 DStandby 标志 此位由硬件置位，可通过任意系统复位或将 CPU1 CSSF 位置位来清零。一旦置位，仅当 D2 域不再处于 DStandby 模式时才能清除此位。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSSF</name>
              <description>清除 D1 域 CPU1 的 Standby、Stop 和 HOLD 标志（读取时始终为 0）此位由硬件清零为 0。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN_D3</name>
              <description>无论 CPU 子系统处于何种模式，保持系统 D3 域处于运行模式</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D3CR</name>
          <displayName>D3CR</displayName>
          <description>此寄存器用于控制 D3 域的电源。复位后，软件读取 VOSRDY 将为 1。</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>VOSRDY</name>
              <description>VCORE 电压调节输出选择的 VOS 就绪位。当在 PWR 控制寄存器 3（PWR_CR3）中选择旁路模式时，此位由硬件置 1。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VOS</name>
              <description>根据性能选择电压调节 这些位控制 VCORE 电压等级，用于在功耗与性能之间取得最佳平衡：提高性能时，应在提升系统频率之前先更改电压调节等级。降低性能时，应先降低系统频率，再更改电压调节等级。</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPCR</name>
          <displayName>WKUPCR</displayName>
          <description>仅由系统复位复位，不受待机模式唤醒影响。写入此寄存器需要 5 个等待状态（清除 PWR_WKUPFR 中的 WKUPF 位时，AHB 写访问将在 WKUPF 被清除后完成）。</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKUPC</name>
              <description>清除 WKUP 唤醒引脚标志。这些位读取时始终为 0。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPFR</name>
          <displayName>WKUPFR</displayName>
          <description>仅由系统复位复位，不受待机模式唤醒影响</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKUPF1</name>
              <description>唤醒引脚 WKUPF 标志。此位由硬件置位，仅可通过复位引脚或将 PWR 唤醒清除寄存器（PWR_WKUPCR）中的 WKUPCn+1 位置位来清零。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF2</name>
              <description>唤醒引脚 WKUPF 标志。此位由硬件置位，仅可通过复位引脚或将 PWR 唤醒清除寄存器（PWR_WKUPCR）中的 WKUPCn+1 位置位来清零。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF3</name>
              <description>唤醒引脚 WKUPF 标志。此位由硬件置位，仅可通过复位引脚或将 PWR 唤醒清除寄存器（PWR_WKUPCR）中的 WKUPCn+1 位置位来清零。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF4</name>
              <description>唤醒引脚 WKUPF 标志。此位由硬件置位，仅可通过复位引脚或将 PWR 唤醒清除寄存器（PWR_WKUPCR）中的 WKUPCn+1 位置位来清零。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF5</name>
              <description>唤醒引脚 WKUPF 标志。此位由硬件置位，仅可通过复位引脚或将 PWR 唤醒清除寄存器（PWR_WKUPCR）中的 WKUPCn+1 位置位来清零。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF6</name>
              <description>唤醒引脚 WKUPF 标志。此位由硬件置位，仅可通过复位引脚或将 PWR 唤醒清除寄存器（PWR_WKUPCR）中的 WKUPCn+1 位置位来清零。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPEPR</name>
          <displayName>WKUPEPR</displayName>
          <description>仅由系统复位复位，不受待机模式唤醒影响</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKUPEN1</name>
              <description>使能唤醒引脚 WKUPn+1 每个位由软件置位和清零。注意：若在 WKUPn+1 引脚电平已为高（且 WKUPPn+1 选择上升沿）或已为低（且 WKUPPn+1 选择下降沿）时，使能 WKUPn+1 引脚（通过置位 WKUPENn+1 位），则会检测到一个额外的唤醒事件。</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN2</name>
              <description>使能唤醒引脚 WKUPn+1 每个位由软件置位和清零。注意：若在 WKUPn+1 引脚电平已为高（且 WKUPPn+1 选择上升沿）或已为低（且 WKUPPn+1 选择下降沿）时，使能 WKUPn+1 引脚（通过置位 WKUPENn+1 位），则会检测到一个额外的唤醒事件。</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN3</name>
              <description>使能唤醒引脚 WKUPn+1 每个位由软件置位和清零。注意：若在 WKUPn+1 引脚电平已为高（且 WKUPPn+1 选择上升沿）或已为低（且 WKUPPn+1 选择下降沿）时，使能 WKUPn+1 引脚（通过置位 WKUPENn+1 位），则会检测到一个额外的唤醒事件。</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN4</name>
              <description>使能唤醒引脚 WKUPn+1 每个位由软件置位和清零。注意：若在 WKUPn+1 引脚电平已为高（且 WKUPPn+1 选择上升沿）或已为低（且 WKUPPn+1 选择下降沿）时，使能 WKUPn+1 引脚（通过置位 WKUPENn+1 位），则会检测到一个额外的唤醒事件。</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN5</name>
              <description>使能唤醒引脚 WKUPn+1 每个位由软件置位和清零。注意：若在 WKUPn+1 引脚电平已为高（且 WKUPPn+1 选择上升沿）或已为低（且 WKUPPn+1 选择下降沿）时，使能 WKUPn+1 引脚（通过置位 WKUPENn+1 位），则会检测到一个额外的唤醒事件。</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN6</name>
              <description>使能唤醒引脚 WKUPn+1 每个位由软件置位和清零。注意：若在 WKUPn+1 引脚电平已为高（且 WKUPPn+1 选择上升沿）或已为低（且 WKUPPn+1 选择下降沿）时，使能 WKUPn+1 引脚（通过置位 WKUPENn+1 位），则会检测到一个额外的唤醒事件。</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP1</name>
              <description>WKUPn-7 唤醒引脚极性位 这些位定义 WKUPn-7 外部唤醒引脚用于事件检测的极性。</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP2</name>
              <description>WKUPn-7 唤醒引脚极性位 这些位定义 WKUPn-7 外部唤醒引脚用于事件检测的极性。</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP3</name>
              <description>WKUPn-7 唤醒引脚极性位 这些位定义 WKUPn-7 外部唤醒引脚用于事件检测的极性。</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP4</name>
              <description>WKUPn-7 唤醒引脚极性位 这些位定义 WKUPn-7 外部唤醒引脚用于事件检测的极性。</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP5</name>
              <description>WKUPn-7 唤醒引脚极性位 这些位定义 WKUPn-7 外部唤醒引脚用于事件检测的极性。</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP6</name>
              <description>WKUPn-7 唤醒引脚极性位 这些位定义 WKUPn-7 外部唤醒引脚用于事件检测的极性。</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD1</name>
              <description>唤醒引脚上下拉配置</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD2</name>
              <description>唤醒引脚上下拉配置</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD3</name>
              <description>唤醒引脚上下拉配置</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD4</name>
              <description>唤醒引脚上下拉配置</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD5</name>
              <description>唤醒引脚上下拉配置</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD6</name>
              <description>WKUP(truncate(n/2)-7) 唤醒引脚上下拉配置 这些位定义当 WKUPEN(truncate(n/2)-7) = 1 时使用的 I/O 焊盘上下拉配置。相关 GPIO 端口的上下拉配置应设为相同的值或设为 00。唤醒引脚的上下拉配置在待机模式下保持不变。</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
