Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>D3PCR1L</name>
          <displayName>D3PCR1L</displayName>
          <description>EXTI D3 挂起清除选择寄存器（低位）</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS0</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS1</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS2</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS3</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS4</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS5</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS6</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS7</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS8</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS9</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS10</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS11</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS12</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS13</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS14</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS15</name>
              <description>事件输入 x = truncate(n/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR1H</name>
          <displayName>D3PCR1H</displayName>
          <description>EXTI D3 挂起清除选择寄存器（高位）</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS19</name>
              <description>事件输入 x = truncate((n+32)/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS20</name>
              <description>事件输入 x = truncate((n+32)/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS21</name>
              <description>事件输入 x = truncate((n+32)/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS25</name>
              <description>事件输入 x = truncate((n+32)/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSR2</name>
          <displayName>RTSR2</displayName>
          <description>EXTI 上升沿触发选择寄存器</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR49</name>
              <description>可配置事件输入 x+32 的上升沿触发事件配置位</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR51</name>
              <description>可配置事件输入 x+32 的上升沿触发事件配置位</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR2</name>
          <displayName>FTSR2</displayName>
          <description>EXTI 下降沿触发选择寄存器</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR49</name>
              <description>可配置事件输入 x+32 的下降沿触发事件配置位</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR51</name>
              <description>可配置事件输入 x+32 的下降沿触发事件配置位</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER2</name>
          <displayName>SWIER2</displayName>
          <description>EXTI 软件中断事件寄存器</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWIER49</name>
              <description>线 x+32 的软件中断</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIER51</name>
              <description>线 x+32 的软件中断</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PMR2</name>
          <displayName>D3PMR2</displayName>
          <description>EXTI D3 挂起屏蔽寄存器</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR34</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR35</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR41</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR48</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR49</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR50</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR51</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR52</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR53</name>
              <description>事件输入 x+32 的 D3 挂起屏蔽</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR2L</name>
          <displayName>D3PCR2L</displayName>
          <description>EXTI D3 挂起清除选择寄存器（低位）</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS35</name>
              <description>事件输入 x = truncate((n+64)/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS34</name>
              <description>事件输入 x = truncate((n+64)/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS41</name>
              <description>事件输入 x = truncate((n+64)/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR2H</name>
          <displayName>D3PCR2H</displayName>
          <description>EXTI D3 挂起清除选择寄存器（高位）</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS48</name>
              <description>事件输入 x = truncate((n+96)/2) 的挂起请求清除输入信号选择</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS49</name>
              <description>事件输入 x = truncate((n+96)/2) 的挂起请求清除输入信号选择</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS50</name>
              <description>事件输入 x = truncate((n+96)/2) 的挂起请求清除输入信号选择</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS51</name>
              <description>事件输入 x = truncate((n+96)/2) 的挂起请求清除输入信号选择</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS52</name>
              <description>事件输入 x = truncate((n+96)/2) 的挂起请求清除输入信号选择</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS53</name>
              <description>事件输入 x = truncate((n+96)/2) 的挂起请求清除输入信号选择</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSR3</name>
          <displayName>RTSR3</displayName>
          <description>EXTI 上升沿触发选择寄存器</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR82</name>
              <description>可配置事件输入 x+64 的上升沿触发事件配置位</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR84</name>
              <description>可配置事件输入 x+64 的上升沿触发事件配置位</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR85</name>
              <description>可配置事件输入 x+64 的上升沿触发事件配置位</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR86</name>
              <description>可配置事件输入 x+64 的上升沿触发事件配置位</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR3</name>
          <displayName>FTSR3</displayName>
          <description>EXTI 下降沿触发选择寄存器</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR82</name>
              <description>可配置事件输入 x+64 的下降沿触发事件配置位</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR84</name>
              <description>可配置事件输入 x+64 的下降沿触发事件配置位</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR85</name>
              <description>可配置事件输入 x+64 的下降沿触发事件配置位</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR86</name>
              <description>可配置事件输入 x+64 的下降沿触发事件配置位</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER3</name>
          <displayName>SWIER3</displayName>
          <description>EXTI 软件中断事件寄存器</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWIER82</name>
              <description>线 x+64 的软件中断</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIER84</name>
              <description>线 x+64 的软件中断</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIER85</name>
              <description>线 x+64 的软件中断</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIER86</name>
              <description>线 x+64 的软件中断</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PMR3</name>
          <displayName>D3PMR3</displayName>
          <description>EXTI D3 挂起屏蔽寄存器</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR88</name>
              <description>事件输入 x+64 的 D3 挂起屏蔽</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR3H</name>
          <displayName>D3PCR3H</displayName>
          <description>EXTI D3 挂起清除选择寄存器（高位）</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS88</name>
              <description>事件输入 x = truncate((N+160)/2) 的 D3 挂起请求清除输入信号选择</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
