Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>CPUIMR2</name>
          <displayName>CPUIMR2</displayName>
          <description>EXTI 中断屏蔽寄存器</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR0</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR1</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR2</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR3</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR4</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR5</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR6</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR7</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR8</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR9</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR10</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR11</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR12</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR14</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR15</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR16</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR17</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR18</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR19</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR20</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR21</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR22</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR23</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR24</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR25</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR26</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR27</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR28</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR29</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR30</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR31</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUEMR2</name>
          <displayName>CPUEMR2</displayName>
          <description>EXTI 事件屏蔽寄存器</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR32</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR33</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR34</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR35</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR36</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR37</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR38</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR39</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR40</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR41</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR42</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR43</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR44</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR46</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR47</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR48</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR49</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR50</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR51</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR52</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR53</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR54</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR55</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR56</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR57</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR58</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR59</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR60</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR61</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR62</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR63</name>
              <description>直接事件输入 x+32 的 CPU 中断屏蔽</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUPR2</name>
          <displayName>CPUPR2</displayName>
          <description>EXTI 挂起寄存器</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PR49</name>
              <description>可配置事件输入 x+32 的挂起位</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PR51</name>
              <description>可配置事件输入 x+32 的挂起位</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIMR3</name>
          <displayName>CPUIMR3</displayName>
          <description>EXTI 中断屏蔽寄存器</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR64</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR65</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR66</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR67</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR68</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR69</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR70</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR71</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR72</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR73</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR74</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR75</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR76</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR77</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR78</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR79</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR80</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR82</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR84</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR85</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR86</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR87</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR88</name>
              <description>直接事件输入 x+64 的 CPU 中断屏蔽</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
