Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>CRCEADD2R</name>
          <displayName>CRCEADD2R</displayName>
          <description>闪存 CRC 结束地址寄存器（Bank 2）</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_END_ADDR</name>
              <description>Bank 2 CRC 结束地址</description>
              <bitOffset>2</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDATAR_</name>
          <displayName>CRCDATAR_</displayName>
          <description>闪存 CRC 数据寄存器（别名）</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_DATA</name>
              <description>CRC 计算结果</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_FA2R</name>
          <displayName>ECC_FA2R</displayName>
          <description>闪存 ECC 错误地址寄存器（Bank 2）</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAIL_ECC_ADDR2</name>
              <description>Bank 2 ECC 错误地址</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AXI</name>
      <description>AXI 互连寄存器</description>
      <groupName>AXI</groupName>
      <baseAddress>0x51000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AXI_PERIPH_ID_4</name>
          <displayName>AXI_PERIPH_ID_4</displayName>
          <description>AXI 互连 - 外设 ID4 寄存器</description>
          <addressOffset>0x1FD0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>JEP106CON</name>
              <description>JEP106 延续码</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>KCOUNT4</name>
              <description>寄存器文件大小</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERIPH_ID_0</name>
          <displayName>AXI_PERIPH_ID_0</displayName>
          <description>AXI 互连 - 外设 ID0 寄存器</description>
          <addressOffset>0x1FE0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PARTNUM</name>
              <description>外设部件编号位 0~7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERIPH_ID_1</name>
          <displayName>AXI_PERIPH_ID_1</displayName>
          <description>AXI 互连 - 外设 ID1 寄存器</description>
          <addressOffset>0x1FE4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PARTNUM</name>
              <description>外设部件编号位 8~11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>JEP106I</name>
              <description>JEP106 标识位 0~3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERIPH_ID_2</name>
          <displayName>AXI_PERIPH_ID_2</displayName>
          <description>AXI 互连 - 外设 ID2 寄存器</description>
          <addressOffset>0x1FE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>JEP106ID</name>
              <description>JEP106 标识位 4~6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>JEDEC</name>
              <description>JEP106 编码标志</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REVISION</name>
              <description>外设版本号</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERIPH_ID_3</name>
          <displayName>AXI_PERIPH_ID_3</displayName>
          <description>AXI 互连 - 外设 ID3 寄存器</description>
          <addressOffset>0x1FEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>CUST_MOD_NUM</name>
              <description>客户修改</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REV_AND</name>
              <description>客户版本</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_COMP_ID_0</name>
          <displayName>AXI_COMP_ID_0</displayName>
          <description>AXI 互连 - 组件 ID0 寄存器</description>
          <addressOffset>0x1FF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>前导码位 0~7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_COMP_ID_1</name>
          <displayName>AXI_COMP_ID_1</displayName>
          <description>AXI 互连 - 组件 ID1 寄存器</description>
          <addressOffset>0x1FF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>前导码位 8~11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLASS</name>
              <description>组件类别</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_COMP_ID_2</name>
          <displayName>AXI_COMP_ID_2</displayName>
          <description>AXI 互连 - 组件 ID2 寄存器</description>
          <addressOffset>0x1FF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>前导码位 12~19</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_COMP_ID_3</name>
          <displayName>AXI_COMP_ID_3</displayName>
          <description>AXI 互连 - 组件 ID3 寄存器</description>
          <addressOffset>0x1FFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>前导码位 20~27</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG1_FN_MOD_ISS_BM</displayName>
          <description>AXI 互连 - TARG x 总线矩阵发送功能寄存器</description>
          <addressOffset>0x2008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>读发送覆写</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>目标端交换矩阵写发送覆写</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG2_FN_MOD_ISS_BM</displayName>
          <description>AXI 互连 - TARG x 总线矩阵发送功能寄存器</description>
          <addressOffset>0x3008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>读发送覆写</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>目标端交换矩阵写发送覆写</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG3_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG3_FN_MOD_ISS_BM</displayName>
          <description>AXI 互连 - TARG x 总线矩阵发送功能寄存器</description>
          <addressOffset>0x4008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>读发送覆写</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>目标端交换矩阵写发送覆写</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG4_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG4_FN_MOD_ISS_BM</displayName>
          <description>AXI 互连 - TARG x 总线矩阵发送功能寄存器</description>
          <addressOffset>0x5008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>读发送覆写</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>目标端交换矩阵写发送覆写</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG5_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG5_FN_MOD_ISS_BM</displayName>
          <description>AXI 互连 - TARG x 总线矩阵发送功能寄存器</description>
          <addressOffset>0x6008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>读发送覆写</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>目标端交换矩阵写发送覆写</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG6_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG6_FN_MOD_ISS_BM</displayName>
          <description>AXI 互连 - TARG x 总线矩阵发送功能寄存器</description>
          <addressOffset>0x7008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>读发送覆写</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>目标端交换矩阵写发送覆写</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG7_FN_MOD_ISS_BM</displayName>
          <description>AXI 互连 - TARG x 总线矩阵发送功能寄存器</description>
          <addressOffset>0x800C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>读发送覆写</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>目标端交换矩阵写发送覆写</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD2</name>
          <displayName>AXI_TARG1_FN_MOD2</displayName>
          <description>AXI 互连 - TARG x 总线矩阵功能 2 寄存器</description>
          <addressOffset>0x2024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>禁用节拍合并以匹配输出数据位宽</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD2</name>
          <displayName>AXI_TARG2_FN_MOD2</displayName>
          <description>AXI 互连 - TARG x 总线矩阵功能 2 寄存器</description>
          <addressOffset>0x3024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>禁用节拍合并以匹配输出数据位宽</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD2</name>
          <displayName>AXI_TARG7_FN_MOD2</displayName>
          <description>AXI 互连 - TARG x 总线矩阵功能 2 寄存器</description>
          <addressOffset>0x8024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>禁用节拍合并以匹配输出数据位宽</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD_LB</name>
          <displayName>AXI_TARG1_FN_MOD_LB</displayName>
          <description>AXI 互连 - TARG x 长突发功能修改寄存器</description>
          <addressOffset>0x202C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>FN_MOD_LB</name>
              <description>控制长突发的突发拆分</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD_LB</name>
          <displayName>AXI_TARG2_FN_MOD_LB</displayName>
          <description>AXI 互连 - TARG x 长突发功能修改寄存器</description>
          <addressOffset>0x302C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>FN_MOD_LB</name>
              <description>控制长突发的突发拆分</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD</name>
          <displayName>AXI_TARG1_FN_MOD</displayName>
          <description>AXI 互连 - TARG x 长突发功能修改寄存器</description>
          <addressOffset>0x2108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 AMIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 AMIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD</name>
          <displayName>AXI_TARG2_FN_MOD</displayName>
          <description>AXI 互连 - TARG x 长突发功能修改寄存器</description>
          <addressOffset>0x3108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 AMIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 AMIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD</name>
          <displayName>AXI_TARG7_FN_MOD</displayName>
          <description>AXI 互连 - TARG x 长突发功能修改寄存器</description>
          <addressOffset>0x8108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 AMIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 AMIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD2</name>
          <displayName>AXI_INI1_FN_MOD2</displayName>
          <description>AXI 互连 - INI x 功能修改 2 寄存器</description>
          <addressOffset>0x42024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>禁止上行位宽转换器修改传输事务（协议要求时除外）</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD2</name>
          <displayName>AXI_INI3_FN_MOD2</displayName>
          <description>AXI 互连 - INI x 功能修改 2 寄存器</description>
          <addressOffset>0x44024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>禁止上行位宽转换器修改传输事务（协议要求时除外）</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD_AHB</name>
          <displayName>AXI_INI1_FN_MOD_AHB</displayName>
          <description>AXI 互连 - INI x AHB 功能修改寄存器</description>
          <addressOffset>0x42028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>RD_INC_OVERRIDE</name>
              <description>将所有 AHB-Lite 写传输转换为一系列单节拍 AXI 传输</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_INC_OVERRIDE</name>
              <description>将所有 AHB-Lite 读传输转换为一系列单节拍 AXI 传输</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD_AHB</name>
          <displayName>AXI_INI3_FN_MOD_AHB</displayName>
          <description>AXI 互连 - INI x AHB 功能修改寄存器</description>
          <addressOffset>0x44028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>RD_INC_OVERRIDE</name>
              <description>将所有 AHB-Lite 写传输转换为一系列单节拍 AXI 传输</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_INC_OVERRIDE</name>
              <description>将所有 AHB-Lite 读传输转换为一系列单节拍 AXI 传输</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI1_READ_QOS</name>
          <displayName>AXI_INI1_READ_QOS</displayName>
          <description>AXI 互连 - INI x 读 QoS 寄存器</description>
          <addressOffset>0x42100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>读通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
