Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>AXI_INI2_READ_QOS</name>
          <displayName>AXI_INI2_READ_QOS</displayName>
          <description>AXI 互连 - INI x 读 QoS 寄存器</description>
          <addressOffset>0x43100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>读通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI3_READ_QOS</name>
          <displayName>AXI_INI3_READ_QOS</displayName>
          <description>AXI 互连 - INI x 读 QoS 寄存器</description>
          <addressOffset>0x44100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>读通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI4_READ_QOS</name>
          <displayName>AXI_INI4_READ_QOS</displayName>
          <description>AXI 互连 - INI x 读 QoS 寄存器</description>
          <addressOffset>0x45100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>读通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI5_READ_QOS</name>
          <displayName>AXI_INI5_READ_QOS</displayName>
          <description>AXI 互连 - INI x 读 QoS 寄存器</description>
          <addressOffset>0x46100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>读通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI6_READ_QOS</name>
          <displayName>AXI_INI6_READ_QOS</displayName>
          <description>AXI 互连 - INI x 读 QoS 寄存器</description>
          <addressOffset>0x47100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>读通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI1_WRITE_QOS</name>
          <displayName>AXI_INI1_WRITE_QOS</displayName>
          <description>AXI 互连 - INI x 写 QoS 寄存器</description>
          <addressOffset>0x42104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>写通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI2_WRITE_QOS</name>
          <displayName>AXI_INI2_WRITE_QOS</displayName>
          <description>AXI 互连 - INI x 写 QoS 寄存器</description>
          <addressOffset>0x43104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>写通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI3_WRITE_QOS</name>
          <displayName>AXI_INI3_WRITE_QOS</displayName>
          <description>AXI 互连 - INI x 写 QoS 寄存器</description>
          <addressOffset>0x44104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>写通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI4_WRITE_QOS</name>
          <displayName>AXI_INI4_WRITE_QOS</displayName>
          <description>AXI 互连 - INI x 写 QoS 寄存器</description>
          <addressOffset>0x45104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>写通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI5_WRITE_QOS</name>
          <displayName>AXI_INI5_WRITE_QOS</displayName>
          <description>AXI 互连 - INI x 写 QoS 寄存器</description>
          <addressOffset>0x46104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>写通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI6_WRITE_QOS</name>
          <displayName>AXI_INI6_WRITE_QOS</displayName>
          <description>AXI 互连 - INI x 写 QoS 寄存器</description>
          <addressOffset>0x47104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>写通道 QoS 设置</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD</name>
          <displayName>AXI_INI1_FN_MOD</displayName>
          <description>AXI 互连 - INI x 发送功能修改寄存器</description>
          <addressOffset>0x42108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 ASIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 ASIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI2_FN_MOD</name>
          <displayName>AXI_INI2_FN_MOD</displayName>
          <description>AXI 互连 - INI x 发送功能修改寄存器</description>
          <addressOffset>0x43108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 ASIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 ASIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD</name>
          <displayName>AXI_INI3_FN_MOD</displayName>
          <description>AXI 互连 - INI x 发送功能修改寄存器</description>
          <addressOffset>0x44108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 ASIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 ASIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI4_FN_MOD</name>
          <displayName>AXI_INI4_FN_MOD</displayName>
          <description>AXI 互连 - INI x 发送功能修改寄存器</description>
          <addressOffset>0x45108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 ASIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 ASIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI5_FN_MOD</name>
          <displayName>AXI_INI5_FN_MOD</displayName>
          <description>AXI 互连 - INI x 发送功能修改寄存器</description>
          <addressOffset>0x46108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 ASIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 ASIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI6_FN_MOD</name>
          <displayName>AXI_INI6_FN_MOD</displayName>
          <description>AXI 互连 - INI x 发送功能修改寄存器</description>
          <addressOffset>0x47108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>覆写 ASIB 读发送能力</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>覆写 ASIB 写发送能力</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
