Bit-Walker/RM-Borad-Alpha-H743XIH6/STM32H743_zh.svd
        <register>
          <name>DFSDM1_RDATAR</name>
          <displayName>DFSDM1_RDATAR</displayName>
          <description>DFSDM 常规通道数据寄存器</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATACH</name>
              <description>最近完成转换的常规通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RPEND</name>
              <description>常规通道待处理数据</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDATA</name>
              <description>常规通道转换数据</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM2_RDATAR</name>
          <displayName>DFSDM2_RDATAR</displayName>
          <description>DFSDM 常规通道数据寄存器</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATACH</name>
              <description>最近完成转换的常规通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RPEND</name>
              <description>常规通道待处理数据</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDATA</name>
              <description>常规通道转换数据</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM3_RDATAR</name>
          <displayName>DFSDM3_RDATAR</displayName>
          <description>DFSDM 常规通道数据寄存器</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATACH</name>
              <description>最近完成转换的常规通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RPEND</name>
              <description>常规通道待处理数据</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDATA</name>
              <description>常规通道转换数据</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM0_AWHTR</name>
          <displayName>DFSDM0_AWHTR</displayName>
          <description>DFSDM 模拟看门狗高阈值寄存器</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWH</name>
              <description>模拟看门狗高阈值事件刹车信号分配</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWHT</name>
              <description>模拟看门狗高阈值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM1_AWHTR</name>
          <displayName>DFSDM1_AWHTR</displayName>
          <description>DFSDM 模拟看门狗高阈值寄存器</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWH</name>
              <description>模拟看门狗高阈值事件刹车信号分配</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWHT</name>
              <description>模拟看门狗高阈值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM2_AWHTR</name>
          <displayName>DFSDM2_AWHTR</displayName>
          <description>DFSDM 模拟看门狗高阈值寄存器</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWH</name>
              <description>模拟看门狗高阈值事件刹车信号分配</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWHT</name>
              <description>模拟看门狗高阈值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM3_AWHTR</name>
          <displayName>DFSDM3_AWHTR</displayName>
          <description>DFSDM 模拟看门狗高阈值寄存器</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWH</name>
              <description>模拟看门狗高阈值事件刹车信号分配</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWHT</name>
              <description>模拟看门狗高阈值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM0_AWLTR</name>
          <displayName>DFSDM0_AWLTR</displayName>
          <description>DFSDM 模拟看门狗低阈值寄存器</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWL</name>
              <description>模拟看门狗低阈值事件刹车信号分配</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWLT</name>
              <description>模拟看门狗低阈值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM1_AWLTR</name>
          <displayName>DFSDM1_AWLTR</displayName>
          <description>DFSDM 模拟看门狗低阈值寄存器</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWL</name>
              <description>模拟看门狗低阈值事件刹车信号分配</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWLT</name>
              <description>模拟看门狗低阈值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM2_AWLTR</name>
          <displayName>DFSDM2_AWLTR</displayName>
          <description>DFSDM 模拟看门狗低阈值寄存器</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWL</name>
              <description>模拟看门狗低阈值事件刹车信号分配</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWLT</name>
              <description>模拟看门狗低阈值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM3_AWLTR</name>
          <displayName>DFSDM3_AWLTR</displayName>
          <description>DFSDM 模拟看门狗低阈值寄存器</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWL</name>
              <description>模拟看门狗低阈值事件刹车信号分配</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWLT</name>
              <description>模拟看门狗低阈值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM0_AWSR</name>
          <displayName>DFSDM0_AWSR</displayName>
          <description>DFSDM 模拟看门狗状态寄存器</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWLTF</name>
              <description>模拟看门狗低阈值标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWHTF</name>
              <description>模拟看门狗高阈值标志</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM1_AWSR</name>
          <displayName>DFSDM1_AWSR</displayName>
          <description>DFSDM 模拟看门狗状态寄存器</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWLTF</name>
              <description>模拟看门狗低阈值标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWHTF</name>
              <description>模拟看门狗高阈值标志</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM2_AWSR</name>
          <displayName>DFSDM2_AWSR</displayName>
          <description>DFSDM 模拟看门狗状态寄存器</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWLTF</name>
              <description>模拟看门狗低阈值标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWHTF</name>
              <description>模拟看门狗高阈值标志</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM3_AWSR</name>
          <displayName>DFSDM3_AWSR</displayName>
          <description>DFSDM 模拟看门狗状态寄存器</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWLTF</name>
              <description>模拟看门狗低阈值标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWHTF</name>
              <description>模拟看门狗高阈值标志</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM0_AWCFR</name>
          <displayName>DFSDM0_AWCFR</displayName>
          <description>DFSDM 模拟看门狗标志清除寄存器</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRAWLTF</name>
              <description>清除模拟看门狗低阈值标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRAWHTF</name>
              <description>清除模拟看门狗高阈值标志</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM1_AWCFR</name>
          <displayName>DFSDM1_AWCFR</displayName>
          <description>DFSDM 模拟看门狗标志清除寄存器</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRAWLTF</name>
              <description>清除模拟看门狗低阈值标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRAWHTF</name>
              <description>清除模拟看门狗高阈值标志</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM2_AWCFR</name>
          <displayName>DFSDM2_AWCFR</displayName>
          <description>DFSDM 模拟看门狗标志清除寄存器</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRAWLTF</name>
              <description>清除模拟看门狗低阈值标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRAWHTF</name>
              <description>清除模拟看门狗高阈值标志</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM3_AWCFR</name>
          <displayName>DFSDM3_AWCFR</displayName>
          <description>DFSDM 模拟看门狗标志清除寄存器</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRAWLTF</name>
              <description>清除模拟看门狗低阈值标志</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRAWHTF</name>
              <description>清除模拟看门狗高阈值标志</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM0_EXMAX</name>
          <displayName>DFSDM0_EXMAX</displayName>
          <description>DFSDM 极值检测器最大值寄存器</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMAXCH</name>
              <description>极值检测器最大值数据通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMAX</name>
              <description>极值检测器最大值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM1_EXMAX</name>
          <displayName>DFSDM1_EXMAX</displayName>
          <description>DFSDM 极值检测器最大值寄存器</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMAXCH</name>
              <description>极值检测器最大值数据通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMAX</name>
              <description>极值检测器最大值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM2_EXMAX</name>
          <displayName>DFSDM2_EXMAX</displayName>
          <description>DFSDM 极值检测器最大值寄存器</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMAXCH</name>
              <description>极值检测器最大值数据通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMAX</name>
              <description>极值检测器最大值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM3_EXMAX</name>
          <displayName>DFSDM3_EXMAX</displayName>
          <description>DFSDM 极值检测器最大值寄存器</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMAXCH</name>
              <description>极值检测器最大值数据通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMAX</name>
              <description>极值检测器最大值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM0_EXMIN</name>
          <displayName>DFSDM0_EXMIN</displayName>
          <description>DFSDM 极值检测器最小值寄存器</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMINCH</name>
              <description>极值检测器最小值数据通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMIN</name>
              <description>极值检测器最小值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM1_EXMIN</name>
          <displayName>DFSDM1_EXMIN</displayName>
          <description>DFSDM 极值检测器最小值寄存器</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMINCH</name>
              <description>极值检测器最小值数据通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMIN</name>
              <description>极值检测器最小值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM2_EXMIN</name>
          <displayName>DFSDM2_EXMIN</displayName>
          <description>DFSDM 极值检测器最小值寄存器</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMINCH</name>
              <description>极值检测器最小值数据通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMIN</name>
              <description>极值检测器最小值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM3_EXMIN</name>
          <displayName>DFSDM3_EXMIN</displayName>
          <description>DFSDM 极值检测器最小值寄存器</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMINCH</name>
              <description>极值检测器最小值数据通道</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMIN</name>
              <description>极值检测器最小值</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM0_CNVTIMR</name>
          <displayName>DFSDM0_CNVTIMR</displayName>
          <description>DFSDM 转换定时器寄存器</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNVCNT</name>
              <description>28 位转换时间计数定时器</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM1_CNVTIMR</name>
          <displayName>DFSDM1_CNVTIMR</displayName>
          <description>DFSDM 转换定时器寄存器</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNVCNT</name>
              <description>28 位转换时间计数定时器</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM2_CNVTIMR</name>
          <displayName>DFSDM2_CNVTIMR</displayName>
          <description>DFSDM 转换定时器寄存器</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNVCNT</name>
              <description>28 位转换时间计数定时器</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
            </field>
          </fields>
        </register>
